[{"author": "Sarah Keating", "body": "“Kopi lah,” says the elderly Singaporean man, leaning against the counter of the café. The stall holder hands him a bag filled with thick, creamy coffee sweetened with condensed milk. “Do people ever ask for healthier options?” I ask the woman behind the counter. She laughs. “Getting better,” she says, suggesting that people are creatures of habit.\n\nAs I wander through the market, the air dense with the smells of noodle soup, barbequed pork and sweet satay, I notice red stickers dotted on various stalls. “Healthier options available here”, reads one. “We use healthier oil”, reads another. It’s part of the Health Promotion Board’s Healthy Dining Programme where food and beverage providers get a grant if they provide healthier options for diners. It’s an indication of the small but not insignificant ways the government ‘nudges’ the population to make better choices.\n\nYou might also like:\n\nEver since the city state on the southern tip of the Malay Peninsula passed the ripe old age of 50, the administration has been keen to look outwards, to learn from and collaborate with other countries in order to shape its future. One such strategy has been to collaborate with the UK government’s Behavioural Insights Team, nicknamed the “Nudge Unit”, which uses the Nobel Prize-winning concept of “nudge theory”. This is based around the idea that people can make better choices through simple discreet policies while still retaining their freedom of choice. Nudge theory is certainly de rigeur among policy makers across the world at the moment but Singapore has actually been using similar strategies long before it became fashionable. And to understand why, you have to look back at the country’s history.\n\nIt is known for being the epitome of order and efficiency and, more importantly, the place where chewing gum is banned. Today it is one of the financial centres of the world but this has been hard-won. Following its expulsion from the Federation of Malaysia and subsequent independence in 1965, Singapore was left riddled with many socio-economic problems. Along with unemployment, lack of education and sub-standard housing, it was also a country lacking natural resources and land.\n\nThe man who took on this gargantuan task was the late Prime Minister Lee Kuan Yew. He recognised that Singapore had to change in order to thrive. \"We knew that if we were just like our neighbours, we would die. Because we've got nothing to offer against what they have to offer. So we had to produce something which is different and better than what they have. It's incorrupt. It's efficient. It's meritocratic. It works,” he told the New York Times.\n\nAnd in order to make it work, the government had to take control in order to develop a society in which people’s material needs were met. They built high-rise social housing called HDB’s, and industrialisation and inward foreign investment resulted in job creation. Slowly this infant nation started to take shape.\n\nNumerous public campaigns were established in order to lay down foundations of as well as create a sense of social identity in a disparate and multicultural population. The early campaigns were about improving the cleanliness and hygiene of the environment. “Keep Singapore Clean” and “Plant Trees” were common slogans that spearheaded these campaigns. Other campaigns focussed on family planning urging people to “Stop at 2”. As Singapore became more affluent, the National Courtesy Campaign was implemented as well as one encouraging people to speak Mandarin to create a more cohesive, considerate and civilised society.\n\nIn 1986, Lee Kuan Yew said “I am often accused of interfering in the private lives of citizens. Yes, if I did not, had I not done that, we wouldn't be here today… we would not have made economic progress, if we had not intervened on very personal matters - who your neighbour is, how you live, the noise you make, how you spit, or what language you use. We decide what is right.\"\n\nThis strategy paid off within 50 years, and the economy has become one of the most innovative and business-friendly in the world. But while Singapore still loves a public campaign, it has moved toward a more nuanced approach of influencing the behaviours of its inhabitants.\n\nNudging the population isn’t uniquely Singaporean; more than 150 governments across the globe have tried nudging as a better choice. A medical centre in Qatar, for example, managed to increase the uptake of diabetes screening by offering to test people during Ramadan. People were fasting anyway so the hassle of having to not eat before your testing was removed. It was convenient and timely, two key components to a successful nudge.\n\nTowns in Iceland, India and China have trialed ‘floating zebra crossings’ – 3D optical illusions which make the crossings look like they are floating above the ground designed to urge drivers to slow down. And in order to get people to pay their taxes in the UK, people were sent a letter saying that the majority of taxpayers pay their taxes on time which has had very positive results. Using social norms make people want to conform.\n\nIn Singapore some of the nudges you come across are remarkably simple. Rubbish bins are placed away from bus stops to separate smokers from other bus users. Utility bills display how your energy consumption compares to your neighbours. Outdoor gyms have been built near the entrances and exits of HDB estates so they are easy to use, available and prominent enough to remind you consistently. Train stations have green and red arrows on the platform indicating where you should stand so as to speed up the alighting process. If you opt to travel at off-peak times (before 0700), your fare is reduced.\n\nAnd with six out of 10 Singaporeans eating at food courts four or more times a week, getting people to eat healthier is also a priority. As well as the Healthier Dining Programme, some places make it cheaper to take the healthy option. If you’re determined to eat that Fried Bee Hoon at Khoo Teck Puat Hospital, for example, you’re going to have to pay more for it.\n\nThe National Steps Challenge, which encourages participants to get exercising using free step counters in exchange for cash and prizes, has been so successful that the programme name has been trademarked. This form of gamifying is one of the more successful ways of engaging users in achieving objectives. Massive queues to collect the free fitness tracker demonstrated the programme’s popularity.\n\nAnd it’s not just in tangible ways that nudges are being rolled out. Citizens pay into a mandatory savings programme called the Central Provident Fund at a high rate. This can be accessed for healthcare, housing and pensions as a way to get people to save long-term because evidence has shown that people are too short-sighted when it comes to financing their future.\n\nAnd as the government looks to increase the population 30% by 2030, the city-state’s ageing population and declining birth rate is a problem. The Baby Bonus Scheme goes some way to encouraging parents to have more children by offering cash incentives. Introduced in 2001, the scheme means that all Singapore citizens who have a baby get a cash gift as well as a money into a Child Development Account (CDA) which can be used to pay for childcare and healthcare. The more children you have, the more money you get – since March 2016 you get a cash gift of $8,000 SGD (£4,340) for your first child and up to $10,000 (£5,430) for the third and any subsequent children, as well as money into your CDA.\n\nSo do people like being nudged? Is there any cultural difference in the way people react to being swayed toward a ‘better’ choice or behaviour? Given the breadth of the international use of behavioural insights, there is relatively little research done into whether people are happy about it. What research is available from Europe and the United States suggests that people are largely approving as long as it fits in with their values and interests. For example, when it comes to making calorie content more readily available in fast food restaurants or being asked whether you want to be an organ donor when you get your driving licence, people are largely supportive.\n\nIn a study that looked at how people in Australia, Brazil, Canada, China, Japan, Russia, South Africa, and South Korea reacted, the results largely correlated to European and United States results with a few exceptions. China and South Korea showed “spectacularly high approval rates” while Japan showed “significantly lower approval ratings” in line with results from Denmark and Hungary in a European study.\n\nAlthough there is no definitive research into why this is the case, it is suggested that support for nudges are higher in countries where the issues addressed are of direct concern to the citizens – air pollution in China for example. A potential correlation also has been drawn between support for nudges and the level of trust in government. Hungary, which had one of the lowest levels of support for nudges, also has a low level of trust in its government – only 28% according to the OECD. China, on the other hand, had overwhelmingly positive attitudes to nudges and also a high level in trust for the government.\n\nAlthough Singapore was not included in the worldwide study, the level of trust in government is high and could possibly indicate that support for nudges is then also high.\n\nSo what is the future for nudges in Singapore? According to the Innovation Lab – a multi-disciplinary team within the Public Service Division that designs public policies and services from the viewpoint of citizens and stakeholders – the future is digital.\n\nA spokesperson says that citizens expect public services to catch up or do better than the private sector when they go digital. People already use devices such as chat bots and virtual or augmented reality interfaces in the private sector. They want the public sector to follow suit.\n\nThere is a sense that public services are benchmarked against people’s experiences with the commercial sector. The way in which we engage with the world is becoming faster, more hi-tech and arguably more removed from the real world. You only have to look at the popularity of the game Pokemon Go to see the buzz around virtual reality. And so the Singaporean government doesn’t want to get left behind.\n\nAs I step back into the shiny metropolis surrounded by the glinting metal and glass of 30-storey high rises, it’s easy to forget that just over 50 years ago none of this would have been here, not even the land in some areas. And while not everyone is a fan of such an intimate social contract between state and citizen, there’s no denying that Singapore has been master of its own destiny. Through nudges and careful ‘choice architecture’, this Little Red Dot has ploughed its own path.\n\nJoin 800,000+ Future fans by liking us on Facebook, or follow us on Twitter.\n\nIf you liked this story, sign up for the weekly bbc.com features newsletter, called “If You Only Read 6 Things This Week”. A handpicked selection of stories from BBC Future, Earth, Culture, Capital, and Travel, delivered to your inbox every Friday.", "link": null, "source": "BBC.com", "location": []}, {"author": "", "body": "Russian official Alexei Sorokin has assured Arsenal fans they will have nothing to fear in Moscow next month.\n\nArsenal face CSKA Moscow in the Europa League quarter-finals amid political tension between the UK and Russia.\n\nBut Sorokin, chief of Russia's World Cup organising committee, has played down safety concerns for UK visitors.\n\n\"We will ensure security in equal measures to all, from dignitaries to fans,\" Sorokin told TASS, the government-owned Russian news agency.\n\n\"It is a shame that the games will be played in such circumstances.\"\n\nOn Wednesday, the Foreign Office updated its travel advice for Russia, warning UK nationals of \"the possibility of anti-British sentiment or harassment\".\n\nThat advice was reposted on Arsenal's website after the Europa League draw was made on Friday.\n\n\"There are absolutely no grounds for such warnings,\" added Sorokin, who is also a senior member of the Russian Football Union.\n\n\"To us, there is no difference which country people come from or what our diplomatic relations with them are.\"\n\nOn Saturday, Russia announced it is to expel 23 British diplomats in a row over the nerve agent attack on an-ex spy and his daughter in the UK.\n\nThe Russian foreign ministry said the UK staff would be expelled from Moscow within a week in response to Britain's decision to expel 23 Russian diplomats.\n\nArsenal will host the first leg at Emirates Stadium on 5 April, with the return game to be played in Moscow on 12 April.", "link": null, "source": "BBC.com", "location": []}, {"author": "", "body": "UK government ministers and members of the Royal Family will not attend the World Cup in Russia after a Russian-made nerve agent was used on an ex-spy.\n\nSergei Skripal and his daughter, Yulia, are in a critical condition after the incident in Salisbury on 4 March.\n\nPrime Minister Theresa May said on Wednesday that the relationship between the two countries \"cannot be the same\".\n\nIt was previously reported that Prince William, the president of the Football Association (FA), would not attend.\n\nWhen asked whether senior FA officials should also not go to the World Cup - which runs from 14 June to 15 July - Mrs May said: \"I'm sure they will want to be considering their position.\n\n\"Attendance at sporting events is a matter for the sporting authorities - it's a matter for them.\"\n\nOn Tuesday, the FA had made no changes to plans for England's presence in Russia.\n\nMrs May, speaking at Prime Minister's Questions, said the government would \"look at security and protection of any UK football fans travelling to the World Cup\".\n\nShe also announced that the UK will expel 23 Russian diplomats and revoke an invitation to the Russian foreign minister to visit the country.\n\nRussia denies being involved in the attempted murder of Sergei Skripal.", "link": null, "source": "BBC.com", "location": []}, {"author": "", "body": "Jose Mourinho will be taking \"blood money\" by working for Russian state-backed channel RT during the World Cup, according to Chris Bryant MP.\n\nIt was announced that the Manchester United boss would be appearing on the channel last week, a day after an ex-Russian spy and his daughter were poisoned by a nerve agent in Salisbury.\n\nPrime Minister Theresa May says it is \"highly likely\" Russia is responsible.\n\nBryant has previously called for RT's \"propaganda\" to be banned in the UK.\n\nMourinho has refused to answer questions on his involvement with the channel - formerly known as Russia Today - since last week's poisoning.\n\nThe Times reported that he will be paid at least £1m for five days' work as a pundit this summer.\n\n\"To my mind, this is blood money, paid directly from the Russian state coffers,\" said Bryant, a Labour MP who in 2015 briefly served as shadow secretary of state for digital, culture, media and sport.\n\nSergei Skripal, 66, and Yulia Skripal, 33, remain in a critical but stable condition after being found slumped on a bench near the Maltings shopping centre in Salisbury, Wiltshire, on Sunday 4 March.\n\nPrime Minister May has said the UK must \"stand ready\" to take action against Russia and that this would be set out in the Commons on Wednesday should there be no adequate explanation from the Kremlin by midnight on Tuesday.\n\nRussia's foreign minister Sergei Lavrov has described claims of state involvement as \"rubbish\".", "link": null, "source": "BBC.com", "location": []}, {"author": "Howard Amos,", "body": "Russia is not only Putin; there are many other people there\n\nThe format of BBC Debates is based on the concept of a university debating society. The University of Oxford and the Ashmolean Museum, the University's Arts Gallery which was chosen as the first programme venue, is home to one of the oldest debating societies in the world: the Oxford Union.\n\nThe topic of the inaugural edition of the programme, ahead of the 18 March presidential election in Russia, is the future of Russia-West relations. Presented by BBC Russian’s Oleg Boldyrev, BBC Debates provides a platform for four speakers, all with strong opinions on the future of Russia.\n\nThe panel is invited to support or reject a motion on the likelihood of the relations between Russia and the West improving after the election. The programme also features a lively studio audience comprised of Russians living or working in Oxford, as well as Britons interested in Russian politics and culture. Audience members send in their questions ahead of the recording, or pose spontaneous questions and offer their comments during filming.\n\nThe programme panel is made up of:\n\nHoward Amos says: “When the dialogue is not conducted on a political level, it is especially important to maintain it on the cultural level. Russia is not only Putin, there are many other people there.”\n\nCatriona Kelly says: “It's not about a contradiction, but a strange similarity. Neo-liberalism and nationalism are two opposing tendencies, characteristic for many countries today. They are particularly strong in Britain and Russia as both countries are former empires, and they are going through a difficult departure from power.”\n\nIlya Yablokov says: “The history of today’s conflict and the so-called collective, the West, is a long history of love and hatred. Today we observe one of its chapters, and the relations can change very quickly after the 18 March elections.”\n\nKonstantin Zatulin: “It’s not about Putin and not about 18 March when we talk about conflict. There is Russia which, following the collapse of the USSR, was considered practically unimportant. If our interests are respected, there will be a cause for optimism.”\n\nBBC Debates will be broadcast on TV Rain at 23.00 Moscow time on Monday 5 March and will be published on the website bbc.com/russian\n\nIn addition to website, bbc.com/russian, the BBC connects with its Russian-speaking audiences via social media such as Facebook, VKontakte, Instagram, Twitter, YouTube, Telegram, Google+, LiveJournal and OK.ru.", "link": null, "source": "BBC.com", "location": []}, {"author": "Mary Hockaday,", "body": "BBC World Service is the home of international debate and we’re bringing our flagship debate programme to Belgrade at a fascinating time in its political history.\n\nSerbia became a stand-alone country in 2006, after years of ethnic conflict and the brutal break-up of Yugoslavia. Since then the country has made radical budget cuts, has carried out economic and political reforms and is pursuing a bid to join the European Union.\n\nWith the EU raising questions about freedom of expression and demanding constitutional reform from President Vucic's government, how much does Serbia want to change? Historical ties and decades of communism created close affinities between Serbia and Russia. How strong is that Russian influence now? And what about the breakaway region of Kosovo and calls to recognise it as independent?\n\nChairing the debate at the Bitef Theatre, the BBC’s Jonathan Dimbleby will be joined by a panel of leading politicians and thinkers who will be taking questions from the audience.  The panel will include:\n\nMary Hockaday, Controller, BBC World Service English, says: “BBC World Service is the home of international debate and we’re bringing our flagship debate programme to Belgrade at a fascinating time in its political history. We’re keen to hear what questions the audience will want to raise in a discussion that will then be heard around the world.”\n\nClare Sears, Country Director British Council Serbia, says: “We are delighted to be partnering with the BBC in bringing World Questions to Belgrade. This programme generates space for open and independent debates on current affairs, which supports the British Council’s objective of promoting cultural relations among people worldwide. We believe that connecting people both in Serbia and globally makes a powerful and lasting contribution to a more open and connected world.”\n\nBBC World Questions is an English language event, created in partnership with the British Council and will be recorded for radio broadcast worldwide (the BBC will launch a digital service in Serbian later this year).\n\nBBC World Questions will be recorded in English on 6 March at the Bitef Theatre from 18.00.  To join in the debate and be part of the audience please apply for FREE tickets HERE.\n\nBBC World Questions: Belgrade will air on BBC World Service English on March 10th at 20:00 CET and available online after", "link": null, "source": "BBC.com", "location": []}, {"author": "Stephen Titherington,", "body": "This is a truly fascinating time to bring World Questions to Nepal… we’re keen to hear the views being aired in Kathmandu about Nepal and about the world\n\nAfter an historic election, Nepal has chosen a communist coalition to run the country. Could this mark a turning point for the country, and deliver a long-awaited period of political stability and peace?\n\nNepal has been through great turmoil in recent years. A decade-long insurgency left more than 17,000 people dead before a 2006 peace deal ushered in democracy. In April 2015, a series of earthquakes killed thousands and destroyed homes. In the past decade alone, ten different Prime Ministers have held office. Recent elections were meant to mark the final phase in the country’s long political transition from the abolition of the monarchy to the establishment of a federal republic.\n\nBut the new government faces many challenges: can the coalition remain united? Will the new constitution deliver a more inclusive style of politics? How will relations with Nepal’s two giant neighbours - China and India - change?\n\nChairing the debate at the Hotel Himalaya in Kathmandu, the BBC’s Anu Anand will be joined by a panel of leading politicians and thinkers who will be taking questions from the audience. The panellists will include:\n\nStephen Titherington, Senior Commissioning Editor, BBC World Service English, says: \"This is a truly fascinating time to bring World Questions to Nepal just a couple months after the country’s historic elections. Debate is at the heart of the BBC World Service and we’re keen to hear the questions being asked and the views being aired in Kathmandu about Nepal and about the world.\"\n\nJovan Ilic, Country Director British Council in Nepal, says: “We are delighted to be partnering with the BBC in bringing World Questions to Kathmandu. This programme generates space for open and independent debates on current affairs, which supports the British Council’s objective of promoting cultural relations among people worldwide. We believe that connecting people both in Nepal and globally makes a powerful and lasting contribution to a more open and connected world.”\n\nBBC World Questions is an English language event, created in partnership with the British Council and will be recorded for radio broadcast worldwide. The programme will be recorded in English on 6 February at the Hotel Himalaya in Kathmandu from 4pm-7pm. To join in the debate and be part of the audience please apply for FREE tickets.\n\nBBC World Questions: Kathmandu will air on BBC World Service on 11 February at 12:00 GMT / 17:45 local time and available online after that at BBC World Service.\n\nNotes to Editors\n\nThe BBC World Service is holding a series of debates across the world based on the questions people want answers to now. BBC World Questions - an international series of English language events created with the British Council - allows the public to question their politicians, leaders and opinion formers directly face to face. The debates are led entirely by questions from the audience who are able to have their points heard around the world.", "link": null, "source": "BBC.com", "location": []}, {"author": "Sarah Keating", "body": "“Kopi lah,” says the elderly Singaporean man, leaning against the counter of the café. The stall holder hands him a bag filled with thick, creamy coffee sweetened with condensed milk. “Do people ever ask for healthier options?” I ask the woman behind the counter. She laughs. “Getting better,” she says, suggesting that people are creatures of habit.\n\nAs I wander through the market, the air dense with the smells of noodle soup, barbequed pork and sweet satay, I notice red stickers dotted on various stalls. “Healthier options available here”, reads one. “We use healthier oil”, reads another. It’s part of the Health Promotion Board’s Healthy Dining Programme where food and beverage providers get a grant if they provide healthier options for diners. It’s an indication of the small but not insignificant ways the government ‘nudges’ the population to make better choices.\n\nYou might also like:\n\nEver since the city state on the southern tip of the Malay Peninsula passed the ripe old age of 50, the administration has been keen to look outwards, to learn from and collaborate with other countries in order to shape its future. One such strategy has been to collaborate with the UK government’s Behavioural Insights Team, nicknamed the “Nudge Unit”, which uses the Nobel Prize-winning concept of “nudge theory”. This is based around the idea that people can make better choices through simple discreet policies while still retaining their freedom of choice. Nudge theory is certainly de rigeur among policy makers across the world at the moment but Singapore has actually been using similar strategies long before it became fashionable. And to understand why, you have to look back at the country’s history.\n\nIt is known for being the epitome of order and efficiency and, more importantly, the place where chewing gum is banned. Today it is one of the financial centres of the world but this has been hard-won. Following its expulsion from the Federation of Malaysia and subsequent independence in 1965, Singapore was left riddled with many socio-economic problems. Along with unemployment, lack of education and sub-standard housing, it was also a country lacking natural resources and land.\n\nThe man who took on this gargantuan task was the late Prime Minister Lee Kuan Yew. He recognised that Singapore had to change in order to thrive. \"We knew that if we were just like our neighbours, we would die. Because we've got nothing to offer against what they have to offer. So we had to produce something which is different and better than what they have. It's incorrupt. It's efficient. It's meritocratic. It works,” he told the New York Times.\n\nAnd in order to make it work, the government had to take control in order to develop a society in which people’s material needs were met. They built high-rise social housing called HDB’s, and industrialisation and inward foreign investment resulted in job creation. Slowly this infant nation started to take shape.\n\nNumerous public campaigns were established in order to lay down foundations of as well as create a sense of social identity in a disparate and multicultural population. The early campaigns were about improving the cleanliness and hygiene of the environment. “Keep Singapore Clean” and “Plant Trees” were common slogans that spearheaded these campaigns. Other campaigns focussed on family planning urging people to “Stop at 2”. As Singapore became more affluent, the National Courtesy Campaign was implemented as well as one encouraging people to speak Mandarin to create a more cohesive, considerate and civilised society.\n\nIn 1986, Lee Kuan Yew said “I am often accused of interfering in the private lives of citizens. Yes, if I did not, had I not done that, we wouldn't be here today… we would not have made economic progress, if we had not intervened on very personal matters - who your neighbour is, how you live, the noise you make, how you spit, or what language you use. We decide what is right.\"\n\nThis strategy paid off within 50 years, and the economy has become one of the most innovative and business-friendly in the world. But while Singapore still loves a public campaign, it has moved toward a more nuanced approach of influencing the behaviours of its inhabitants.\n\nNudging the population isn’t uniquely Singaporean; more than 150 governments across the globe have tried nudging as a better choice. A medical centre in Qatar, for example, managed to increase the uptake of diabetes screening by offering to test people during Ramadan. People were fasting anyway so the hassle of having to not eat before your testing was removed. It was convenient and timely, two key components to a successful nudge.\n\nTowns in Iceland, India and China have trialed ‘floating zebra crossings’ – 3D optical illusions which make the crossings look like they are floating above the ground designed to urge drivers to slow down. And in order to get people to pay their taxes in the UK, people were sent a letter saying that the majority of taxpayers pay their taxes on time which has had very positive results. Using social norms make people want to conform.\n\nIn Singapore some of the nudges you come across are remarkably simple. Rubbish bins are placed away from bus stops to separate smokers from other bus users. Utility bills display how your energy consumption compares to your neighbours. Outdoor gyms have been built near the entrances and exits of HDB estates so they are easy to use, available and prominent enough to remind you consistently. Train stations have green and red arrows on the platform indicating where you should stand so as to speed up the alighting process. If you opt to travel at off-peak times (before 0700), your fare is reduced.\n\nAnd with six out of 10 Singaporeans eating at food courts four or more times a week, getting people to eat healthier is also a priority. As well as the Healthier Dining Programme, some places make it cheaper to take the healthy option. If you’re determined to eat that Fried Bee Hoon at Khoo Teck Puat Hospital, for example, you’re going to have to pay more for it.\n\nThe National Steps Challenge, which encourages participants to get exercising using free step counters in exchange for cash and prizes, has been so successful that the programme name has been trademarked. This form of gamifying is one of the more successful ways of engaging users in achieving objectives. Massive queues to collect the free fitness tracker demonstrated the programme’s popularity.\n\nAnd it’s not just in tangible ways that nudges are being rolled out. Citizens pay into a mandatory savings programme called the Central Provident Fund at a high rate. This can be accessed for healthcare, housing and pensions as a way to get people to save long-term because evidence has shown that people are too short-sighted when it comes to financing their future.\n\nAnd as the government looks to increase the population 30% by 2030, the city-state’s ageing population and declining birth rate is a problem. The Baby Bonus Scheme goes some way to encouraging parents to have more children by offering cash incentives. Introduced in 2001, the scheme means that all Singapore citizens who have a baby get a cash gift as well as a money into a Child Development Account (CDA) which can be used to pay for childcare and healthcare. The more children you have, the more money you get – since March 2016 you get a cash gift of $8,000 SGD (£4,340) for your first child and up to $10,000 (£5,430) for the third and any subsequent children, as well as money into your CDA.\n\nSo do people like being nudged? Is there any cultural difference in the way people react to being swayed toward a ‘better’ choice or behaviour? Given the breadth of the international use of behavioural insights, there is relatively little research done into whether people are happy about it. What research is available from Europe and the United States suggests that people are largely approving as long as it fits in with their values and interests. For example, when it comes to making calorie content more readily available in fast food restaurants or being asked whether you want to be an organ donor when you get your driving licence, people are largely supportive.\n\nIn a study that looked at how people in Australia, Brazil, Canada, China, Japan, Russia, South Africa, and South Korea reacted, the results largely correlated to European and United States results with a few exceptions. China and South Korea showed “spectacularly high approval rates” while Japan showed “significantly lower approval ratings” in line with results from Denmark and Hungary in a European study.\n\nAlthough there is no definitive research into why this is the case, it is suggested that support for nudges are higher in countries where the issues addressed are of direct concern to the citizens – air pollution in China for example. A potential correlation also has been drawn between support for nudges and the level of trust in government. Hungary, which had one of the lowest levels of support for nudges, also has a low level of trust in its government – only 28% according to the OECD. China, on the other hand, had overwhelmingly positive attitudes to nudges and also a high level in trust for the government.\n\nAlthough Singapore was not included in the worldwide study, the level of trust in government is high and could possibly indicate that support for nudges is then also high.\n\nSo what is the future for nudges in Singapore? According to the Innovation Lab – a multi-disciplinary team within the Public Service Division that designs public policies and services from the viewpoint of citizens and stakeholders – the future is digital.\n\nA spokesperson says that citizens expect public services to catch up or do better than the private sector when they go digital. People already use devices such as chat bots and virtual or augmented reality interfaces in the private sector. They want the public sector to follow suit.\n\nThere is a sense that public services are benchmarked against people’s experiences with the commercial sector. The way in which we engage with the world is becoming faster, more hi-tech and arguably more removed from the real world. You only have to look at the popularity of the game Pokemon Go to see the buzz around virtual reality. And so the Singaporean government doesn’t want to get left behind.\n\nAs I step back into the shiny metropolis surrounded by the glinting metal and glass of 30-storey high rises, it’s easy to forget that just over 50 years ago none of this would have been here, not even the land in some areas. And while not everyone is a fan of such an intimate social contract between state and citizen, there’s no denying that Singapore has been master of its own destiny. Through nudges and careful ‘choice architecture’, this Little Red Dot has ploughed its own path.\n\nJoin 800,000+ Future fans by liking us on Facebook, or follow us on Twitter.\n\nIf you liked this story, sign up for the weekly bbc.com features newsletter, called “If You Only Read 6 Things This Week”. A handpicked selection of stories from BBC Future, Earth, Culture, Capital, and Travel, delivered to your inbox every Friday.", "link": null, "source": "BBC.com", "location": []}, {"author": "", "body": "Russian official Alexei Sorokin has assured Arsenal fans they will have nothing to fear in Moscow next month.\n\nArsenal face CSKA Moscow in the Europa League quarter-finals amid political tension between the UK and Russia.\n\nBut Sorokin, chief of Russia's World Cup organising committee, has played down safety concerns for UK visitors.\n\n\"We will ensure security in equal measures to all, from dignitaries to fans,\" Sorokin told TASS, the government-owned Russian news agency.\n\n\"It is a shame that the games will be played in such circumstances.\"\n\nOn Wednesday, the Foreign Office updated its travel advice for Russia, warning UK nationals of \"the possibility of anti-British sentiment or harassment\".\n\nThat advice was reposted on Arsenal's website after the Europa League draw was made on Friday.\n\n\"There are absolutely no grounds for such warnings,\" added Sorokin, who is also a senior member of the Russian Football Union.\n\n\"To us, there is no difference which country people come from or what our diplomatic relations with them are.\"\n\nOn Saturday, Russia announced it is to expel 23 British diplomats in a row over the nerve agent attack on an-ex spy and his daughter in the UK.\n\nThe Russian foreign ministry said the UK staff would be expelled from Moscow within a week in response to Britain's decision to expel 23 Russian diplomats.\n\nArsenal will host the first leg at Emirates Stadium on 5 April, with the return game to be played in Moscow on 12 April.", "link": null, "source": "BBC.com", "location": []}, {"author": "", "body": "UK government ministers and members of the Royal Family will not attend the World Cup in Russia after a Russian-made nerve agent was used on an ex-spy.\n\nSergei Skripal and his daughter, Yulia, are in a critical condition after the incident in Salisbury on 4 March.\n\nPrime Minister Theresa May said on Wednesday that the relationship between the two countries \"cannot be the same\".\n\nIt was previously reported that Prince William, the president of the Football Association (FA), would not attend.\n\nWhen asked whether senior FA officials should also not go to the World Cup - which runs from 14 June to 15 July - Mrs May said: \"I'm sure they will want to be considering their position.\n\n\"Attendance at sporting events is a matter for the sporting authorities - it's a matter for them.\"\n\nOn Tuesday, the FA had made no changes to plans for England's presence in Russia.\n\nMrs May, speaking at Prime Minister's Questions, said the government would \"look at security and protection of any UK football fans travelling to the World Cup\".\n\nShe also announced that the UK will expel 23 Russian diplomats and revoke an invitation to the Russian foreign minister to visit the country.\n\nRussia denies being involved in the attempted murder of Sergei Skripal.", "link": null, "source": "BBC.com", "location": []}, {"author": "", "body": "Jose Mourinho will be taking \"blood money\" by working for Russian state-backed channel RT during the World Cup, according to Chris Bryant MP.\n\nIt was announced that the Manchester United boss would be appearing on the channel last week, a day after an ex-Russian spy and his daughter were poisoned by a nerve agent in Salisbury.\n\nPrime Minister Theresa May says it is \"highly likely\" Russia is responsible.\n\nBryant has previously called for RT's \"propaganda\" to be banned in the UK.\n\nMourinho has refused to answer questions on his involvement with the channel - formerly known as Russia Today - since last week's poisoning.\n\nThe Times reported that he will be paid at least £1m for five days' work as a pundit this summer.\n\n\"To my mind, this is blood money, paid directly from the Russian state coffers,\" said Bryant, a Labour MP who in 2015 briefly served as shadow secretary of state for digital, culture, media and sport.\n\nSergei Skripal, 66, and Yulia Skripal, 33, remain in a critical but stable condition after being found slumped on a bench near the Maltings shopping centre in Salisbury, Wiltshire, on Sunday 4 March.\n\nPrime Minister May has said the UK must \"stand ready\" to take action against Russia and that this would be set out in the Commons on Wednesday should there be no adequate explanation from the Kremlin by midnight on Tuesday.\n\nRussia's foreign minister Sergei Lavrov has described claims of state involvement as \"rubbish\".", "link": null, "source": "BBC.com", "location": []}, {"author": "Howard Amos,", "body": "Russia is not only Putin; there are many other people there\n\nThe format of BBC Debates is based on the concept of a university debating society. The University of Oxford and the Ashmolean Museum, the University's Arts Gallery which was chosen as the first programme venue, is home to one of the oldest debating societies in the world: the Oxford Union.\n\nThe topic of the inaugural edition of the programme, ahead of the 18 March presidential election in Russia, is the future of Russia-West relations. Presented by BBC Russian’s Oleg Boldyrev, BBC Debates provides a platform for four speakers, all with strong opinions on the future of Russia.\n\nThe panel is invited to support or reject a motion on the likelihood of the relations between Russia and the West improving after the election. The programme also features a lively studio audience comprised of Russians living or working in Oxford, as well as Britons interested in Russian politics and culture. Audience members send in their questions ahead of the recording, or pose spontaneous questions and offer their comments during filming.\n\nThe programme panel is made up of:\n\nHoward Amos says: “When the dialogue is not conducted on a political level, it is especially important to maintain it on the cultural level. Russia is not only Putin, there are many other people there.”\n\nCatriona Kelly says: “It's not about a contradiction, but a strange similarity. Neo-liberalism and nationalism are two opposing tendencies, characteristic for many countries today. They are particularly strong in Britain and Russia as both countries are former empires, and they are going through a difficult departure from power.”\n\nIlya Yablokov says: “The history of today’s conflict and the so-called collective, the West, is a long history of love and hatred. Today we observe one of its chapters, and the relations can change very quickly after the 18 March elections.”\n\nKonstantin Zatulin: “It’s not about Putin and not about 18 March when we talk about conflict. There is Russia which, following the collapse of the USSR, was considered practically unimportant. If our interests are respected, there will be a cause for optimism.”\n\nBBC Debates will be broadcast on TV Rain at 23.00 Moscow time on Monday 5 March and will be published on the website bbc.com/russian\n\nIn addition to website, bbc.com/russian, the BBC connects with its Russian-speaking audiences via social media such as Facebook, VKontakte, Instagram, Twitter, YouTube, Telegram, Google+, LiveJournal and OK.ru.", "link": null, "source": "BBC.com", "location": []}, {"author": "Mary Hockaday,", "body": "BBC World Service is the home of international debate and we’re bringing our flagship debate programme to Belgrade at a fascinating time in its political history.\n\nSerbia became a stand-alone country in 2006, after years of ethnic conflict and the brutal break-up of Yugoslavia. Since then the country has made radical budget cuts, has carried out economic and political reforms and is pursuing a bid to join the European Union.\n\nWith the EU raising questions about freedom of expression and demanding constitutional reform from President Vucic's government, how much does Serbia want to change? Historical ties and decades of communism created close affinities between Serbia and Russia. How strong is that Russian influence now? And what about the breakaway region of Kosovo and calls to recognise it as independent?\n\nChairing the debate at the Bitef Theatre, the BBC’s Jonathan Dimbleby will be joined by a panel of leading politicians and thinkers who will be taking questions from the audience.  The panel will include:\n\nMary Hockaday, Controller, BBC World Service English, says: “BBC World Service is the home of international debate and we’re bringing our flagship debate programme to Belgrade at a fascinating time in its political history. We’re keen to hear what questions the audience will want to raise in a discussion that will then be heard around the world.”\n\nClare Sears, Country Director British Council Serbia, says: “We are delighted to be partnering with the BBC in bringing World Questions to Belgrade. This programme generates space for open and independent debates on current affairs, which supports the British Council’s objective of promoting cultural relations among people worldwide. We believe that connecting people both in Serbia and globally makes a powerful and lasting contribution to a more open and connected world.”\n\nBBC World Questions is an English language event, created in partnership with the British Council and will be recorded for radio broadcast worldwide (the BBC will launch a digital service in Serbian later this year).\n\nBBC World Questions will be recorded in English on 6 March at the Bitef Theatre from 18.00.  To join in the debate and be part of the audience please apply for FREE tickets HERE.\n\nBBC World Questions: Belgrade will air on BBC World Service English on March 10th at 20:00 CET and available online after", "link": null, "source": "BBC.com", "location": []}, {"author": "Stephen Titherington,", "body": "This is a truly fascinating time to bring World Questions to Nepal… we’re keen to hear the views being aired in Kathmandu about Nepal and about the world\n\nAfter an historic election, Nepal has chosen a communist coalition to run the country. Could this mark a turning point for the country, and deliver a long-awaited period of political stability and peace?\n\nNepal has been through great turmoil in recent years. A decade-long insurgency left more than 17,000 people dead before a 2006 peace deal ushered in democracy. In April 2015, a series of earthquakes killed thousands and destroyed homes. In the past decade alone, ten different Prime Ministers have held office. Recent elections were meant to mark the final phase in the country’s long political transition from the abolition of the monarchy to the establishment of a federal republic.\n\nBut the new government faces many challenges: can the coalition remain united? Will the new constitution deliver a more inclusive style of politics? How will relations with Nepal’s two giant neighbours - China and India - change?\n\nChairing the debate at the Hotel Himalaya in Kathmandu, the BBC’s Anu Anand will be joined by a panel of leading politicians and thinkers who will be taking questions from the audience. The panellists will include:\n\nStephen Titherington, Senior Commissioning Editor, BBC World Service English, says: \"This is a truly fascinating time to bring World Questions to Nepal just a couple months after the country’s historic elections. Debate is at the heart of the BBC World Service and we’re keen to hear the questions being asked and the views being aired in Kathmandu about Nepal and about the world.\"\n\nJovan Ilic, Country Director British Council in Nepal, says: “We are delighted to be partnering with the BBC in bringing World Questions to Kathmandu. This programme generates space for open and independent debates on current affairs, which supports the British Council’s objective of promoting cultural relations among people worldwide. We believe that connecting people both in Nepal and globally makes a powerful and lasting contribution to a more open and connected world.”\n\nBBC World Questions is an English language event, created in partnership with the British Council and will be recorded for radio broadcast worldwide. The programme will be recorded in English on 6 February at the Hotel Himalaya in Kathmandu from 4pm-7pm. To join in the debate and be part of the audience please apply for FREE tickets.\n\nBBC World Questions: Kathmandu will air on BBC World Service on 11 February at 12:00 GMT / 17:45 local time and available online after that at BBC World Service.\n\nNotes to Editors\n\nThe BBC World Service is holding a series of debates across the world based on the questions people want answers to now. BBC World Questions - an international series of English language events created with the British Council - allows the public to question their politicians, leaders and opinion formers directly face to face. The debates are led entirely by questions from the audience who are able to have their points heard around the world.", "link": null, "source": "BBC.com", "location": []}]