{"Breitbart": "Hagan: The America First Approach To Stopping School Shootings\n\t\t\t\t\t\t\t\t\n\t\t\t\tby Christina Hagan22 Mar 20180\n\t\t\t\t22 Mar, 2018\n\t\t\t\t21 Mar, 2018\n\t\t\t\n\t\t\t\n\t\t\t\tIn the wake of the mass shooting at Stoneman Douglas High School, pundits and politicians have proposed dozens of ideas to prevent the next school shooting that range from banning semi-automatic weapons to arming teachers. When elected to Congress in the fall, I will put forward a bill with an America First answer to this problem.\nSchools have become soft targets for individuals suffering from specific mental disorders; this unfortunate situation has become our new normal. However, that doesn’t mean we have to ban guns or arm teachers to combat this issue. As the nation saw from the school shooting on Tuesday at Great Mills High School in Maryland, the best way to defend students from mass shootings is to have armed guards on school property.\n\nThe America First position is for our federal government to pay unemployed or retired military and police officers to arm our schools, tackling two issues at once: Creating jobs for veterans and retired police while keeping our schools safe.\n\nAs of 2014, according to The National Center for Educational Statistics, there are 131,890 public and private elementary and secondary schools in the U.S., all of which need some form of armed security given our current state of affairs.\n\nIf the federal government were to hire one to two armed guards per school, approximately 250,000 in total, it would cost taxpayers an estimated $10 to $12 billion annually.\n\nBy redirecting funds already misused overseas, we could ensure safety for America’s children without adding to our national deficit or disarming law-abiding citizens. A report from 2017 by John Sopko, special inspector general for Afghanistan reconstruction, found that the federal government is spending millions of dollars a year paying for the salaries of Afghanistan soldiers that don’t even exist. According to Sopko, the U.S. pays the wages of about 320,000 Afghan police and soldiers, but only 120,000 actually exist.\n\n\n\n\n\nAmericans are paying for Afghan soldiers that don’t exist while our children are vulnerable; this is unconscionable.\n\nAnother area where the federal government could redirect funds from is United State Agency for International Developments which will spend $15 million by 2019 to train cashiers for Walmart in Mexico, Kenya, India, and Spain, another $21 million to purchase motorbikes for Pakistani Dairy Farmers, and $98 million to promote tourism in Jordan.\n\nBy redirecting these funds to protect our schools, we will not only ensure the safety of our students but employment opportunities to veterans and retired police.\n\nAll school safety employees would need to meet a specific list of standards that include physical and mental well-being, proper training to deal with a school shooter, as well as an honorable discharge. This plan could be one of the most significant job creators for unemployed vets, especially to the 188,000 unemployed who served in Gulf War I and II, according to the Bureau of Labor Statistics.\n\nThis America First approach will protect our children, redirect wasted federal funds, and neither be a burden on the taxpayer or legal gun owners. It’s a win for all Americans and will be one my first priorities when elected in November.\n\n\n\n\n\nChristina Hagan has represented District 50 in the Ohio State House since 2011. She’s currently running for Congress in Ohio District 16 and is endorsed by Rep. Jim Jordan, Rep. Mark Meadows, Gov. Jan Brewer, Anthony Scaramucci, Dr. Sebastian Gorka, Pastor Darrell Scott, and Ohio Value Voters.", "Fox News": "Vice President Mike Pence touted the Trump administration's first year in a speech to the Conservative Political Action Conference near Washington, D.C. \n\nHe emphasized that the administration's immigration enforcement policies are working and said the border wall will be built. \n\n\"President Trump promised to enforce our laws, secure our borders, and today illegal crossings at our southern border have been cut nearly in half and make no mistake about it, we're going to build that wall,\" he told the crowd, drawing raucous cheers. \n\n\nHe said the president \"came through\" by appointing strong conservatives to the federal courts and Neil Gorsuch to the Supreme Court. \n\nPence said the White House is committed to the safety of American schools as its \"top national priority\" and that \"strong action\" will be taken to keep schools safe after the Feb. 14 massacre in Parkland, Florida.\n\n\"We pray for God's wisdom that all of us in positions of authority might find a way to come together with American solutions to confront and end this evil in our time,\" he said.  \n\nPence and Trump held a listening session on Wednesday with students, parents and teachers from Marjory Stoneman Douglas High School, backing the idea of training teachers to use firearms.\n\nTrump is scheduled to address CPAC on Friday at 10:00am ET.\n\n\"I spoke to him this morning. He can't wait to get here!\" Pence told the crowd.", "The Blaze": "Florida Republican Gov. Rick Scott put his A-plus rating with the National Rifle Association at risk by signing into law gun regulations that give both sides some of what they want while also leaving everyone wanting more.\n\nAbout the law\nThe law is called the Marjory Stoneman Douglas High School Public Safety Act. Here’s what it does:\n\n\nRaises the minimum age for firearm purchases to 21 from 18\nImposes a three-day waiting period for most gun purchases\nBans the sale or possession of bump stocks\nFunds a program to allow some teachers and school staff to carry guns after 132 hours of firearm training and 12 hours of diversity training\nMakes it easier for law enforcement to temporarily seize guns and ammo from people with mental health issues\nProvides additional funding for mental health services\nFunds the destruction and rebuilding of Douglas High School’s freshman building\n\nScott’s stance on the law\nScott said he opposed parts of the law, including the new waiting period and the program to arm teachers. Still, he touted it as a good solution and a conversation-starter.\n\n“I am going to do what I think are common sense solutions,” Scott said, according to The Washington Post. “I think this is the beginning. There is now going to be a real conversation about how we make our schools safe.”\n\nScott, who is eyeing a Senate bid against Sen. Bill Nelson (D-Fla.), criticized the federal government for failing to take any meaningful steps following the tragedy in Parkland.\n\n“If you look at the federal government, nothing seems to have happened there,” Scott said. “You go elect people, you expect them to represent you, get things done.”\n\nThe governor’s support of the bill contrasts with his comments on the Second Amendment, made at the NRA Annual Meeting in April.\n\n“We love tourists, new residents and the Second Amendment,” Scott said in April, according to The Washington Post. “What does ‘shall not’ infringe on the people’s right to bear arms mean? It means shall not infringe. It’s not really complicated.”\n\nCriticism of the law\nThe law strikes a tenuous political middle ground, as Democrats and other gun control advocates would have preferred to see an assault weapons ban included, while many Republicans, the NRA and other gun rights advocates believe the restrictions in the law represent a violation of the Second Amendment.\n\nThe NRA attempted to mobilize citizens against the bill earlier in the week, according to the Los Angeles Times.\n\n“YOU and every other law-abiding gun owner is being blamed for an atrocious act of premeditated murder,” wrote NRA lobbyist Marion Hammer on Tuesday. “Neither the 3-day waiting period on all rifles and shotguns, raising the age from 18 to 21 to buy any firearm, or the bump stock ban will have any effect on crime. Despite that fact, Senate leaders rammed through gun control as part of the bill.”\n\nThe Florida Education Association opposed the funding to arm teachers, which Scott allowed in the law despite having the ability to use a line-item veto to reject it.", "CBN News": "President Donald Trump said Friday the Florida sheriff's deputy who failed to stop last week's mass shooting at a Parkland high school was a either a \"coward\" or just froze under extreme pressure.\n\n\"When it came time to get in there and do something, he didn't have the courage or something happened. But he certainly did a poor job. There's no question about that,\" Trump said. \"That's a case where somebody was outside, they're trained, they didn't act properly or under pressure or they were a coward. It was a real shock to the police department.\"\n\nTrump made the comments before speaking to the Conservative Political Action Committee in National Harbor, Maryland, where he reiterated his proposal to arm teachers, coaches and staff members who have experience with firearms either through military or law enforcement experience.\n\nDuring his speech, President Trump said, \"These teachers love their students. And these teachers are talented with weaponry and with guns. I'd rather have somebody who loves their students and wants to protect their students than someone standing outside who doesn't know anybody.\"\n\nMeanwhile, Broward County Sheriff Scott Israel said Thursday it made him sick to watch Deputy Scot Peterson remain outside the school building instead of attempting to stop the shooter.\n\nSheriff Isreal said Officer Peterson took up a position on the west side of Building 12, where most of the carnage happened, but did nothing.\n\n\"I think he remained outside for upwards of four minutes,\" Israel said Thursday in a news conference. The shooting, he said, lasted six minutes.\n\nThe sheriff came to that conclusion after watching surveillance video, talking to witnesses and getting a statement from Peterson.\n\nThe deputy has now resigned from the force.\n\nNikolas Cruz,19, is accused of killing 17 people, including students and teachers.\n\nThe president's speech at CPAC speech followed an address by National Rifle Association Vice President Wayne LaPierre on Thursday in which he accused gun control advocates of exploiting the school shooting for political gain.\n\nTrump conceded that his proposal to arm teachers was controversial, but emphasized that teachers would be well-trained.", "Townhall": "Do conservatives -- or non-leftists, for that matter -- appreciate just how terrific Donald Trump has been as president? And how lucky we are that he won the presidency?I don't know the answer. What I do know is that they ought to be deeply appreciative of him, and deeply grateful for luck or providence, and certainly for Trump himself, that he was elected president. First, it is unlikely that any other Republican would have defeated Hillary Clinton. Second, he has not only surpassed many of our expectations but also thus far governed in a manner more consistent with conservative principles than any president since Ronald Reagan, and arguably Calvin Coolidge.I say this as one who vigorously opposed him during the Republican contest for the nomination. I said from the beginning, in print and on my radio show, that I would support Trump if he became the nominee, but I dreaded his becoming the nominee. His comments about the size of his hands, Sen. John McCain as a prisoner of war and former President George W. Bush lying about weapons of mass destruction in Iraq; his lack of any history as a conservative; and the seeming absence of a filter between his brain and his Twitter app made it difficult for me to imagine him as a serious president of the United States.Nevertheless, once he was nominated, I just as vigorously supported him on the simple and -- I still believe -- unanswerable grounds that while no one could be certain how Trump would govern, we were all certain about how Hillary Clinton would govern -- as a leftist. And I truly believed that another four years of left-wing rule would mean the end of America as it was founded to be.That is why I found the arguments of the conservatives who were Never-Trumpers, many of whom I work with, admire and count as friends, not just unpersuasive but incomprehensible. That a conservative could prefer Clinton -- which was the only upshot of a Never Trump position -- to any Republican could only mean that we have an entirely different understanding of the damage the left has done and would have done to America and the Western world if Clinton had won.I remember Never-Trumpers calling my radio show and asking me how I could possibly believe that, if elected president, Trump would honor his commitment to nominate to the Supreme Court one of the conservatives on the list of judges from which he promised to choose. He has honored that promise. And given the supreme importance of the Supreme Court, isn't that reason enough for conservatives to celebrate his presidency?He has repealed many of President Obama's energy regulations that would have strangled the American economy. He doesn't believe that carbon-induced warming of the planet will destroy the human race -- the greatest of the innumerable hysterias the left manufactures and then believes in. Isn't that reason enough for conservatives to celebrate his presidency?He has appointed a woman who, as a billionaire, could have easily devoted her life to enjoying her wealth but instead has fought for American students and their parents to be able choose their schools just as the wealthy do. And he has taken on the teachers unions, the only group that has ever given American teachers a bad name. Isn't that reason enough for conservatives to celebrate his presidency?He has appointed as ambassador to the United Nations a woman who is calling the U.N. the naked emperor that it is. And now, America is backing, rather than subverting, Israel in that benighted institution.Isn't that reason enough for conservatives to celebrate his presidency?By building a wall along our southern border, he is reasserting the belief that America actually has borders. Isn't that reason enough for conservatives to celebrate his presidency?And then there is tax reduction and simplification so that private citizens can keep more of their money and corporations can be far more productive.Isn't that reason enough for conservatives to celebrate his presidency?And now, he has vowed, after decades of American obsequiousness, to confront the sociopathic North Korean regime.The American media -- most particularly, its elite -- no longer even feigns objective reporting. It is solely an arm of the left and the Democratic Party, its task being the delegitimization of the Trump presidency.If you live among liberals, it is not chic to express support for President Trump. But it is time more of us did. If people abandon you because you support this president, they weren't serious friends to begin with. And, sorry to say, they aren't worthy of you. Somehow, you have been able to look beyond their support for the America- and West-destroying left. But they can't look beyond your support for the first conservative president in a generation -- and the gutsiest perhaps ever.If the president's approval rating really is in the 30s, this makes overt support for him all the more imperative. Whether you like his tweets or not, his fate is our fate.", "ABC News": "President Donald Trump continued his calls to arm more teachers with guns to protect schools in a joint news conference with Australian Prime Minister Malcolm Turnbull on Friday.\n\n\nHe predicted that congressional action will \"happen very quickly\" on improving the background check system and regulating bump stocks - devices that can be used to effectively turn a legal rifle into a machine gun. \n\n\nEarlier this week Trump directed the Justice Department to draft new regulations to ban bump stocks.\n\n\nHis comments echoed what he said Friday morning in a speech at the Conservative Political Action Conference where he repeated his calls to arm some teachers and provide more security to schools, as well as providing more mental health support.\n\n\nThis is a developing story. Please refresh for updates.", "ABC News Australia": "The head of the National Rifle Association (NRA) has lashed out at gun control advocates, saying Democratic elites are politicising the latest mass school shooting in the United States to try to erode constitutionally guaranteed gun rights.\n\nNRA chief executive Wayne LaPierre echoed President Donald Trump's call to arm teachers to prevent school shootings, and weighed into a long-running political and cultural divide over access to weapons that has been inflamed by last week's massacre at a Florida high school that killed 17 students and staff.\n\n\"Their goal is to eliminate the Second Amendment [of the constitution] and our firearms freedoms so they can eradicate all individual freedoms.\"\n\nThe NRA is a politically influential lobby group that endorsed Mr Trump for president in 2016 and has close ties to conservative Republicans.\n\nThe Second Amendment guarantees the right to bear arms.\n\nAt the White House, Mr Trump told local and state school officials he had been in touch with the NRA about his ideas to stem gun violence in schools and said \"there's a tremendous feeling that we want to get something done\".\n\nThe Valentine's Day massacre at Marjory Stoneman Douglas High School in Parkland, Florida was the latest in a series of deadly shootings at US schools and has spurred unprecedented youth-led protests in cities across the country.\n\nMany of the teenagers and their parents taking part have called for more curbs on guns.\n\nMr LaPierre, speaking at the annual gathering of the Conservative Political Action Conference, portrayed the NRA as the true protector of the country's schoolchildren and offered free training to those who want to bear arms to protect schools.\n\n\"We must immediately harden our schools,\" he said.\n\n\"Every day, young children are being dropped off at schools that are virtually wide open, soft targets for anyone bent on mass murder.\"\n\nIt should not be easier to shoot up a school than a bank or a jewellery store, he added.\n\nMr LaPierre attacked Democrats by name including senators Kamala Harris, Elizabeth Warren and Christopher Murphy, and also took a swipe at the FBI for failing to follow up on a tip about the alleged shooter in the Parkland massacre.\n\nA top FBI official has acknowledged that the nation's top law enforcement agency had lost public trust for failing to investigate the tip, a mistake he suggested was the result of bad judgment.\n\nDavid Bowdich, the FBI's acting deputy director, said he personally visited the FBI's West Virginia call centre this week as part of a review of why a warning that the suspect, Nikolas Cruz, had access to guns and a \"desire to kill\" was not referred to agents in Florida for further investigation.\n\n\"People make judgments out on the street every day,\" Mr Bowdich said, adding that the bureau is still trying to determine exactly what went wrong.\n\n\"Every now and then those judgments may not have been the best judgments based on the information they had at the time.\"\n\nDemocratic Senate leader Chuck Schumer condemned Mr LaPierre's comments and said the NRA was \"once again spewing pathetic, out of touch ideas, blaming everything but guns\".\n\nMr Trump reiterated his idea, first raised on Wednesday, of arming teachers.\n\nThe President called for teachers to be \"highly trained, gun adept\", saying gun-free schools are \"a magnet for bad people\".\n\nHe pushed for an offensive strategy, warning \"defence alone won't work\" and said armed teachers could \"solve the problem instantly, before police arrive\".", "Daily Beast": "President Trump will meet with Turkish President Recep Tayyip Erdogan on Tuesday, May 16, the White House announced on Wednesday. “The two leaders will discuss how to further strengthen our bilateral relationship and deepen our cooperation to confront terrorism in all its forms,” the White House statement read. Erdogan, fresh off thwarting a coup and increasing his powers with a recent referendum, recently criticized Trump’s decision to arm Syrian Kurds in their ongoing battle against ISIS.", "Huffington Post US": "Progressives celebrated a string of wins in Illinois’ Democratic primaries on Tuesday, claiming a significant blow against Chicago’s so-called Democratic Party “machine.”\n\n\nThe victories, mostly in down-ballot races for state and local offices, were overshadowed by higher-profile congressional and gubernatorial contests, but the region’s left-leaning activists believe they lay the groundwork for bigger pickups over the long term.\n\n\nKey wins include Fritz Kaegi’s defeat of Cook County Assessor Joe Berrios, who also serves as chairman of the Cook County Democratic Party; Aaron Ortiz’s defeat of state Rep. Dan Burke (D); Ram Villivilam’s defeat of state Sen. Ira Silverstein (D); and Brandon Johnson’s narrow defeat of Cook County Commissioner Richard Boykin.\n\n\nIn addition, Alma Anaya was elected to fill the Cook County Board of Commissioners seat vacated by Jesús “Chuy” García, who won his congressional race. Delia Ramirez picked up an open Illinois House seat and Beatriz Frausto-Sandoval won her race for 14th Subcircuit judge.\n\n\n“The Chicago machine today is licking its wounds,” said Clem Balanoff, a longtime progressive strategist and former state lawmaker who’s now executive director of Our Revolution Illinois, a local chapter of the legacy group of Sen. Bernie Sanders’ 2016 campaign. “They could be the fatal wounds.”\n\n\n“There’s no doubt that change is in the air,” he added.\n\n\n\n\n\n\n\n\nOn the surface, the issues that dominated these down-ballot races were often far removed from the national discussion. But upon closer examination, they track closely with the intra-Democratic debates taking place across the country, where progressive newcomers are challenging incumbents to do more to curb growing economic and racial inequality.\n\n\nIn the case of the Cook County assessor’s race, there was also the factor of seemingly brazen corruption in Chicago. Berrios, who has spoken unapologetically about securing government jobs for family members, was under fire after an investigation revealed that he had systematically been over-assessing the property taxes of less valuable homes and under-assessing the homes of wealthier individuals. Between October and February, Berrios received $276,000 in campaign contributions from property tax appeals attorneys who represent wealthy clients in cases Berrios oversees.\n\n\nBalanoff was initially skeptical of getting behind a “financial guy” like Kaegi, a former mutual fund manager, but concluded that there was a “real genuineness” in his commitment to a more transparent and less regressive property tax assessment system.\n\n\nWith the help of Our Revolution Illinois and other grassroots groups, Kaegi prevailed Tuesday by promising a fairer system for the city’s middle-class homeowners. He defeated the two-term incumbent and Cook County party chairman by 15 percentage points.\n\n\nVictories like Kaegi’s did not come about in a vaccum. Chicago’s progressive movement has been growing steadily in recent years, beginning with a successful strike launched by the left-leaning Chicago Teachers Union in 2012. \n\n\nThe strike humiliated Chicago Mayor Rahm Emanuel (D), whose business-friendly policies had already put him on a collision course with grassroots activists. He has presided over massive public school and mental health clinic closings, as well as upscale urban development that has pushed out some members of the city’s longtime black and Latino communities.\n\n\nEfforts to check Emanuel and the coalition of politicians with whom he makes common cause have gradually matured since then. \n\n\n\nThere is no progressive movement anywhere in this country if it not does not underscore black, left progressive men and women winning elected office.\nStacy Davis Gates, Chicago Teachers Union\n\n\nChuy García came up short in his attempt to unseat Emanuel in 2015. But with the backing of the teachers union and other progressive groups, he shocked the Chicago Democratic machine by forcing an unprecedented runoff.\n\n\n“What you’ve seen since then is a steady stream of movement in the electoral realm that this city hasn’t seen before,” Stacy Davis Gates, the political director of the Chicago Teachers Union, said of the 2015 race.\n\n\n1) Our movements laid the foundation for tonight's four-for-four sweep back in 2015.\n— UWF Illinois (@UWFIllinois) March 21, 2018\n\n\n\nSanders’ 2016 presidential run gave the region’s progressives another jolt of energy. In Hillary Clinton’s home state of Illinois, she defeated Sanders by just 1.8 percentage points thanks in part to the enthusiasm Sanders inspired in Chicago’s young people and restive activists.\n\n\nBy the time the 2018 primaries rolled around, there were several significant locuses of progressive power in Chicago with the resources to recruit and elect a new crop of candidates. García’s mayoral run made him a household name throughout the city and expanded his political organization in the predominantly Latino parts of western Chicago; Our Revolution Illinois was flush with energized activists; and the Chicago Teachers Union was spoiling for another fight.\n\n\nUnited Working Families, a local branch of the labor-backed Working Families Party, had also made key inroads into the city’s black and Latino communities.  \n\n\nTogether, these groups provided the financing and field organizing operations that younger or lesser-known candidates needed to challenge entrenched incumbents and compete in contentious open seats.\n\n\nGarcía, who was virtually assured of victory in Illinois’ 4th Congressional District from the moment he stepped into the race, leveraged his political operation to ensure the election of younger progressive Latinos. The clearest beneficiaries from his reach in west and southwest Chicago were Alma Anaya, one of his former aides; Aaron Ortiz, a 26-year-old college counselor and member of the Chicago Teachers Union; labor activist Delia Ramirez; and immigration lawyer Beatriz Frausto-Sandoval.\n\n\nOrtiz’s win was especially notable because he unseated Dan Burke, 66, who had represented the state House district since before Ortiz was born. Ortiz criticized Burke for the ties of his brother, Chicago Alderman Ed Burke, to President Donald Trump. Ed Burke’s law firm has saved Trump millions of dollars in taxes on Chicago’s Trump Tower.\n\n\n\n\n\n\n\n\n\nBrandon Johnson’s Cook County Board Of Commissioners win, by a few hundred votes, also carried special significance.\n\n\nJohnson, a Chicago Teachers Union member and organizer on the West Side, is now one of the Chicago area’s most progressive black elected officials. One reason García lost in 2015 was because of his inability to peel black voters away from Emanuel.\n\n\nEnsuring that Chicago’s progressive leadership adequately represents the city’s formidable black population is essential to electing a progressive mayor and other powerful leaders, according to Davis Gates. It also provides a road map for national progressives like Sanders, whose struggle to gain traction among African-American voters likely cost him the Democratic nomination, Davis Gates said.\n\n\n“There is no progressive movement anywhere in this country if it not does not underscore black, left progressive men and women winning elected office,” Davis Gates said. “It just doesn’t happen.”\n\n\n“Bernie Sanders alone is not gonna be enough to compel black people to turn out and vote,” she added.\n\n\nAt the same time, the teachers union’s decision to go all in for Johnson reflected its disdain for Richard Boykin, an African-American corporate lobbyist and former chief of staff to Rep. Danny Davis (D). Boykin opposed Johnson’s ideas to raise progressive revenue for the county that would enable it to save public jobs. He also responded to the city’s epidemic of gang violence by calling for alleged shooters to be tried as “domestic terrorists” and inviting United Nations peacekeepers to occupy his district.\n\n\n“People like Brandon Johnson are critical as we move ahead in this movement,” Davis Gates said. “If the national scene is Joe Biden and Donald Trump, and Illinois has J.B. Pritzker and Bruce Rauner, we’re gonna be in trouble.”", "The New York Times": "President Trump praised Poland’s democratic values in a speech on Thursday and lauded the country as a beacon.\n\n“I am here today not just to visit an old ally, but to hold it up as an example for others who seek freedom,” Mr. Trump told a crowd in Warsaw.\n\nNot everyone agrees. Since Poland’s conservative Law and Justice Party came to power in 2015, the country has been criticized by international organizations over measures that they say undermine freedom. Here are some of their concerns:\n\nShortly after the Law and Justice Party took power, it took several steps to gain more control over the nation’s Constitutional Tribunal. It appointed more judges aligned with the party to the court, limited the court’s ability to overturn new laws, and made it possible for the government to directly appoint the country’s top prosecutor.\n\nThe European Union’s executive arm has begun an inquiry into the judicial measures over concerns that they violate the bloc’s rules.", "Politico - EU": "U.S. President Donald Trump  | Mark Wilson/Getty Images\n        \n        \n                        Trump confirms he’s backing off raising age for purchasing some guns\n                        US President had previously proposed raising to 21 the legal age for purchasing certain types of guns.\n\n                    \n                \n\n\t\t\t\n\t\t\tBy\t\t\t\n\t\t\t\tLouis Nelson\t\t\t\n\t\t\n\n\t\t3/12/18, 3:26 PM CET\n\n\t\t\n\n     Donald Trump confirmed Monday morning that his administration would back away from a proposal to raise the minimum age at which Americans are allowed to buy certain firearms, conceding that there is “not much political support” for such a step.\n\nTrump had previously proposed raising to 21 the legal age for purchasing certain types of guns, including assault-style rifles like the one used in last month’s mass shooting at Marjory Stoneman Douglas High School in Parkland, Florida. The president’s proposal was met with pushback from the NRA and was left off of a list of recommendations to stop school shootings released on Sunday by the White House.\n\n“On 18 to 21 Age Limits, watching court cases and rulings before acting. States are making this decision. Things are moving rapidly on this, but not much political support (to put it mildly),” Trump wrote on Twitter.\n\nBefore conceding on raising the age limit for the purchase of certain guns, Trump had publicly chided members of his own party, telling GOP lawmakers at a White House meeting that they were “afraid of the NRA.”\n\nIn an earlier tweet, the president touted other steps that his administration still intends to pursue, including “very strong improvement and strengthening of background checks” and the banning of bump stocks, a device used last year by a mass shooter in Las Vegas that allows a semi-automatic weapon to function essentially as an automatic one. “Highly trained expert teachers will be allowed to conceal carry, subject to state law,” the president said, a step he has argued will harden schools against shooters and deter attacks.\n\nWhile Trump has backed away from his support for raising the age at which certain guns can be purchased to 21, Florida Governor Rick Scott signed legislation earlier this month doing just that, as well as banning bump stocks, funding mental health programs in schools and instituting a three-day waiting period for the purchase of firearms. The bill, which has prompted the NRA to sue the state of Florida in order to block its implementation, also allows willing teachers to carry a firearm inside  stories on these topics:", "Salon": "In his Monday New York Times column, economist Paul Krugman argued that the reason Republicans ended up with the candidate that they deserve — Donald Trump — is simply because they’re ideologically bankrupt and do, in fact, deserve him.\n\nHe noted that “[w]hen Mr. Bush and Mr. Rubio dutifully repeated the usual conservative clichés, you could see that there was no sense of conviction behind their recitations — all it took was the huffing and puffing of a loud-mouthed showman to blow their houses down.” And “a loud-mouthed showman” is exactly what they got in the person of Donald Trump.\n\nYou Might Also Like Fortunately, Krugman argued, the very nature of the Democratic coalition guarantees that its chosen candidate will be far more robust: As some political scientists are now acknowledging, America’s two major parties are not at all symmetric. The G.O.P. is, or was until Mr. Trump arrived, a top-down hierarchical structure enforcing a strict, ideologically pure party line. The Democrats, by contrast, are a “coalition of social groups,” from teachers’ unions to Planned Parenthood, seeking specific benefits from government action… Read the rest at The New York Times…", "The Guardian": "Donald Trump has criticized the FBI for missing the “many signals” about the Florida school shooter, saying the agency was spending “too much time” trying to prove Russian collusion with the Trump campaign. \n\n\n\nThe US president’s attempt to use the shooting to make a political point about the FBI’s Russia inquiries into the Trump campaign drew swift criticism, including from John Kasich, the Republican governor of Ohio, who called it an “absurd statement”.\n\nTrump, who the National Rifle Association (NRA) helped elect, made the comments as he faced demands for action on gun control, including from the teenage survivors of America’s latest school massacre.\n\n\n\nThousands of protesters at state rallies this weekend demanded an immediate response from lawmakers in the wake of Wednesday’s attack that left 17 victims dead at a high school in Parkland, Florida on Wednesday.\n\nOn Saturday at a rally in Fort Lauderdale, teenage survivors criticized politicians for taking donations from the NRA. “Shame on you”, said one student, Emma Gonzalez.\n\nTrump, who the NRA spent spent more than $30m helping elect, has said little on gun control following the attack beyond a tweet late Saturday asking why Democrats didn’t pass legislation in the Obama administration, and has instead focussed on the mental health of the suspect, Nikolas Cruz.\n\n\n\nOn Twitter, Trump referenced the FBI’s admission on Friday that it failed to investigate a specific report in January that Cruz could be plotting a school shooting.\n\n“Very sad that the FBI missed all of the many signals sent out by the Florida school shooter. This is no acceptable,” tweeted Trump. He accused the FBI of “spending too much time trying to prove Russian collusion with the 2016 Trump campaign”.\n\nOn Friday, special counsel Robert Mueller announced an indictment of 13 Russians for trying to meddle in the US election. \n\n\n\nThe FBI has said the tip about Cruz should have been investigated thoroughly because it was a “potential threat to life”.\n\nCruz was arrested on Wednesday and has since been charged with murdering 17 people at a high school this week.\n\nSpeaking to CNN on Sunday morning, Kasich, who was a 2016 presidential candidate, branded Trump’s tweet “an absurd statement”. “The fact of the matter is the FBI apparently made a terrible mistake and people should be held accountable. But we need leadership out of the executive. This is a great opportunity for common sense steps that can be taken, just in the area of background checks,” he said.\n\nHe added: “There should be no ability to do a casual sale without anyone having to find out who they’re selling the gun to and what is involved. The president should be for that.”\n\nOn 5 January, a tipster who was close to Cruz called the FBI and provided information about Cruz’s guns, desire to kill people, erratic behavior and disturbing social media posts. The FBI says the caller expressed concerns Cruz could attack a school. Jeff Sessions, the US attorney general, issued a curt statement after the FBI admission saying that warnings signs had been missed with “tragic consequences”. He said: “We must do better.”\n\nMore demonstrations calling for gun control are planned across the country in the weeks ahead.\n\nPlans for the protests circulated widely on social media on Saturday, as students, parents, teachers and neighbors gathered to express their grief over the fatal shooting of 14 students and three staff members at the Marjory Stoneman Douglas high school in Parkland, Florida.\n\nOrganizers behind the Women’s March, an anti-Trump and female empowerment protest, called for a 17-minute nationwide walkout by teachers and students on 14 March.\n\nThe Network for Public Education, an advocacy organization for public schools, announced a day of walkouts, sit-ins and other events on school campuses on 20 April, the anniversary of the 1999 shooting at Columbine high school in Colorado that left 12 students and one teacher dead.", "Vox": "President Trump repeatedly promised on the campaign trail that he would pick a “pro-life” Supreme Court justice.\nTrump nominated Neil Gorsuch as his Supreme Court nominee on Tuesday night. Gorsuch is, without a doubt, a respected conservative jurist. But when it comes to abortion rights, specifically, Gorsuch’s record is minimal. He’s never ruled on a case hinging on the constitutionality of abortion restriction. So the best way to look at his views is to look at how he’s thought about birth control and about assisted suicide. Together, it appears he is more likely pro-life than pro-choice. \nGorsuch wrote that the birth control coverage mandate under the Affordable Care Act forces employers to “underwrite payments for drugs or devices that can have the effect of destroying a fertilized human egg.” That argument, which is unsupported by medical research, is often made by anti-abortion rights advocates to explain why they oppose birth control methods like IUDs and emergency contraception. \nSeparately, Gorsuch wrote a book, The Future of Assisted Suicide and Euthanasia, which argued against the legalization of assisted suicide because human life is “intrinsically valuable.” Arguing against assisted suicide is not the same as arguing against abortion access, but the language he uses is similar to that used by anti-abortion activists.       \n\nTogether, these writings suggest he’ll be the conservative justice Trump promises. But as perennial swing justice Anthony Kennedy has taught us, opposing abortion personally doesn’t necessarily mean you’ll vote to curtail legal abortion rights. Plus, he replaces Antonin Scalia, a fellow conservative, so Gorsuch doesn’t change the balance of the court. \nPro-choice groups are already suspicious \n“Gorsuch represents an existential threat to legal abortion in the United States and must never wear the robes of a Supreme Court justice,” NARAL Pro-Choice America president Ilyse Hogue said in a statement Tuesday. \nHogue added that Trump’s decision to “speed up” the announcement should not “distract from the hundreds of thousands of Americans demonstrating” against his anti-immigration executive order.      \n\nVicki Saporta, president and CEO of the National Network of Abortion Funds, called Judge Gorsuch “a far-right jurist who would overturn basic and well-established principles of American law.”\nClarke Forsythe, acting president of Americans United for Life (which describes itself as “the legal arm of the pro-life movement”) said Gorsuch’s nomination shows that Trump “values the legacy of the late Justice Antonin Scalia, and is dedicated to ensuring that the Supreme Court is staffed by jurists who respect the Constitution, not by politicians who vote with their policy preferences.”\nGorsuch has said things that would raise pro-choice alarm bells about the Affordable Care Act’s birth control benefit, and how broad the religious exemptions to that benefit should be in infamous cases like Hobby Lobby.", "The Washington Post": "Once again, President Trump underscored the vast difference between Trump the person and Trump the administration when it comes to his stance on divisive issues. And that's why, in hindsight, Democrats should have seen that Trump would not support any of their gun-control proposals.\n Where Trump's White House ended up on how to respond to school shootings is a world away from where he started. On Sunday, the White House released its proposal, which focuses on arming teachers, and doesn't mention raising the age limit for assault rifle purchases, which Trump supports.\n That's just the latest contradiction from the president on guns. He started out as one of the most pro-gun and pro-National Rifle Association presidents in modern history. After the massacre at a high school in Parkland, Fla., last month, he lent his support to a dizzying array of proposals from both sides. He:\n  Tweeted his support for “strengthening background checks” Called the leaders of the NRA “Great People and Great American Patriots” Took language right from the NRA to support “hardening” schools by arming teachers Promised to ban bump stocks Talked about raising the age to buy assault weapons from 18 to 21 Praised a new Florida gun-control law that does just that Appeared to support Democrats' proposals for banning assault weapons Snubbed the idea of federal commissions a day before his White House announced its own commission on school violence  The White House ended up far to the right of most of these proposals. Its idea to arm teachers is so controversial that most Republicans in Congress don't support it.\n We saw a similar unraveling of compromise play out in a January immigration debate. And a pattern is starting to emerge on how to read Trump's wild spins on divisive issues: When it comes time for the White House to put its own ideas in writing, he'll land to the right of most of the rest of Washington, no matter how he seemed to be at the center or left just a few days ago.\n When the cameras were invited to a White House meeting with Trump and bipartisan lawmakers a few weeks ago, Trump seemed so open to gun-control proposals that he accused one of the most pro gun-control Republicans in the Senate, Patrick J. Toomey, of being afraid of the NRA because Toomey's universal background check bill from 2013 also didn't raise the age limit for buying assault rifles.\n  Then, Trump made one of the most pro gun-control Democrats in the Senate, Dianne Feinstein, positively giddy with the suggestion Congress should ban assault weapons.\n  Actually, almost all Senate Democrats were thrilled after that meeting. They launched a news conference the very next day on Capitol Hill to unveil their gun-control wish list, hoping to build on the momentum the president had just given them.\n “I am sure many of you in this room and many Americans around the country watched the president's meeting on gun violence yesterday,” said Senate Minority Leader Charles E. Schumer (D-N.Y.), “and were rather stunned and surprised. Many of us pleasantly.”\n But whatever support Democrats think they had from the president has fizzled. Trump ignored their outstretched hand on universal background checks, and started talking more about arming teachers. Less than two weeks after that meeting, his White House formalized his drift back to the right. They announced Sunday night they would help train schoolteachers to carry guns, a proposal plucked straight from the NRA, and they'd endorse a Republican-led bill that reinforces the background check system but doesn't expand it.\n [ What will Congress realistically do on guns after the Florida shooting? ]\n Pretty much the same pattern played out a few months ago when Congress was trying to come up with an immigration deal to protect “dreamers” from deportation. Democrats thought they had a deal only to watch Trump renege. Trump ultimately put forward an immigration proposal to drastically change the legal immigration system that is so conservative most Republicans in Congress won't support it.\n There are two possibilities here about what's leading Trump to perform so many 360s on divisive issues, and they aren't mutually exclusive:\n  Trump doesn't know what he wants, and he's also not very familiar with the issues. That leads him to either mistakenly support more liberal solutions, or honestly support them without understanding the politics behind it. In an open-camera meeting with lawmakers on immigration in January, Trump appeared to agree with Democrats on a bill just to legalize dreamers without anything in exchange. House Majority Whip Kevin McCarthy (R-Calif.) had to interject to correct the president that's actually the opposite of what Trump wants to do. The president seemed genuinely confused:\n “Mr. President, you need to be clear, though,” McCarthy said. “I think what Senator Feinstein is asking there — when we talk about just DACA, we don’t want to be back here two years later. You have to have security.” Trump responded: “I think that’s what she’s saying.” “No, I think she’s saying something different,” McCarthy said. (She was.)\n Trump agrees with the last person who talked to him. And that's usually his staff, who have much more access to him than Democrats in Congress. That's people like Stephen Miller, a Trump loyalist who even some Republicans in Congress say is too extreme to deal with. “He's been an outlier for years,” Sen. Lindsey O. Graham (R-S.C.) said during the immigration debate of Miller, pointing the finger squarely at Miller for scuttling a bipartisan deal on dreamers, a deal Trump seemed open to just days earlier.  Whatever the reason for Trump's hard-right turns on immigration and guns, it underscores what Democrats most fear about negotiating with the president: That no matter what bipartisan compromises president seems to support when they're across the table from him, he'll fall back to his most conservative positions.", "Bloomberg": "Want to receive this post in your inbox every afternoon? Sign up here. \nIn West Virginia, teachers are getting a raise. In Tennessee, Nashvillians are getting a new mayor. And in Washington, the president is getting an earful from allies in Congress, in industry and in Europe on his plans for tariffs. —Sam Schulz\nEurope prepares to hit Trump back where it hurts. The European Union is readying 25-percent retaliatory tariffs targeting $3.5 billion worth of iconic American goods, largely made in GOP strongholds,  a list obtained by Bloomberg shows. (Think Kentucky bourbon and Wisconsin  Harleys.) It’s the latest in a drumbeat of warnings on President Donald Trump's steel-tariff plans, after earlier ones from Goldman Sachs and White House economic adviser Gary Cohn, who Trump  expects to quit if they go through.\n\n        \n        In Trump country, stock bulls are freaking out their brokers. Across middle America, the president’s most ardent, and financially comfortable, backers are opening stock-market accounts or beefing up existing ones. Their advisers have tried to tamp down their enthusiasm, to no avail.\nChina is making a bold military power play. President Xi Jinping has overhauled China’s military to challenge U.S. supremacy in the region. But he needs bases around the world and so far has only one overseas. A series of Bloomberg graphics shows what it would take to catch up.\nWill teachers’ strikes spread to other states? The fury among low-paid teachers that triggered a wildcat strike in West Virginia, the longest in the state’s history, may be spreading. The Oklahoma teachers’ union said it will shut down schools in the state within months if its demands aren’t met.\nBritain might boycott the World Cup in Russia. Days after a Russian dissident convicted in his home country was found critically ill on a bench in Salisbury, the U.K. says it’s considering tougher sanctions and a boycott of soccer’s biggest event if the Kremlin was behind the incident.\nInvestment managers and doctors are eyeing a loophole in what’s supposed to be a mom-and-pop benefit of the new tax law as a way to supersize their savings. A guardrail aims to keep top earners from using the benefit, but a gap lets it go to anyone who runs profits through a cooperative.\n\n        \n        Ritz-Carlton is fixing everything you hate about cruise ships. Think about what you might love: Visits to secluded islands. Long, leisurely port calls. A crew that intuits whether you’re in the mood for a private tour of a nearby estate or a day of sunning on the deck. It sounds much more like yachting than cruising—which is precisely the point.", "CNN": "Dana Loesch, the spokesperson for the National Rifle Association, says a shooter who killed 17 people last week at a high school in Florida should not have been able to get a firearm.\n\n\"I don't believe this insane monster should have ever been able to obtain a firearm,\" Loesch said Wednesday night, calling the suspect \"nuts.\"\n\n\"We have to start ... following up on red flags,\" she later added.\n\nLoesch, as well as Broward County Sheriff Scott Israel, Florida lawmakers Rep. Ted Deutch and Sens. Bill Nelson and Marco Rubio, along with students, parents and community members, participated in the CNN town hall \"Stand Up: The Students of Stoneman Douglas Demand Action\" in Sunrise, Florida.\n\nThe town hall came a week after 17 people were shot to death at the school in Parkland, Florida, which has prompted calls on lawmakers for gun reform -- notably from students around the country.\n\nThe NRA has given significant donations to various political candidates, including Rubio, who received two donations of $4,950 during the 2016 campaign from the NRA's political arm, The National Rifle Association Political Victory Fund. In the wake of criticism the NRA has received following last week's tragedy, Loesch said prevention should include ensuring that dangerous individuals are not able to obtain firearms. \"This is the eighth tragedy, the eighth tragedy, where we have seen numerous tips that have been reported and red flags,\" she said. Loesch reiterated that message throughout the town hall. \"This is what I'm talking about in terms of prevention and making sure that people who are dangerous should not have access to firearms, without punishing law-abiding Americans who want to be able to have that same right to defend themselves,\" she said. President Donald Trump declined CNN's invitation to the town hall but sat down with individuals who were personally affected by school shootings at a listening session at the White House earlier Wednesday. There, he suggested providing firearms to swaths of teachers to prevent school shootings.", "Associated Press": "WASHINGTON (AP) -- The Latest on President Trump, Congress and guns (all times local):\n\nRep. Steve Scalise says people at the FBI should be held accountable after it didn't act on a tip about the man who later allegedly killed 17 people at a Florida high school.\n\nThe No. 3 House GOP leader suffered life-threatening wounds when a gunman shot several people last June at a congressional Republican baseball practice.\n\nScalise tells reporters the FBI had the Florida shooter's name \"on a silver platter\" and says \"there are people at the FBI that chose to let this go.\" He says lawmakers should \"hold people accountable.\"\n\nScalise says he received a new baseball jersey last week while visiting the University of Louisiana at Lafayette. The school's jersey he was wearing at the practice \"didn't hold up\" and is being held as evidence by the FBI.\n\nTelevision personality Geraldo Rivera is expressing skepticism that President Donald Trump will achieve any new gun control measures.\n\nOn Twitter Tuesday Rivera says: \"Incredibly we're set to do nothing re gun control again. The only person in the country strong enough to stand up to #NRA @realDonaldTrump is apparently taking a pass after dropping modest reform of banning sales of semi automatics to kids not old enough to buy cigarettes & beer.\"\n\nRivera recently pitched Trump on increasing the minimum age for rifle purchases.\n\nTrump has expressed interest in the idea. But he has not backed any legislation and did not mention the concept when meeting with governors to discuss gun violence Monday.\n\nTexas Sen. John Cornyn says the Senate should \"immediately\" pass a bill he has co-sponsored to strengthen federal background checks for gun purchases.\n\nThe bill would penalize federal agencies that don't properly report required records to the National Instant Criminal Background Check System and reward states that comply by providing them with federal grant preferences.\n\nCornyn, the Senate's No. 2 Republican, says he was dismayed that Senate Democrats want to debate other ideas before taking up the background checks bill, known as \"Fix NICS.\"\n\nCornyn said Tuesday that, \"if our attitude is, 'I want everything on my list or nothing,' we're going to end up with nothing\" on gun control after the Florida high school shooting.\n\nHe urged senators to move \"immediately to pass Fix NICS and build from there.\"\n\nHouse Speaker Paul Ryan is showing no interest in banning assault weapons or expanding background checks for gun sales online or at gun shows. He also says he thinks President Donald Trump's idea of arming teachers is best left to local governments.\n\nRyan acknowledged there were \"system failures\" at the Florida school shooting and told reporters a lot of questions \"need answers.\"\n\nAsked about proposals for stricter background checks or barring assault weapon sales, Ryan says Congress shouldn't be \"banning guns from law-abiding citizens.\"\n\nThe House already passed legislation making modest fixes to the gun-purchase background check system. But the package stalled in the Senate because it also expands other gun owner rights. Ryan says if the Senate keeps just the background check provision, the House will \"cross that bridge when we get to it.\"\n\nPresident Donald Trump says political leaders sometimes need to buck the National Rifle Association.\n\nRepublicans controlling Congress are less sure of that approach, keeping largely quiet amid public calls for stricter gun laws.\n\nIn the Senate, a bipartisan bill seeks to strengthen the National Instant Criminal Background Check System.\n\nTrump's ideas to arm many teachers, lift the minimum age for purchasing assault rifles to 21 and impose stricter background checks have fallen flat so far. The White House is inviting lawmakers from both parties for meetings this week.\n\nThe Senate's No. 2 Republican, John Cornyn of Texas, questions Trump's proposal to raise the age limit for assault weapons, calling it an arbitrary age increase.", "Reuters": "WASHINGTON (Reuters) - The head of the National Rifle Association lashed out at gun control advocates on Thursday, saying Democratic elites are politicizing the latest mass school shooting in the United States to try to erode constitutionally guaranteed gun rights. \nNRA chief executive Wayne LaPierre echoed President Donald Trump’s call to arm teachers to prevent school shootings, and weighed in on a long-running political and cultural divide over access to weapons that has been inflamed by last week’s massacre at a Florida high school that killed 17 students and staff. \n“The elites don’t care not one whit about America’s school system and school children,” LaPierre told a friendly audience of conservatives outside Washington. “Their goal is to eliminate the Second Amendment and our firearms freedoms so they can eradicate all individual freedoms.” \nThe U.S. Constitution’s Second Amendment protects the right to bear arms.  \nAt the White House, Trump told local and state school officials he had discussed his ideas to stem gun violence in schools with the NRA, the politically influential gun lobby that backed him in the 2016 campaign. He called the group “Great American Patriots.” \n“There’s a tremendous feeling that we want to get something done,” he said. “The NRA wants to do the right thing.” \nSenate Democratic leader Chuck Schumer condemned LaPierre’s comments and said the NRA was “once again spewing pathetic, out of touch ideas, blaming everything but guns.” \nThe Feb. 14 rampage at Marjory Stoneman Douglas High School in Parkland, Florida was the latest in a series of deadly shootings at U.S. schools and has spurred unprecedented youth-led protests in cities across the country. Many of the teenagers and their parents taking part have called for more curbs on guns. \nLaPierre, speaking at the annual gathering of the Conservative Political Action Conference, portrayed the NRA as the true protector of the country’s schoolchildren and offered free training to those who want to bear arms to protect schools. \n“We must immediately harden our schools,” he said. “Every day, young children are being dropped off at schools that are virtually wide open, soft targets for anyone bent on mass murder.” It should not be easier to shoot up a school than a bank or a jewelry store, he added. \nThe NRA set up a booth at the conference to sign up new members and recruit campaign field workers for the November mid-term elections in which Democrats are trying to take over control of Congress from Trump’s fellow Republicans. \nMarjory Stoneman Douglas High School shooting mother Melissa Blank (L) and surviving students Jonathan Blank (2nd L) and Julia Cordover (3rd L) react along with U.S. President Donald Trump as they listen to survivors and the relatives of victims during a listening session with high school students, family members and teachers to discuss school safety and shootings at the White House in Washington, U.S., February 21, 2018.  REUTERS/Jonathan Ernst\nARMED TEACHERS “I‘m strongly for concealed carry, strongly for arming the teachers like Trump said,” said Nick Fuentes, 19, from Chicago, as he stood outside the booth. “Teachers who are adept at firearms should be armed.” \nLaPierre attacked Democrats by name including Senators Kamala Harris, Elizabeth Warren and Christopher Murphy and also took a swipe at the FBI for failing to follow up on a tip about the alleged shooter in the Parkland massacre. The FBI has said it failed to act on the tip. \nFlorida Governor Rick Scott also criticized the FBI for failing so far to provide details about why it did not respond to the tip. “Family members and loved ones of the victims deserve answers today,” Scott said in a statement. \nTrump reiterated his idea, first raised on Wednesday during an emotional discussion with people affected by the shooting, to arm teachers, a notion raised by some politicians in the past but dismissed by critics as fraught with danger. \n“Anyone who pushes arming teachers doesn’t understand teachers and doesn’t understand our schools. Adding more guns to schools may create an illusion of safety, but in reality it would make our classrooms less safe,” said Randi Weingarten, the president of the American Federation of Teachers union. \nAt an hourlong meeting on school safety with 10 state and local officials, Trump said armed teachers with an aptitude for guns would deter would-be shooters. \n“A gun-free zone to a killer, or somebody that wants to be a killer, that’s like going in for the ice cream,” Trump said. “They’re not going to walk into a school if 20 percent of the teachers have guns.” \nTrump repeated his support for tightening background checks for gun buyers, with an emphasis on mental health, and lifting the age limit to buy some kinds of guns. He also said he would push for an end to the sale of bump stocks, which allow rifles to shoot hundreds of rounds a minute. \nThe White House said Trump does not want to ban sales of an entire class of firearms despite mounting pressure to put assault weapons such as the one used in the Florida shooting out of civilian reach. \nWhile gun laws vary widely by state, most federal gun control measures would require Congress to act. \nA 19-year-old former student at Stoneman Douglas, Nikolas Cruz, has been charged with carrying out the Parkland shooting. Authorities say he was armed with a semiautomatic AR-15 assault-style rifle that he had purchased legally last year. \nAdditional reporting by Alex Dubuzinskis in Los Angeles, Susan Heavey, Doina Chiacu in Washington; Writing by Doina Chiacu and John Whitesides; Editing by Frances Kerry and Will Dunham", "Wall Street Journal": "This transcript has been automatically generated and may not be 100% accurate.\n\n... Donald Trump's you it ... is escalating what the family of my income ... he's the Army captain who was killed in Iraq ... and who happen to be Muslim and born in the United Arab Emirates ... and his father appeared ... at the Democratic National Convention last week ... to criticize Donald Trump's plans ... to bar Muslims like Mr Khan from this country on Monday John McCain ... rebuked Donald Trump for his criticism of the Khan family ... as did Rob Portman Kelly Ayotte and a number of other Republican senators ... and their criticism of Mr Trump ... follows that of Mitch McConnell and Paul Ryan over the weekend ... now this feud between Mr Trump and the Khan family ... raises a number of questions within the presidential campaign ... I've been one is that's what kind of campaign ... does Donald Trump won Iran ... through the November elections during the primaries he was in the words famously of Jeb Bush ... the chaos can be ... used to insult to belittle those opponents ... he had a narrow policy agenda but a very forceful one ... focused on limiting trade and immigration ... and at war ... but as the general election approached ... his campaign wanted to try something different ... they wanted to use the Republican National Convention ... in Cleveland to present a different kind of Donald Trump they wanted to raise Americans ... comfort level with Donald Trump after the convention though ... we have this fight with Mr Khan ... and a large part of the Republican party rebuking Mr Trump or picking a fight with a gold star family ... the question remains the same going forward which is a more important to Donald Trump ... is you can try to raise the comfort level of people who might be looking Adam skeptically and deciding whether they can vote for him where's it more important for him to do the kinds of things that energize ... an enemy ... of core base of supporters ... and make sure that they come out to vote ...", "USA Today": "Bumble Founder Whitney Wolfe Herd, left, joins Erin Foster and Sara Foster at a Bumble event on January 31, 2018 in Los Angeles.(Photo: Charley Gallay, Getty Images for Bumble)\n\n\nBumble, a fast-growing dating app, will begin banning guns from the profile photos of its nearly 30 million users, the company announced Monday.\n\"As mass shootings continue to devastate communities across the country, it’s time to state unequivocally that gun violence is not in line with our values, nor do these weapons belong on Bumble,\" a statement read.\nCiting its premise as an app \"with safety in mind\" — men can't initiate conversations with women on the app — the company said it would review all new and existing photos and update its terms in the process.\nThere are some exceptions, the company said: Users in the military or law enforcement may display guns in their photos, but only if they're in uniform. Additionally, founder Whitney Wolfe Herd told The New York Times, sport shooters may appeal to have photos featuring such gun use restored.\nMore: Dick's Sporting Goods pulled assault-style rifles after Sandy Hook, too. It didn't last.\nEventually, Herd told the newspaper, Bumble plans to filter out mentions of guns in the app's written text, too. She pointed to problems tied to a lack of moderation on other social networks.\n“Compared to what’s going on with Facebook and Twitter, we take a very proactive approach,” Herd told the Times. “If I could police every other social platform in the world, I would.” \nForbes called Bumble \"America's fastest-growing dating app\" last year. It had half the users of Tinder, its main competitor and Herd's former employer, but boasted 70% year-over-year growth compared to Tinder's growth of about 10%, the magazine said.\nBumble's move comes among many taken by companies following last month's high school shooting in Parkland, Fla., including airlines like Delta and retailer Dick's Sporting Goods. \nBumble said in the statement that it would donate $100,000 to March For Our Lives, the group formed by survivors of the Parkland shooting.\n\"We stand with them, and join them in working towards a non-violent future,\" the statement said.\nMore: See the list of companies that cut discounts for NRA members after Parkland, Florida school shooting\nMore: March For Our Lives announces March 24 event\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Fla. Senate passes bill that would arm some teachers | 2:20The Florida Senate passed a $400 million security package that will impose longer waiting periods for gun purchases and allow some teachers and staff to carry guns in the classroom.\n                                         USA TODAY\n\n\n1 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Parents of shooting victims push legislation | 2:32The families of the 17 Florida high school massacre victims called on the state legislature to pass a bill they believe would improve security at the state’s public schools. (March 5)\n                                         AP\n\n\n2 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Graham: Both parties would suffer if they don't address guns | 0:50With gun legislation at the forefront of recent debate, Senator Lindsey Graham weighed in Sunday, saying both parties would “suffer” if they did not address the issue. For more on the story here is Zachary Devita.\n                                         Buzz60\n\n\n3 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Senate democrats push 3-point plan on guns | 1:56Democratic Senate Leader Chuck Schumer spelled out a 3-point plan on guns and and urged President Trump to endorse tougher restrictions of firearms following yesterday's bipartisan meeting at the White House. ( Mar. 1)\n                                         AP\n\n\n4 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Gun legislation fissures appear in U.S. Senate | 2:14Congress has been pressed to act following last month's deadly school shooting in Florida, but Senators are at odds on what to prioritize in changes to legislation. (March 1)\n                                         AP\n\n\n5 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Walmart hikes minimum age to buy guns | 1:20Walmart Inc, the largest U.S. retailer, says it will raise the minimum age to purchase firearms to 21 after the massacre at a Florida high school that has reopened a fierce debate over gun control in America. Ryan Brooks reports.\nVideo provided by Reuters\n                                         Newslook\n\n\n6 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Trump Calls for Action on Gun Safety in Schools | 2:07President Donald Trump said Wednesday that Congress should act quickly on gun laws as he convened lawmakers at the White House and pushed for tougher background checks, school safety and mental health resources to prevent shootings. (Feb. 28)\n                                         AP\n\n\n7 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Democrats Urge for Gun Reform on Senate Floor | 1:30Senate Democrats took the floor just hours after a bipartisan group of senators and representatives sat down with President Donald Trump to discuss school safety and possible gun legislation. (Feb. 28)\n                                         AP\n\n\n8 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Donald Trump: Don't include concealed weapons in background check bill | 2:03President Donald Trump suggested Republicans should focus on the background check bill, then load it up with other gun control and safety measures. (Feb. 28)\n                                         AP\n\n\n9 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Trump says Congress is 'afraid of the NRA' | 0:46President Trump sat down with members of Congress to discuss gun control and the issue of age limits for purchasing weapons.\n                                         USA TODAY\n\n\n10 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Fla. Gov. Rick Scott unveils $500M school safety plan | 1:41Gov. Rick Scott of Florida has unveiled a $500 million school safety plan exactly two weeks after a Valentines's Day mass shooting claimed 17 lives at Marjory Stoneman Douglas High School in Parkland, Florida. (Feb. 28)\n                                         AP\n\n\n11 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Dick's Ends Sales Of Assault-Style Rifles | 1:34Dick's Sporting Goods, a major U.S. retailer, will immediately halt sales of assault-style rifles and high-capacity magazines at all of its stores, including Field  Stream and ban the sale of all guns to anyone under 21. (Feb. 28)\n                                         AP\n\n\n12 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Congress debate on gun control stalls vote | 1:34The Senate was poised to consider to strengthen the National Instant Criminal Background Check System (NICS), though votes were not yet scheduled amid resistance from within the GOP ranks. (Feb. 27)\n                                         AP\n\n\n13 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Some GOP lawmakers open to gun law changes | 1:04Some GOP lawmakers in Washington appear willing to consider legislative restrictions to curb gun violence, particularly in outlawing bump stocks, which the Trump administration also wants to do through administrative action. (Feb. 26)\n                                         AP\n\n\n14 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Expert: Dollars driving NRA corporate backlash | 1:50A growing number of large companies cutting ties with the NRA are motivated by dollars, not politics, according to UCLA law professor Adam Winkler. Winkler said companies participate in boycotts to pursue profit and please their customers. (Feb. 26)\n                                         AP\n\n\n15 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Georgia conservatives give Delta ultimatum on NRA dealings | 1:07Georgia conservatives are threatening to block tax legislation that could give Delta Airlines a 40-million-dollar tax break unless the airline reinstates their relationship with the NRA.\n                                         USA TODAY\n\n\n16 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            White House: Some teachers 'desire' being armed | 1:39The White House says its spoken to teachers who are in favor of carrying guns but \"we're not advocating for the arming of every single teacher in the school.\" (Feb. 26)\n                                         AP\n\n\n17 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Lawrence: 'problem is guns, not entertainment' | 1:55At the New York premiere of spy thriller \"Red Sparrow,\" stars Jennifer Lawrence and Joel Edgerton address the question of whether movies and games are to blame for gun violence, with Lawrence taking time to praise the outspoken survivors of the recent Florida school shooting. (Feb. 27)\n                                         AP\n\n\n18 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Gun owners destroy weapons in protest | 1:53Some gun owners are destroying their firearms in protest after the recent school shooting in Florida. Posting videos on Facebook with the hashtag #oneless, they are taking a stand against recent high-profile shootings. (Feb. 26)\n                                         AP\n\n\n19 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Eric Trump supports raising gun purchasing age to 21 | 0:36Eric Trump said he supports raising the federal age limit for purchasing assault weapons during an Interview on Fox and Friends. Veuer's Sam Berman has the full story.\n                                         Buzz60\n\n\n20 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Trump looking at law allowing gun confiscation from dangerous owners | 0:39The Trump administration says it is looking at a law that allows authorities to confiscate guns from individuals who are a threat to a society.\n                                         Buzz60\n\n\n21 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            GOP Rep. says background checks like 'trying to put lipstick on a pig' | 0:50Republican Congressman Thomas Massie says he has some serious solutions to gun control in the wake of the fatal Florida school shooting. But when it comes to President Trump proposing stronger background checks he says its \"like trying to put lipstick on a pig.\"\n                                         Buzz60\n\n\n22 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Colorado teacher: 'I don't want to have a gun' | 1:49Following the shooting in Florida that left 17 people dead, Joseph DeStefano, a high school English teacher in Centennial, Colorado, said he opposes having armed school staff in order to ensure safety. (Feb. 23)\n                                         AP\n\n\n23 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            FL governor proposes gun sale ban to anyone under 21 | 2:47Florida's governor is proposing a three-point plan to prevent gun violence that includes banning the sale of firearms to anyone younger than 21 in the wake of last week's school massacre in Parkland, Fla.\n                                         AP\n\n\n24 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Teacher won't carry a gun in class 'ever, ever, ever' | 2:57What's the answer to stopping school shootings? President Trump thinks it's arming educators. We asked teachers all over the country, this is what they said.\n                                         USA Today\n\n\n25 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Florida school supt. against arming teachers | 3:01Broward County Schools Superintendent Robert Runcie says he is \"totally against arming teachers\" because \"they have a challenging job as it is.\" (Feb. 23)\n                                         AP\n\n\n26 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Florida governor proposes plan to prevent gun violence | 1:22After the deadly shooting at Marjory Stoneman Douglas High School, Gov. Rick Scott unveiled a $500 million plan to address safety in schools.\n                                         USA TODAY\n\n\n27 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Bank and car rental giants are cutting ties with the NRA | 1:05Companies being urged to cut ties with the gun rights group, advocating a NRA boycott. Veuer's Nick Cardona has that story.\n                                         Buzz60\n\n\n28 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            White House: Arming teachers 'very serious' idea | 0:58The White House said its talked to teachers who are willing to get trained on using a concealed weapon. (Feb. 22)\n                                         AP\n\n\n29 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            President Trump suggests giving teachers bonuses for carrying guns | 1:22President Donald Trump Thursday proposed “a little bit of a bonus” for teachers who go through “rigorous” training to carry guns in the classroom.\n                                         Time\n\n\n30 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            White House: President opposes 'brand' of shooter drills | 2:24White House Spokesman Raj Shah sought to clarifiy President Donald Trump's stance of opposing active shooter drills at schools, saying the president opposed \"the brand of it.\" (Feb. 22)\n                                         AP\n\n\n31 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Armed police guard schools in N.J. after Florida shooting | 1:25Armed police guard schools in N.J. after Florida shooting\nVideo provided by AFP\n                                         Newslook\n\n\n32 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            'You're wrong!' Florida Sheriff tells NRA spokeswoman | 1:11Things got pretty heated between NRA spokeswoman, Dana Loesch, and Broward County Sheriff, Scott Israel, during a CNN Town Hall meeting on gun control.\n                                         USA TODAY\n\n\n33 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Florida sheriff program arms trained teachers | 1:52A second Florida school is joining a voluntary program to allow staff to bring guns to work. The Sentinel Program lets teachers who have been through rigorous training, even more than required to be a sheriff, carry arms during the school day. (Feb. 22)\n                                         AP\n\n\n34 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Mich. Teacher: Arming Us 'Absolutely Ridiculous' | 1:20The idea of arming teachers is not a popular one among a Detroit-area high school teacher and a handful of her students. The group spoke to the Associated Press outside their school campus on Thursday, describing the idea as \"illogical\" and \"ridiculous.\" (Feb. 22)\n                                         AP\n\n\n35 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Trump pledges to raise minimum age for gun purchases to 21 | 0:55In a tweet, President Trump announced he will be pushing for Comprehensive Background Checks, raise the age for purchasing guns to 21, and end the sale of bump stocks. Veuer's Sam Berman has the full story.\n                                         Buzz60\n\n\n36 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Donald Trump backs hardened schools, not shooter drills | 2:58President Donald Trump Thursday endorsed tighter background checks for purchasing guns and reiterated his calls for trained teachers to carry guns but said he believes armed shooting drills in school are \"a very negative thing.\" (Feb. 22)\n                                         AP\n\n\n37 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            NRA: 'Many in legacy media love mass shootings' | 2:05NRA spokeswoman Dana Loesch, addressing a conservative political conference, says \"many in legacy media love mass shootings, you guys love it.\" (Feb. 22)\n                                         AP\n\n\n38 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Union: No to arming teachers | 1:37America's largest teacher's union says Pres. Donald Trump's call to arm teachers to protect schools from violence won't work. Trump tweeted Thursday morning \"I never said 'give teachers guns' like was stated on Fake News CNN  NBC.\" (Feb. 22)\n                                         AP\n\n\n39 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Mike Pence: School safety will be 'top national priority' | 1:40Speaking to a major conservative gathering outside Washington, DC, Vice President Mike Pence addressed the recent school massacre in Parkland, Florida  and said the administration will make school safety \"our top national priority.\" (Feb. 22)\n                                         AP\n\n\n40 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            NRA: We must 'harden' protections at our vulnerable schools | 3:10NRA chief Wayne LaPierre says supporters of gun control are exploiting the school shooting in Florida to promote an anti-gun agenda. He says the way to \"stop a bad guy with a gun,\" in the nation's schools is to arm a \"good guy with a gun.\" (Feb. 22)\n                                         AP\n\n\n41 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            School shooting survivors confront President Trump | 2:37Hear what students, parents and teachers affected by school shootings told President Donald Trump.\n                                         USA TODAY\n\n\n42 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Voices: How gun control advocates are creating change | 3:22With every mass shooting, positions on gun control seem to harden more with no major breakthroughs. These advocates are accelerating efforts to bypass the system and create change at the community level.\n                                         USA TODAY Opinion\n\n\n43 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Students get emotional in talks with Trump | 1:38Students and parents are delivering emotional appeals to President Donald Trump to act on school safety and guns after last week's school shooting. (Feb. 21)\n                                         AP\n\n\n44 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Trump considers concealed carry for teachers | 2:06President Donald Trump says he's considering backing proposals to promote concealed carrying of weapons by trained school employees to respond to campus shootings. (Feb. 21)\n                                         AP\n\n\n45 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            GOP congresswoman claims many Mass Murderers 'end up being Democrats' | 1:04Most mass shooters are Democrats…that’s what one Republican Congresswoman told a radio station in upstate New York. Veuer's Nick Cardona has that story.\n                                         Buzz60\n\n\n46 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Toomey eyes reviving gun background check bill | 2:00Republican U.S. Sen. Pat Toomey of Pennsylvania says he'll probably reintroduce legislation to expand background checks on gun purchases, but that it may require changes for him to do so. (Feb. 21)\n                                         AP\n\n\n47 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Sheriff, NRA spokeswoman clash at CNN town hall | 1:52NRA spokeswoman Dana Loesch appeared on a CNN Town Hall on guns and said law enforcement could have done more to stop the Florida school shooting. Broward County Sheriff Scott Israel said Loesch had her facts wrong. (Feb. 22)\n                                         AP\n\n\n48 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Angry questions at CNN town hall on guns | 2:35At a town hall held by CNN in Sunrise, Florida, on Wednesday night, thousands of angry students, teachers and parents booed Republican Sen. Marco Rubio when he indicated that he would not support an assault-weapons ban. (Feb. 22)\n                                         AP\n\n\n49 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Students across the U.S. hold protest walkouts over gun violence | 0:25In a wave of demonstrations reaching from Arizona to Maine, students at dozens of U.S. high schools walked out of class Wednesday to protest gun violence and honor the victims of last week’s deadly shooting in Florida.\n                                         Time\n\n\n50 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Store that sold gun to Florida shooter closes its doors | 1:04The gun store where Parkland school shooter Nikolas Cruz legally bought his AR-15 rifle has closed down for good Friday, with the former owners now being in favor for more restrictive gun control legislation. For more on the story here is Zachary Devita.\n                                         Buzz60\n\n\n51 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Douglas Students Petition Florida Lawmakers | 3:21Over 100 students from Marjory Stoneman Douglas high school made in person visits to their state representatives for conversations on gun control. Some were willing listeners, others were not. (Feb. 21)\n                                         AP\n\n\n52 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Passionate pleas for tougher gun laws in Florida | 3:35Several thousand people rallied outside the Florida Capitol building giving passionate pleas to legislators to pass tougher gun laws and pledging to vote out officials supported by the NRA. (Feb. 21)\n                                         AP\n\n\n53 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Florida Sen. Bill Nelson urges change in gun laws | 2:13Florida Sen. Bill Nelson told reporters that he's continuing to work for changes in gun laws. He said the Florida Legislature also bears some responsibility, adding they could outlaw assault weapons in the state. (Feb. 16)\n                                         AP\n\n\n54 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Maryland students head to Capitol in call for gun control | 2:43Hundreds of Maryland high school students are ditching class and rallying at the U.S. Capitol in support of stronger gun control. (Feb. 21)\n                                         AP\n\n\n55 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Fla. House declares porn public health risk, denies assault rifle ban | 0:50The Florida House of Representatives declared pornography a public health risk, just minutes after rejecting a motion to consider a bill that would ban assault rifles. Veuer's Sam Berman has the full story.\n                                         Buzz60\n\n\n56 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            President Trump on move to ban bump stocks | 1:22President Donald Trump said Tuesday that he signed a memorandum directing Attorney General Jeff Sessions to propose regulations that would ban some gun accessories, including so-called “bump stocks.\"\n                                         Time\n\n\n57 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            AP Explains: Fla. Lawmakers Focus on Gun Debate | 1:57The Florida school shooting has put pressure on the state's Republican-controlled Legislature to consider a sweeping package of gun-control laws in a state that has resisted firearms restrictions for decades. AP Reporter Gary Fineout explains. (Feb. 20)\n                                         AP\n\n\n58 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            NJ Gov. Phil Murphy eyes regional approach on guns | 1:57Responding to last week's massacre in Florida, New Jersey Gov. (D) Phil Murphy called for a federal ban on military-style assault rifles and said if Congress doesn't take action on gun violence, he'll promote a regional approach to the issue.\n                                         AP\n\n\n59 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Trump proposes ban of rapid-fire gun devices | 1:23President Donald Trump says he's signed a memo directing the Justice Department to propose regulations to \"ban all devices\" like bump stocks used in last year's Las Vegas massacre. (Feb. 20)\n                                         AP\n\n\n60 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Florida students rally to change gun laws | 1:11Dozens of students lined the streets outside their high school in Plantation, Florida to protest gun laws in the wake of last week's deadly shooting in Parkland. (Feb. 19)\n                                         AP\n\n\n61 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Jimmy Kimmel makes tearful plea to Donald Trump for gun control | 1:18Late night host Jimmy Kimmel gave a tearful plea for President Trump to pursue gun control following the shooting at a Parkland, Florida school. Nathan Rousseau Smith has the story.\n                                         Buzz60\n\n\n62 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Column: Get the numbers right on school shootings | 1:41No, there have not been 18 school shootings already this year. Misleading stats make finding a solution to the problem of gun violence that much harder, says David Mastio, deputy editorial page editor.\n                                         USA TODAY Opinion\n\n\n63 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Florida Shooting Survivors Protest NRA | 1:51Dozens of students and parents from Marjory Stoneman Douglas High School convened at a park near the Parkland school. The crowd held signs calling for stricter gun control laws and called out politicians for accepting money from the NRA. (Feb. 18)\n                                         AP\n\n\n64 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Fla. Senator demands action after mass shooting | 3:14Democratic Senator Bill Nelson demands Congressional action in the wake of a southern Florida high school shooting that kiled 17 Tuesday. (Feb. 15)\n                                         AP\n\n\n65 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Florida students protest against gun violence | 1:13Several dozen students from South Broward High School took a public stand against gun violence Friday and for gun control. (Feb. 16)\n                                         AP\n\n\n66 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Fla. Gov. Rick Scott vows to keep mentally ill from guns | 2:29Florida Gov. Rick Scott says he'll sit down with state leaders and work on how they can make sure people with mental illness aren't able to get guns. (Feb. 15)\n                                         AP\n\n\n67 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Why AR-15-style rifles are so common in mass shootings | 1:32AR-15-style rifles have been used in multiple mass shootings in recent years, including the high school shooting in Parkland, Florida. See why.\n                                         USA TODAY\n\n\n68 of 69\n\n\nCLOSE\n\n\n\n\n\n\nFLORIDA SCHOOL SHOOTING REIGNITES FIERCE GUN CONTROL DEBATE\n                                            Florida school shooting fuels calls for #GunReformNow | 2:04The deadly shooting at a Parkland, Fla., high school is prompting renewed calls for more gun control.\n                                         USA TODAY\n\n\n69 of 69\n\n\n\nLast VideoNext Video\n\n                                Fla. Senate passes bill that would arm some teachers\n                            \n\n                                Parents of shooting victims push legislation\n                            \n\n                                Graham: Both parties would suffer if they don't address guns\n                            \n\n                                Senate democrats push 3-point plan on guns\n                            \n\n                                Gun legislation fissures appear in U.S. Senate\n                            \n\n                                Walmart hikes minimum age to buy guns\n                            \n\n                                Trump Calls for Action on Gun Safety in Schools\n                            \n\n                                Democrats Urge for Gun Reform on Senate Floor\n                            \n\n                                Donald Trump: Don't include concealed weapons in background check bill\n                            \n\n                                Trump says Congress is 'afraid of the NRA'\n                            \n\n                                Fla. Gov. Rick Scott unveils $500M school safety plan\n                            \n\n                                Dick's Ends Sales Of Assault-Style Rifles\n                            \n\n                                Congress debate on gun control stalls vote\n                            \n\n                                Some GOP lawmakers open to gun law changes\n                            \n\n                                Expert: Dollars driving NRA corporate backlash\n                            \n\n                                Georgia conservatives give Delta ultimatum on NRA dealings\n                            \n\n                                White House: Some teachers 'desire' being armed\n                            \n\n                                Lawrence: 'problem is guns, not entertainment'\n                            \n\n                                Gun owners destroy weapons in protest\n                            \n\n                                Eric Trump supports raising gun purchasing age to 21\n                            \n\n                                Trump looking at law allowing gun confiscation from dangerous owners\n                            \n\n                                GOP Rep. says background checks like 'trying to put lipstick on a pig'\n                            \n\n                                Colorado teacher: 'I don't want to have a gun'\n                            \n\n                                FL governor proposes gun sale ban to anyone under 21\n                            \n\n                                Teacher won't carry a gun in class 'ever, ever, ever'\n                            \n\n                                Florida school supt. against arming teachers\n                            \n\n                                Florida governor proposes plan to prevent gun violence\n                            \n\n                                Bank and car rental giants are cutting ties with the NRA\n                            \n\n                                White House: Arming teachers 'very serious' idea\n                            \n\n                                President Trump suggests giving teachers bonuses for carrying guns\n                            \n\n                                White House: President opposes 'brand' of shooter drills\n                            \n\n                                Armed police guard schools in N.J. after Florida shooting\n                            \n\n                                'You're wrong!' Florida Sheriff tells NRA spokeswoman\n                            \n\n                                Florida sheriff program arms trained teachers\n                            \n\n                                Mich. Teacher: Arming Us 'Absolutely Ridiculous'\n                            \n\n                                Trump pledges to raise minimum age for gun purchases to 21\n                            \n\n                                Donald Trump backs hardened schools, not shooter drills\n                            \n\n                                NRA: 'Many in legacy media love mass shootings'\n                            \n\n                                Union: No to arming teachers\n                            \n\n                                Mike Pence: School safety will be 'top national priority'\n                            \n\n                                NRA: We must 'harden' protections at our vulnerable schools\n                            \n\n                                School shooting survivors confront President Trump\n                            \n\n                                Voices: How gun control advocates are creating change\n                            \n\n                                Students get emotional in talks with Trump\n                            \n\n                                Trump considers concealed carry for teachers\n                            \n\n                                GOP congresswoman claims many Mass Murderers 'end up being Democrats'\n                            \n\n                                Toomey eyes reviving gun background check bill\n                            \n\n                                Sheriff, NRA spokeswoman clash at CNN town hall\n                            \n\n                                Angry questions at CNN town hall on guns\n                            \n\n                                Students across the U.S. hold protest walkouts over gun violence\n                            \n\n                                Store that sold gun to Florida shooter closes its doors\n                            \n\n                                Douglas Students Petition Florida Lawmakers\n                            \n\n                                Passionate pleas for tougher gun laws in Florida\n                            \n\n                                Florida Sen. Bill Nelson urges change in gun laws\n                            \n\n                                Maryland students head to Capitol in call for gun control\n                            \n\n                                Fla. House declares porn public health risk, denies assault rifle ban\n                            \n\n                                President Trump on move to ban bump stocks\n                            \n\n                                AP Explains: Fla. Lawmakers Focus on Gun Debate\n                            \n\n                                NJ Gov. Phil Murphy eyes regional approach on guns\n                            \n\n                                Trump proposes ban of rapid-fire gun devices\n                            \n\n                                Florida students rally to change gun laws\n                            \n\n                                Jimmy Kimmel makes tearful plea to Donald Trump for gun control\n                            \n\n                                Column: Get the numbers right on school shootings\n                            \n\n                                Florida Shooting Survivors Protest NRA\n                            \n\n                                Fla. Senator demands action after mass shooting\n                            \n\n                                Florida students protest against gun violence\n                            \n\n                                Fla. Gov. Rick Scott vows to keep mentally ill from guns\n                            \n\n                                Why AR-15-style rifles are so common in mass shootings\n                            \n\n                                Florida school shooting fuels calls for #GunReformNow\n                            \n\n\n\n\n \n \nRead or Share this story: https://usat.ly/2I9gbGm", "The Hill": "Attorney General Jeff Sessions Jefferson (Jeff) Beauregard SessionsUnder pressure, Trump shifts blame for Russia intrusion Overnight Tech: Judge blocks AT&T request for DOJ communications | Facebook VP apologizes for tweets about Mueller probe | Tech wants Treasury to fight EU tax proposal Overnight Regulation: Trump to take steps to ban bump stocks | Trump eases rules on insurance sold outside of ObamaCare | FCC to officially rescind net neutrality Thursday | Obama EPA chief: Reg rollback won't stand MORE on Monday called on U.S. attorneys to strictly enforce a law that criminalizes lying on background checks.\n\nSessions directed federal prosecutors to “swiftly and aggressively” prosecuted cases involving individuals who are barred from obtaining a firearm, and who fail to tell the truth on a government form needed to pass a background check, according to The Washington Post.\n\nJustice Department officials told the publication that while lying on a background check is considered a felony, the law often goes unprosecuted.\n\nThe department also said it will up law enforcement presence at schools, and review how agencies respond to outside tips.\n\n“No child should have to fear going to school or walking the streets of their neighborhood,” Sessions said in a statement, according to The Post.\n\nThe Trump administration on Sunday released various school safety and gun restrictions as a response to the shooting at Marjorie Stoneman Douglas High School in Parkland, Fla. that left seventeen people dead last month.\n\nThe White House said it would launch a federal commission to assess how to best address gun violence in schools and provide assistance to states to arm teachers.\n\nThe commission will be headed by Education Secretary Betsy DeVos Elizabeth (Betsy) Dee DeVosAmerican women will decide who wins and loses in 2018 elections Trump, Pence to address CPAC this week House Dems call for first Education Committee hearing on school shootings since Sandy Hook MORE and will involve federal, local and school officials.\n\nThe administration also said it would push states to pass legislation aimed at keeping guns away from dangerous individuals and encourage Congress to pass measures strengthening the national background check system."}