US President Donald Trump says that, in addition to tightening background checks on the sale of a firearm, his administration is going to look into giving teachers with the right training the right to to carry a weapon at school. He also plans to increase security measures in schools, including the number of security guards.

Donald Trump made the remarks during a meeting at the White House with survivors of the shooting at Marjory Stoneman Douglas High School in Parkland.
Surrounded by students and parents, as well as the Mayor of Parkland and education stakeholders, the President listened silently to everyone, from their testimonies to their suggestions to prevent a tragic event like this does not happen again.
Mr. Trump then shared his ideas to solve the problem, then asking the audience what she thought.
The president said he wanted to make the legislation more stringent with respect to the age at which a weapon can be purchased. He also reiterated that the history of mental health problems would be better scrutinized. Trump also said he wants to tackle the lack of psychiatric hospitals, many of which have closed in recent years.
In addition, Donald Trump thinks that during a shooting in a school, rather than waiting for the intervention of relief that takes several minutes to arrive, it would be better to have armed teachers, so "to quickly put an end to an attack ".
According to him, a killer will not show up in a school if he knows that he is well guarded. Mr. Trump takes up the idea of ​​the National Rifle Association (NRA), a powerful American gun lobby, which, after the Newtown killings in 2012 in which 20 children and 6 adults died, had called for armed agents in each school.

He also criticized the concept of "sanctuary schools" where no weapon is tolerated, believing that such sites played a role of magnet for the "maniacs".
Some speakers present agreed with some of the Chair's suggestions. All urged the president to act.
Many young people demonstrate, signs in hand.
Therese Gachnauer, center, and Kwane Gatlin, right, joined Marjory Stoneman Douglas High School students in calling for tougher firearms laws. The 18-year-old is attending Chiles High School and the 19-year-old Lincoln High School. Photo: Associated Press / Mark Wallheiser
Demonstration in front of the State Capitol of Florida
Earlier Wednesday, hundreds of young people at Marjory Stoneman Douglas High School stormed the Florida State Capitol in Tallahassee as part of a crusade to toughen laws on fire arms.
Inside and outside the Florida State Capitol, several of these teenagers spoke in turn to tell their traumatic experience and plead their case.
The ideas they defend are multiple: ban or restrict access to AR-15 semi-automatic weapons used in this killing and in several others, increase the minimum age to buy weapons, etc.


For others, we feel that the goal would be to prohibit weapons military style "he has on the show 24/60 on RDI.
Mr. Marien believes that the movement could play the role of a counter-power to the NRA. But there is a lot of work to do before you can stand up to the powerful lobby.
"One of the most important factors in the power of the NRA is the lack of focused opposition from those in favor of tightening gun control. These people do not vote in that direction. They do not organize themselves. So if they start voting and getting organized to put pressure on the political actors, it could start a movement. But it would have to be bigger and longer. We are not there yet, "he said.
The governor of Florida, Rick Scott.
The governor of Florida, Rick Scott. Photo: The Associated Press / Gerald Herbert
Florida, republican castle
The governorship and the two chambers of the State Capitol of Florida have been controlled since 1999 by the Republican Party, which historically opposes a tightening of laws governing the possession of weapons.
On Tuesday, the Democratic minority of the state tried to pass a law banning the sale of semi-automatic weapons and high-capacity magazines, to no avail; the Republicans rejected it.
In 2011, Florida's current governor, Rick Scott, passed legislation banning towns and counties from passing regulations governing the sale of firearms and ammunition.
After the killing, Governor Scott created three committees dealing with school safety, mental health issues, and gun safety. He did not mention the possibility of banning one weapon or another.

We are not going to be the school where there was a shooting. We are going to be the school where there was a shootout and that made things happen. A change must occur.
    Rachel Catania, 15 years old
Robert O'Brien, a member of the Teens for Gun Reform group, participated two days ago in a "lie-in" in front of the White House: people went to bed for three minutes, the duration of the Parkland shootout, in order to claim better gun control.
Aged 17, he is delighted to see what his peers did today at the Florida Capitol in Tallahassee. He says he is optimistic for the future.
"I really believe that now people are finding their voices. This is one of the first events where school people made their voices heard across the country. It resonates deeply, at convention, across the country, and with the president: these things affect real people, "he said in an interview with RDI on 24/60.
Mr. O'Brien promises to continue to fight to restrict access to firearms. And that begins, according to him, to take a stand in the public square.
    I think we can really make a difference and inspire other young people to know that they have voices, that they can share their opinions and that we can make a difference.


Robert O'Brien, member of Teens for Gun Reform Group
Among other things, he asks that semi-automatic firearms like the AR-15 be banned.
"There is no reason to have one. People say it's good for sports, for competitive shooting, for hunting, but what you have to consider, ultimately, is if that gun is more important than children's lives , young people? It's a military style weapon, it's not necessary to have that in the society where people can take advantage and commit these horrible acts, "he said.
Protesters went to the White House on Monday to demand better gun control.
Protesters went to the White House on Monday to demand better gun control. Photo: The Associated Press / Evan Vucci
An opposition
Daniel Marien, professor of American politics at the University of Central Florida, sees this popular movement as a very emotional reaction of Americans. According to him, this movement risks running up against the ideas defended by the NRA.
"In the coming days we will be witnessing a competition between political actors - including Mr Trump - to define the policies or goals of this movement. For Mr. Trump, it will be to reinforce security in schools by arming educators and probably by putting metal detectors. This is exactly the solution of the NRA.
