{"The Washington Post": {"body": "Once again, President Trump underscored the vast difference between Trump the person and Trump the administration when it comes to his stance on divisive issues. And that's why, in hindsight, Democrats should have seen that Trump would not support any of their gun-control proposals.\n Where Trump's White House ended up on how to respond to school shootings is a world away from where he started. On Sunday, the White House released its proposal, which focuses on arming teachers, and doesn't mention raising the age limit for assault rifle purchases, which Trump supports.\n That's just the latest contradiction from the president on guns. He started out as one of the most pro-gun and pro-National Rifle Association presidents in modern history. After the massacre at a high school in Parkland, Fla., last month, he lent his support to a dizzying array of proposals from both sides. He:\n  Tweeted his support for “strengthening background checks” Called the leaders of the NRA “Great People and Great American Patriots” Took language right from the NRA to support “hardening” schools by arming teachers Promised to ban bump stocks Talked about raising the age to buy assault weapons from 18 to 21 Praised a new Florida gun-control law that does just that Appeared to support Democrats' proposals for banning assault weapons Snubbed the idea of federal commissions a day before his White House announced its own commission on school violence  The White House ended up far to the right of most of these proposals. Its idea to arm teachers is so controversial that most Republicans in Congress don't support it.\n We saw a similar unraveling of compromise play out in a January immigration debate. And a pattern is starting to emerge on how to read Trump's wild spins on divisive issues: When it comes time for the White House to put its own ideas in writing, he'll land to the right of most of the rest of Washington, no matter how he seemed to be at the center or left just a few days ago.\n When the cameras were invited to a White House meeting with Trump and bipartisan lawmakers a few weeks ago, Trump seemed so open to gun-control proposals that he accused one of the most pro gun-control Republicans in the Senate, Patrick J. Toomey, of being afraid of the NRA because Toomey's universal background check bill from 2013 also didn't raise the age limit for buying assault rifles.\n  Then, Trump made one of the most pro gun-control Democrats in the Senate, Dianne Feinstein, positively giddy with the suggestion Congress should ban assault weapons.\n  Actually, almost all Senate Democrats were thrilled after that meeting. They launched a news conference the very next day on Capitol Hill to unveil their gun-control wish list, hoping to build on the momentum the president had just given them.\n “I am sure many of you in this room and many Americans around the country watched the president's meeting on gun violence yesterday,” said Senate Minority Leader Charles E. Schumer (D-N.Y.), “and were rather stunned and surprised. Many of us pleasantly.”\n But whatever support Democrats think they had from the president has fizzled. Trump ignored their outstretched hand on universal background checks, and started talking more about arming teachers. Less than two weeks after that meeting, his White House formalized his drift back to the right. They announced Sunday night they would help train schoolteachers to carry guns, a proposal plucked straight from the NRA, and they'd endorse a Republican-led bill that reinforces the background check system but doesn't expand it.\n [ What will Congress realistically do on guns after the Florida shooting? ]\n Pretty much the same pattern played out a few months ago when Congress was trying to come up with an immigration deal to protect “dreamers” from deportation. Democrats thought they had a deal only to watch Trump renege. Trump ultimately put forward an immigration proposal to drastically change the legal immigration system that is so conservative most Republicans in Congress won't support it.\n There are two possibilities here about what's leading Trump to perform so many 360s on divisive issues, and they aren't mutually exclusive:\n  Trump doesn't know what he wants, and he's also not very familiar with the issues. That leads him to either mistakenly support more liberal solutions, or honestly support them without understanding the politics behind it. In an open-camera meeting with lawmakers on immigration in January, Trump appeared to agree with Democrats on a bill just to legalize dreamers without anything in exchange. House Majority Whip Kevin McCarthy (R-Calif.) had to interject to correct the president that's actually the opposite of what Trump wants to do. The president seemed genuinely confused:\n “Mr. President, you need to be clear, though,” McCarthy said. “I think what Senator Feinstein is asking there — when we talk about just DACA, we don’t want to be back here two years later. You have to have security.” Trump responded: “I think that’s what she’s saying.” “No, I think she’s saying something different,” McCarthy said. (She was.)\n Trump agrees with the last person who talked to him. And that's usually his staff, who have much more access to him than Democrats in Congress. That's people like Stephen Miller, a Trump loyalist who even some Republicans in Congress say is too extreme to deal with. “He's been an outlier for years,” Sen. Lindsey O. Graham (R-S.C.) said during the immigration debate of Miller, pointing the finger squarely at Miller for scuttling a bipartisan deal on dreamers, a deal Trump seemed open to just days earlier.  Whatever the reason for Trump's hard-right turns on immigration and guns, it underscores what Democrats most fear about negotiating with the president: That no matter what bipartisan compromises president seems to support when they're across the table from him, he'll fall back to his most conservative positions.", "link": "https://www.washingtonpost.com/news/the-fix/wp/2018/03/12/in-hindsight-democrats-should-have-seen-trumps-360-on-gun-control-coming/", "logo": null, "left_right_score": 0.1544099276204683, "bias": 2, "facebook_likes": 642, "title": "Analysis | In hindsight, Democrats should have seen Trump’s 360 on gun control coming", "source": "The Washington Post"}, "The Guardian": {"body": "Organizers believe up to 500,000 people could travel to Washington DC on 24 March to demand action on gun control.\n\nMarch for Our Lives, organized by the new #NeverAgain movement – founded by survivors of the Florida school shooting – has applied for a permit for half a million people in the capital, the Washington Post reported on Friday.\n\nSeventeen people – 14 students and three teachers – were killed in the shooting at the school. About 100 students attended a rally at the Florida state capitol in Tallahassee on Wednesday.\n\nThe Washington march will be supported by more than 50 ‘sister marches’ in cities across the US. So far 85,000 people have expressed interest in the DC event – and more than 40,000 in New York City.\n\nSofie Whitney, one of the three founders of the #NeverAgain movement that on Sunday announced the march, said the students were simply seeking “commonsense” solutions to gun control.\n\n“We don’t need a full bill to be written overnight but we need some action, we need them to begin helping us make the change,” Whitney, a senior at Marjory Stoneman Douglas high school, told the Guardian this week.\n\n. The new activists from Stoneman Douglas who have spoken out broadly want a ban on assault weapons such as the one used in the attack, and fiercely oppose Donald Trump’s proposal to arm teachers. A mission statement on the March for Our Lives website sets out exactly why the mass rallies are necessary:\n\nSchool safety is not a political issue. There cannot be two sides to doing everything in our power to ensure the lives and futures of children who are at risk of dying when they should be learning, playing, and growing. The mission and focus of March For Our Lives is to demand that a comprehensive and effective bill be immediately brought before Congress to address these gun issues. No special interest group, no political agenda is more critical than timely passage of legislation to effectively address the gun violence issues that are rampant in our country.\n\nMarch for Our Lives has raised more than $2m as of Friday. The group have compiled a list of all the demonstrations here.", "link": "https://www.theguardian.com/us-news/2018/feb/24/the-resistance-now-march-washington-gun-solutions", "logo": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "left_right_score": 0.10090139826835952, "bias": 2, "facebook_likes": 108, "title": "Hopes for half a million to march for 'commonsense' gun solutions", "source": "The Guardian"}, "Salon": {"body": "I recently got a call from a political analyst in Washington. “Trump is dropping like a stone,” he said, convincingly. “After Election Day, he’s history.”\n\nI think Trump will lose the election, but I doubt he’ll be “history.”\n\nDefeated presidential candidates typically disappear from public view. Think Mitt Romney or Michael Dukakis.\n\nBut Donald Trump won’t disappear. Trump needs attention the way normal people need food.\n\nFor starters, he’ll dispute the election results. He’s already warned followers “we better be careful because that election is going to be rigged and I hope the Republicans are watching closely, or it’s going to be taken away from us.“\n\nHis first campaign ad, released last week, features an image of a polling site with the word “rigged” flashing onscreen less than two seconds after the spot begins.\n\nTrump won’t have any legal grounds to stand on — this election won’t be a nail-biter like 2000 — but his goal won’t be to win in court. It will be to sow enough doubt about the legitimacy of Hillary Clinton’s election that he can continue to feed paranoia on the right.\n\nA recent Pew Research Center survey shows even now, 51 percent of Trump’s supporters have little or no confidence in the accuracy of the vote count nationally. That’s a big change from supporters of the defeated Republican nominees in 2004 and 2008.\n\nReportedly, Trump is also considering launching his own media network. He’s already hired two of the nation’s most infamous right-wing fight promoters — Roger Ailes, the founder and former CEO of Fox News, and Stephen Bannon, the pugilistic former head of Breitbart News — who’d take to such an enterprise like alligators to mud.\n\nAccording to one source, Trump’s rationale is that, “win or lose, we are onto something here. We’ve triggered a base of the population that hasn’t had a voice in a long time.”\n\nTriggered indeed. Many of them angry and bigoted before his campaign, Trump supporters have only become more so under his tutelage.\n\nThe poison has even seeped down to America’s children. A Southern Poverty Law Center survey of 2,000 school teachers recently found Trump’s campaign producing an “alarming level of fear and anxiety among children of color” and inflaming racial and ethnic tensions in the classroom. “Teachers have noted an increase in bullying, harassment and intimidation of students whose races, religions or nationalities have been the verbal targets … on the campaign trail.”\n\nMost likely to remain after Trump are the economic anxieties Trump exploited. Globalization and technological displacement will continue to rip away the underpinnings of the bottom half of the population, creating fodder for another demagogue. The real problem isn’t globalization or technological change per se. It’s that America’s moneyed interests won’t finance policies necessary to reverse their consequences — such as a first-class education for all the nation’s young, wage subsidies that bring all workers up to a livable income, a massive “green” jobs program, and a universal basic income. Hillary Clinton hasn’t proposed anything remotely on this scale, and House Republicans (who will almost certainly remain in power) wouldn’t go along anyway. After Trump, our politics seems likely remain as polarized as before — but divided less between traditional right and left than between establishment and anti-establishment. Trump will leave the GOP sharply split between its corporate donor class and its working class. Clinton will preside over a party divided only somewhat less dramatically between its own donor class and an increasingly vocal progressive base. Which raises an intriguing, if unlikely, scenario. What if Trump’s authoritarian populists join with progressive populists to form an anti-establishment third party dedicated to getting big money out of American politics? The combination could prove an invincible force for wresting back the economy and democracy from the moneyed interests. It’s not impossible. This has been the strangest election year in modern history, partly because such a large swath of Americans — Republicans, Democrats and Independents — have concluded the system is rigged in favor of the privileged and powerful. Trumpism will continue after Trump loses. The open question is whether anything good can be salvaged from its wreckage.", "link": "http://www.salon.com/2016/08/29/robert-reich-trumpism-will-continue-after-trump-loses-but-can-any-good-come-out-of-the-wreckage_partner/", "logo": null, "left_right_score": 0.3530279186388589, "bias": 1, "facebook_likes": 194, "title": "Robert Reich: Trumpism will continue after Trump loses, but can any good come out of the wreckage?", "source": "Salon"}, "CBS News": {"body": "Arkansas Republican Gov. Asa Hutchinson says the prevention of mass shootings like the one in Parkland, Florida, should be the responsibility of states and localities instead of the federal government. Hutchinson told CBS News' \"Face the Nation\" on Sunday that  protecting the nation's schools falls under the domain of the states.\n\n\"This is uniquely the role of the states in determining safety. The role of the federal government, obviously, can spur the issues in terms of grant funding and hopefully that will be available to us. But largely the security side and the safety side will be the governors,\" said Hutchinson.\n\nHutchinson said in more rural parts of his state, enhanced training programs to respond to an active shooter situation have helped schools prepare for the worst.\n\nAfter the Sandy Hook Elementary School shooting in 2012, Hutchinson spearheaded an effort by the National Rifle Association (NRA) to provide armed security at every school in the country, dubbed the National School Shield Emergency Response Program. That proposal closely mirrors President Trump's continued calls to arm teachers in an effort to prevent further mass shootings.\n\nMr. Trump suggested during the administration's most recent White House listening session with state and local officials that teachers who were trained in being \"adept at guns\" could receive a bonus for their training efforts.\n\n\"We have to harden our schools, not soften them up. A gun-free zone to a killer or somebody that wants to be a killer, that's like going in for the ice cream. Like here I am -- take me,\" Mr. Trump said. \"Shooters won't walk into a school if 20 percent of people have guns.\"\n\nHutchinson, however, said there needs to be \"flexibility\" when it comes to addressing the issue of arming teachers in schools.\n\n\"Let me emphasize, there has to be some flexibility here. I've always said that teachers should teach and others should protect,\" said Hutchinson.\n\n\"There are some teachers who, whenever they're looking at options and they've got the training and they've got the temperament and they've, they've done what's necessary,\" he added. \"And if they want to be able to have a protection and be armed with that training I think that's a prerogative that they should have as well.\"", "link": "http://feeds.cbsnews.com/~r/CBSNewsPolitics/~3/oKE1Jstzn_o/", "logo": "http://wwwimage.cbsnews.com/common/images/v2/logo_cbsnews_small.gif", "left_right_score": 0.1981039323527992, "bias": 2, "facebook_likes": 0, "title": "Gov. Asa Hutchinson says response to mass shootings should fall to states", "source": "CBS News"}, "Wall Street Journal": {"body": "President Trump called Venezuela's government a \"corrupt regime\" that has inflicted \"pain and suffering\" on its people. Mr. Trump also said took aim at socialism, saying it leads to failed states. Photo: AP", "link": "http://www.wsj.com/video/trump-blasts-venezuela-regime-socialism/129910D3-D961-4351-9CDB-250828BDFF41.html", "logo": "http://online.wsj.com/img/myYahooWSJlogo.gif", "left_right_score": 0.2640618140914465, "bias": 3, "facebook_likes": 137, "title": "Trump Blasts Venezuela Regime, Socialism", "source": "Wall Street Journal"}, "USA Today": {"body": "US President Donald J. Trump addresses the 45th annual Conservative Political Action Conference (CPAC) at the Gaylord National Resort  Convention Center in National Harbor, Maryland, USA, 23 February 2018. The President spoke about the Stoneman Douglas High School shooting that killed 17 high school students.(Photo: JIM LO SCALZO, EPA-EFE)\n\n\nWASHINGTON – President Trump argued before a group of political supporters Friday that arming some teachers will make the nation's schools \"a much harder target\" for would-be attackers, offering a staunch defense of an idea opposed by law enforcement and education groups.\n\"When we declare our schools to be gun-free zones, it just puts our students in far more danger,\" Trump told the Conservative Political Action Conference. \nMinutes after slamming the Florida sheriff's deputy who failed to stop last week's mass shooting at Parkland, Fla., as either a \"coward\" or someone who froze under extreme pressure, Trump insisted that teachers who actually know the students would do a better job defending them. \n\"A teacher would've shot the hell out of him,\" Trump said of the shooter Nikolas Cruz, who killed 17 people and wounded 15 others at Marjory Stoneman Douglas high school. \nMore: Trump calls deputy who failed to stop Parkland school shooting a 'coward'\nSince holding an emotional listening session at the White House on Wednesday with students and parents affected by gun violence, Trump has called for \"well-trained\" and \"gun-adept\" teachers and coaches to be able to carry concealed firearms at schools.\nThe gun issue dominated a rambling, wide-ranging speech in which Trump also announced new sanctions on nuclear-armed North Korea, praised the late Rev. Billy Graham, extolled the tax cuts that passed last year, urged Republicans to vote in this year's congressional elections, and again called for construction of an anti-migration wall on the U.S.-Mexico border.\n\"Don't worry, you're getting the wall,\" he told the Trump-friendly crowd at the annual CPAC meeting near Washington. Delegates whooped and chanted, \"Build that wall! Build that wall!\"\nMore: Trump doubles down on arming some teachers to prevent school shootings\nMore: Trump administration to announce new sanctions on North Korea\nLaw enforcement and teachers groups have criticized Trump's plan to arm teachers, saying it would be ineffective and could lead to accidental shootings.\n\"We need solutions that will keep guns out of the hands of those who want to use them to massacre innocent children and educators,\" said Lily Eskelsen García, president of the National Education Association. \"Arming teachers does nothing to prevent that.\"\nSen. Charles Schumer, D-N.Y., said Trump is following the National Rifle Association playbook in advocating armed teachers.\n“Not surprised the NRA reeled President Trump back in,\" Schumer said. \"Just amazed at how fast it happened.”\nDuring his calls to arm teachers, Trump also praised students who survived last week's shooting in Parkland, saying \"our whole nation was moved by their strength.\"\nIn recent days, Trump has endorsed modest gun control measures, including expanded background checks and increasing the age of purchase of semi-automatic weapons to 21 – but he did not expand on these ideas at CPAC, where delegates oppose gun control measures as infringements on Second Amendment gun rights.\nIn urging delegates to support Republican candidates in the November congressional elections, Trump claimed to the pro-gun crowd that Democrats would end Second Amendment rights if they win control of Congress.\nAt one point, Trump said he wanted to go \"off script\" because his prepared speech was \"boring.\" His riffs, ranging from attacks on the Barack Obama administration to his criticism of the Iranian nuclear agreement, echoed those of his 2016 presidential campaign.\nTrump's overall presentation drew catcalls from his critics.\n\"This speech at CPAC is demagogic, vapid, intellectually dishonest and just plain old fashioned idiotic,\" tweeted Republican consultant Steve Schmidt. \"If someone delivered this speech from the end of a bar most people would think that person was an imbecile.\"\nRead or Share this story: https://usat.ly/2GHjXFz", "link": "http://rssfeeds.usatoday.com/~/528169277/0/usatodaycomwashington-topstories~aposA-teacher-would-have-shot-the-hell-out-of-himapos-Trump-cites-Parkland-shooting-as-reason-to-arm-teachers/", "logo": "http://www.gannett-cdn.com/sites/usatnetwork/images/RSS_Syndication_Logo-USATN.png", "left_right_score": 0.37341125830626537, "bias": 3, "facebook_likes": 0, "title": "'A teacher would have shot the hell out of him': Trump cites Parkland shooting as reason to arm teachers", "source": "USA Today"}, "Townhall": {"body": "Do conservatives -- or non-leftists, for that matter -- appreciate just how terrific Donald Trump has been as president? And how lucky we are that he won the presidency?I don't know the answer. What I do know is that they ought to be deeply appreciative of him, and deeply grateful for luck or providence, and certainly for Trump himself, that he was elected president. First, it is unlikely that any other Republican would have defeated Hillary Clinton. Second, he has not only surpassed many of our expectations but also thus far governed in a manner more consistent with conservative principles than any president since Ronald Reagan, and arguably Calvin Coolidge.I say this as one who vigorously opposed him during the Republican contest for the nomination. I said from the beginning, in print and on my radio show, that I would support Trump if he became the nominee, but I dreaded his becoming the nominee. His comments about the size of his hands, Sen. John McCain as a prisoner of war and former President George W. Bush lying about weapons of mass destruction in Iraq; his lack of any history as a conservative; and the seeming absence of a filter between his brain and his Twitter app made it difficult for me to imagine him as a serious president of the United States.Nevertheless, once he was nominated, I just as vigorously supported him on the simple and -- I still believe -- unanswerable grounds that while no one could be certain how Trump would govern, we were all certain about how Hillary Clinton would govern -- as a leftist. And I truly believed that another four years of left-wing rule would mean the end of America as it was founded to be.That is why I found the arguments of the conservatives who were Never-Trumpers, many of whom I work with, admire and count as friends, not just unpersuasive but incomprehensible. That a conservative could prefer Clinton -- which was the only upshot of a Never Trump position -- to any Republican could only mean that we have an entirely different understanding of the damage the left has done and would have done to America and the Western world if Clinton had won.I remember Never-Trumpers calling my radio show and asking me how I could possibly believe that, if elected president, Trump would honor his commitment to nominate to the Supreme Court one of the conservatives on the list of judges from which he promised to choose. He has honored that promise. And given the supreme importance of the Supreme Court, isn't that reason enough for conservatives to celebrate his presidency?He has repealed many of President Obama's energy regulations that would have strangled the American economy. He doesn't believe that carbon-induced warming of the planet will destroy the human race -- the greatest of the innumerable hysterias the left manufactures and then believes in. Isn't that reason enough for conservatives to celebrate his presidency?He has appointed a woman who, as a billionaire, could have easily devoted her life to enjoying her wealth but instead has fought for American students and their parents to be able choose their schools just as the wealthy do. And he has taken on the teachers unions, the only group that has ever given American teachers a bad name. Isn't that reason enough for conservatives to celebrate his presidency?He has appointed as ambassador to the United Nations a woman who is calling the U.N. the naked emperor that it is. And now, America is backing, rather than subverting, Israel in that benighted institution.Isn't that reason enough for conservatives to celebrate his presidency?By building a wall along our southern border, he is reasserting the belief that America actually has borders. Isn't that reason enough for conservatives to celebrate his presidency?And then there is tax reduction and simplification so that private citizens can keep more of their money and corporations can be far more productive.Isn't that reason enough for conservatives to celebrate his presidency?And now, he has vowed, after decades of American obsequiousness, to confront the sociopathic North Korean regime.The American media -- most particularly, its elite -- no longer even feigns objective reporting. It is solely an arm of the left and the Democratic Party, its task being the delegitimization of the Trump presidency.If you live among liberals, it is not chic to express support for President Trump. But it is time more of us did. If people abandon you because you support this president, they weren't serious friends to begin with. And, sorry to say, they aren't worthy of you. Somehow, you have been able to look beyond their support for the America- and West-destroying left. But they can't look beyond your support for the first conservative president in a generation -- and the gutsiest perhaps ever.If the president's approval rating really is in the 30s, this makes overt support for him all the more imperative. Whether you like his tweets or not, his fate is our fate.", "link": "http://townhall.com/columnists/dennisprager/2017/04/04/its-time-for-conservatives-to-celebrate-this-president-n2308280", "logo": null, "left_right_score": 0.9535619890315651, "bias": 5, "facebook_likes": 2534, "title": "It's Time for Conservatives to Celebrate This President", "source": "Townhall"}, "Vox": {"body": "President Trump repeatedly promised on the campaign trail that he would pick a “pro-life” Supreme Court justice.\nTrump nominated Neil Gorsuch as his Supreme Court nominee on Tuesday night. Gorsuch is, without a doubt, a respected conservative jurist. But when it comes to abortion rights, specifically, Gorsuch’s record is minimal. He’s never ruled on a case hinging on the constitutionality of abortion restriction. So the best way to look at his views is to look at how he’s thought about birth control and about assisted suicide. Together, it appears he is more likely pro-life than pro-choice. \nGorsuch wrote that the birth control coverage mandate under the Affordable Care Act forces employers to “underwrite payments for drugs or devices that can have the effect of destroying a fertilized human egg.” That argument, which is unsupported by medical research, is often made by anti-abortion rights advocates to explain why they oppose birth control methods like IUDs and emergency contraception. \nSeparately, Gorsuch wrote a book, The Future of Assisted Suicide and Euthanasia, which argued against the legalization of assisted suicide because human life is “intrinsically valuable.” Arguing against assisted suicide is not the same as arguing against abortion access, but the language he uses is similar to that used by anti-abortion activists.       \n\nTogether, these writings suggest he’ll be the conservative justice Trump promises. But as perennial swing justice Anthony Kennedy has taught us, opposing abortion personally doesn’t necessarily mean you’ll vote to curtail legal abortion rights. Plus, he replaces Antonin Scalia, a fellow conservative, so Gorsuch doesn’t change the balance of the court. \nPro-choice groups are already suspicious \n“Gorsuch represents an existential threat to legal abortion in the United States and must never wear the robes of a Supreme Court justice,” NARAL Pro-Choice America president Ilyse Hogue said in a statement Tuesday. \nHogue added that Trump’s decision to “speed up” the announcement should not “distract from the hundreds of thousands of Americans demonstrating” against his anti-immigration executive order.      \n\nVicki Saporta, president and CEO of the National Network of Abortion Funds, called Judge Gorsuch “a far-right jurist who would overturn basic and well-established principles of American law.”\nClarke Forsythe, acting president of Americans United for Life (which describes itself as “the legal arm of the pro-life movement”) said Gorsuch’s nomination shows that Trump “values the legacy of the late Justice Antonin Scalia, and is dedicated to ensuring that the Supreme Court is staffed by jurists who respect the Constitution, not by politicians who vote with their policy preferences.”\nGorsuch has said things that would raise pro-choice alarm bells about the Affordable Care Act’s birth control benefit, and how broad the religious exemptions to that benefit should be in infamous cases like Hobby Lobby.", "link": "http://www.vox.com/identities/2017/1/31/14461468/neil-gorsuch-supreme-court-trump-nominee-abortion", "logo": null, "left_right_score": 0.7741475446300728, "bias": 2, "facebook_likes": 807, "title": "Neil Gorsuch's light record on abortion still has pro-choice groups worried", "source": "Vox"}, "The Blaze": {"body": "Conservative commentator Katie Pavlich hit Piers Morgan with a massive reality check Friday after the liberal commentator alleged his theory about the “good guy with a gun” was proved correct in the tragic Florida shooting.\n\nWhat happened?\nThe gun debate has raged on since the tragic shooting on Feb. 14. Many Americans, including outspoken students nationwide, have placed blame for the tragedy on guns. They say legislators need to enact more firearm regulations. Meanwhile, Second Amendment advocates say guns aren’t the problem, while others argue putting concealed weapons in the hands of responsible, highly trained teachers will thwart the next mass shooting.\n\nBut with news that the Marjory Stoneman Douglas school resource officer — and three other Broward County sheriff deputies — failed to engage the shooter and only took cover outside, Morgan said his theory that “good guys with guns” don’t actually stop an active shooter. \n\nSo FOUR 'good guys with a gun' were not able to stop the bad guy.\nI think this kinda ends the 'arm the teachers' bullsh*t, don't you? https://t.co/hVHtw7negn\n\n— Piers Morgan (@piersmorgan) February 23, 2018\n\n\nIndeed, in the wake of the news that there were a number of armed police officers outside the school who failed to act, many have claimed that proves gun control is needed to prevent the next shooting — not more guns and especially not more guns on school campuses.\n\nBut others have noted the countless mistakes made by law enforcement in the months leading up to the shooting. They argue the fact that law enforcement seemingly botched thwarting the attack proves Americans should not entrust the government with their protection.\n\nHow did Pavlich respond?\nShe made that exact point in response to Morgan.\n\n“[Actually it] proves the opposite. The deputies aren’t required by law to engage or protect individuals from harm and just proved government won’t always protect your life. When evil comes to your door, you are the last defense, especially in the classroom,” she explained.\n\nActual proves the opposite. The deputies aren’t required by law to engage or protect individuals from harm and just proved government won’t always protect your life. When evil comes to your door, you are the last defense, especially in the classroom. https://t.co/srHusvODek\n\n— Katie Pavlich (@KatiePavlich) February 23, 2018", "link": "https://www.theblaze.com/news/2018/02/24/piers-morgan-says-florida-shooting-ends-arm-teachers-bullst-then-katie-pavlich-hits-back-hard/", "logo": null, "left_right_score": 0.9753290682328785, "bias": 5, "facebook_likes": 2101, "title": "Piers Morgan says Florida shooting ‘ends arm teachers bulls**t’ — then Katie Pavlich hits back hard", "source": "The Blaze"}, "Associated Press": {"body": "WASHINGTON (AP) -- The Latest on President Donald Trump and the prime minister of Thailand (all times local):\n\nPresident Donald Trump says it is a great honor to welcome Thai Prime Minister Prayuth Chan-ocha to the White House.\n\nTrump says the U.S. has a long and storied history with Thailand as the two meet in the Oval office.\n\nHe says the two countries have a very strong relationship, especially when it comes to trade, that is only getting stronger.\n\nChan-ocha is offering his condolence to the victims of the mass shooting attack in Las Vegas as well as those in Puerto Rica devastated by Hurricane Maria.\n\nThe visit is a rare instance of a military ruler being honored in Washington before even a nominal return to civilian rule and has outraged human rights groups. The prime minister seized power in a military coup three years ago.\n\nPresident Donald Trump is welcoming Thailand's junta leader to the White House.\n\nTrump and first lady Melania Trump greeted Prime Minister Prayuth Chan-ocha and his wife at the White House south portico Monday.\n\nThe visit was a rare instance of a military ruler being greeted in Washington before even a nominal return to civilian rule. It comes three years after the prime minister seized power in a military coup, and days after the elected leader whose government he ousted was sentenced in absentia to five years in prison.\n\nHuman rights groups are outraged, but it gives a shot in the arm to U.S. relations with its oldest ally in Asia. Thailand has moved more into China's orbit since Washington scaled back ties because of the military takeover.\n\nPresident Donald Trump hosts Thailand's junta leader at the White House on Monday. It's a rare instance of a military ruler being feted in Washington before even a nominal return to civilian rule.\n\nThe visit of Prime Minister Prayuth Chan-ocha (prah-YOOT chahn oh-CHAH) comes three years after he seized power in a military coup, and days after the elected leader whose government he ousted was sentenced in absentia to five years in prison.\n\nHuman rights groups are outraged, but it gives a shot in the arm to U.S. relations with its oldest ally in Asia, which has moved more into China's orbit since Washington scaled back ties because of the military takeover.", "link": "http://hosted.ap.org/dynamic/stories/U/US_UNITED_STATES_THAILAND_THE_LATEST_ASOL-?SITE=ALMON&SECTION=HOME&TEMPLATE=DEFAULT", "logo": null, "left_right_score": 0.05346045487190006, "bias": 3, "facebook_likes": 0, "title": "The Latest: Trump welcomes Thai junta leader to White House", "source": "Associated Press"}, "National Review": {"body": "The Trump administration has been exhaustingly eventful, but almost none of the events have involved Congress.\n\n\t\n\t\tThe beginning of Donald Trump’s presidency has been an extension of the past six years of the Obama administration, when Capitol Hill was largely a sideshow to the main event in the executive branch in general and the Oval Office in particular. Barack Obama and Donald Trump have almost nothing in common, except their modes of governance.\n\n\t\n\t\tObama was coolly cerebral and deliberative to a fault, whereas Trump is blustery, instinctual and impulsive. Yet, Obama and Trump are both, in their own ways, attention-hungry celebrities. Obama never demonstrated the patience or aptitude for real persuasion, whether LBJ-style arm-twisting or Reagan-style move-the-needle public argument. Neither has Trump. Institutionally, Obama was content to be a loner, and so is Trump. \n\n\t\n\t\tUntil further notice, this is the American model — government by and of the president. We live in the age of unilateral rule.", "link": "http://www.nationalreview.com/corner/448179/age-unilateral-rule", "logo": null, "left_right_score": 0.3152467310636867, "bias": 5, "facebook_likes": 15, "title": "‘The Age of Unilateral Rule’", "source": "National Review"}, "The Washington Times": {"body": "President Trump said Friday that gun-free school zones don’t protect students, as he renewed his call to arm more qualified teachers and other school employees.\n“When we declare our schools to be gun-free zones, it just puts our students in far more danger,” Mr. Trump said at the annual Conservative Political Action Conference. “Well-trained gun-adept teachers and coaches and people that work in those buildings who were in the Marines for 20 years … should be able to carry concealed firearms. It’s time to make our schools a much harder target for attackers.”\nHe said the U.S. needs to implement commonsense measures that will protect the rights of law-abiding Americans while helping to keep guns out of the hands of those who pose a danger to themselves and to others.\nMr. Trump said the families who lost loved ones at last week’s shooting at a high school in Parkland, Florida, have “suffered beyond anything I’ve ever witnessed.”\n“This was a sick person,” he said of accused gunman Nikolas Cruz. “We had a lot of warning about him being sick. This wasn’t a surprise. So what are we doing? We want to ensure when there are warning signs, we can act, and act quickly.”\nThe president also criticized the sheriff’s deputy who failed to stop the shooting, saying, “He was tested under fire and it was not a good result.”\nThe crowd at CPAC gave Mr. Trump an enthusiastic welcome, with cheers and standing ovations. He reminded the audience jokingly that before he became president, some questioned his conservative credentials.\n“I think now that we’ve proved I’m a conservative,” the president said.\nAt one point, talking about his achievements on border security, Mr. Trump reassured the crowd, “Don’t worry, you’re getting the wall.”  The cheering audience members chanted “Build that wall!”\nThe president also brought the crowd to its feet by paying tribute to the late Rev. Billy Graham, who died this week at age 99. He said Rev. Graham’s belief in the power of God’s word “changed the world.”\nNoting the upcoming midterm elections, Mr. Trump warned against consequences if Democrats have success in November.\n“They will take away those massive tax cuts and they will take away your Second Amendment,” he said.\nMr. Trump then took an informal poll of the crowd to see — if they had to choose — whether they would like to keep the Second Amendment or the tax cuts, with the crowd overwhelmingly choosing their gun rights.\n“I’m going to leave it at the Second Amendment,” he said.\nThere were some boos and jeers when Mr. Trump alluded to Sen. John McCain’s decisive “no” vote on one of the GOP’s attempts to repeal Obamacare last year.\n“Who was that? I don’t know,” he said. “I don’t want to be controversial, so I won’t use his name. What a mess.”\nThe Washington Times Comment PolicyThe Washington Times is switching its third-party commenting system from Disqus to Spot.IM. You will need to either create an account with Spot.im or if you wish to use your Disqus account look under the Conversation for the link \"Have a Disqus Account?\".  Please read our \nComment Policy before commenting.", "link": "http://www.washingtontimes.com/news/2018/feb/23/trump-pushes-arming-school-employees-speech-cpac/?utm_source=RSS_Feed&utm_medium=RSS", "logo": null, "left_right_score": 0.992533321727701, "bias": 5, "facebook_likes": 618, "title": "Trump pushes for arming school employees in speech at CPAC", "source": "The Washington Times"}, "NPR": {"body": "Turkish Leader Calls Trump His 'Dear Friend,' Despite Decision To Arm Syrian Kurds\n\nJudging by the public statements, U.S.-Turkey relations are going to be just fine.\n\nPresident Trump hosted Turkish President Recep Tayyip Erdogan Tuesday afternoon, and both men had warm messages to share even as the two countries clashed last week about a decision by the United States to arm Kurdish fighters in Syria.\n\nTrump spent much of his statement complimenting the Turkish military.\n\n\"Turkish courage in war is legendary,\" said Trump, mentioning Turkish contributions in the Korean War specifically. \"Today we face a new enemy in the fight against terrorism and again we seek to face this threat together.\"\n\nStill, the Turkish president made it clear the Trump administration's decision to arm one group of Syrian Kurds fighting the Islamic State, the YPG, would \"never be accepted.\"\n\nU.S. military officials have long argued in favor of supporting the Kurds in Syria against ISIS because they are such competent soldiers. The decision to arm them came last week, as preparation has continued for an offensive to retake what is effectively the capital of ISIS, the city of Raqqa in northern Syria. Military officials say the Syrian Kurds are key to that mission.\n\nErdogan's administration, however, considers the Syrian Kurds terrorists because of their ties to Turkish Kurds who have been waging an insurgency to create an independent state over the last three decades. The U.S. and the European Union agree with Turkey that the group of Kurds in Turkey known as the PKK are indeed terrorists, and the Trump administration has sought to ease Turkish worries that the weapons provided to Kurds in Syria would not end up in the hands of the Turkish Kurds.\n\nTrump said Tuesday that the U.S. would ensure the PKK has \"no safe quarter.\"\n\nNeither leader broached human rights in their statements, which will likely frustrate those worried about Trump getting too close to a leader inching toward autocratic rule.\n\nErdogan called Trump his \"dear friend\" and made a point to congratulate the U.S. president on his \"legendary triumph\" over Hillary Clinton in the 2016 presidential election. Trump said it was a \"great honor\" to host Erdogan.\n\nBack home, however, not all of Erdogan's countrymen were pleased.\n\n\"Turkey is under a state of emergency since (the failed coup), during which human rights have been trampled on,\" Sezgin Tanrikulu, a legislator from Turkey's main opposition Republican People's Party, told the AP before the meeting. \"The media and press freedoms have been placed under government control. Torture and ill-treatment have increased.\"\n\n\"Human rights and democracy are not part of Trump's agenda, but we hope that he abandons this stance,\" Tanrikulu said.\n\nTrump made news last month by phoning Erdogan to congratulate him on a referendum in Turkey that furthered Erdogan's power. It continued a trend of Trump's supporting strongmen, as Erdogan has been criticized for jailing the most journalists of any leader in the world, as well as tens of thousands of political dissidents.\n\nStrictures on information are also tightening. Just a few weeks ago, Turkish Web users found that they no longer had access to Wikipedia.\n\nThe two presidents' statements also didn't touch on another key Turkey-related issue: the extradition of cleric Fethullah Gulen. Erdogan blames last year's failed coup attempt on Gulen, a religious leader who now lives in Pennsylvania, and he has repeatedly called for Gulen to stand trial in Turkey.\n\nThe White House has not responded to a request for comment from NPR about Trump's stance on Gulen.\n\nAnd for all the talk of their great relationship, President Trump mispronounced Erdogan's name multiple times in his statement. The Turkish leader's name is pronounced \"AIR-doh-ahn\" but Trump repeatedly said \"Er-duh-GON.\"", "link": "http://www.npr.org/2017/05/16/528614863/turkish-leader-calls-trump-his-dear-friend-despite-decision-to-arm-syrian-kurds?utm_medium=RSS&utm_campaign=politics", "logo": "https://media.npr.org/images/podcasts/primary/npr_generic_image_300.jpg?s=200", "left_right_score": 0.2245469147691077, "bias": 3, "facebook_likes": 2124, "title": "Turkish Leader Calls Trump His 'Dear Friend,' Despite Decision To Arm Syrian Kurds", "source": "NPR"}, "CBN News": {"body": "Survivors from the high school massacre in Parkland, Florida, rallied today in Tallahassee, pushing for new gun control measures.\n\nIt's been one week since the deadly shooting rampage at their high school, and state and federal lawmakers are under pressure to take new action on guns.\n\nPresident Donald Trump is scheduled to meet with students and teachers at the White House.\n\nHundreds of people also showed up at the Minnesota state capitol this week for a rally held by Moms Demand Action for Gun Sense in America.\n\n\"We're mothers; we're fathers, parents, neighbors, and we're all ready for our lawmakers to take action to prevent the gun violence that is plaguing our countries,\" Erin Zamoff, a chapter representative said.\n\nIn Florida, survivors of the shooting massacre in Parkland traveled to their state capitol to push for new gun laws.\n\n\"This is not about Democrats; this is not about Republicans,\" one student said. \"This isn't Left or Right. This is a movement for humanity, for safety, for keeping our citizens alive.\"\n\n\"We're talking about gun safety; we're talking about school safety, and we're talking about mental health,\" said another.\n\nAs students traveled to Tallahassee by bus, Florida legislators voted not to consider a bill to ban assault rifles. One survivor was overcome with emotion while watching the vote.\n\nMeanwhile in Washington at a White House ceremony honoring the bravery of public safety officers, President Trump directed US Attorney General Jeff Sessions to ban bump stocks – devices used in the Las Vegas shooting rampage. Bump stocks make it easier to fire off more rounds faster, simulating an automatic weapon.\n\n\"I signed a memorandum directing the Attorney General to propose regulations to ban all devices that turn legal weapons into machine guns,\" the president said.\n\nCalifornia Democrat Sen. Dianne Feinstein responded by tweeting, \"Legislation is the only answer.\"\n\nThe president has also said he is open to improving federal background checks on gun purchases. In addition, the White House fielded questions regarding assault weapons.\n\n\"Does the president believe there should be an age limit for those who buy an AR-15?\" a reporter asked. \n\n      \n\n \"I think that's certainly something that's on the table for us to discuss,\" White House Press Secretary Sarah Huckabee Sanders responded.\n\n   \n\n Along with hosting students and teachers in a \"listening session,\" the president will meet with state and local leaders to discuss school safety Thursday.", "link": "http://www.cbn.com/api/urlredirect.aspx?u=http://www1.cbn.com/cbnnews/politics/2018/february/trump-considers-gun-control-measures-lawmakers-under-pressure-one-week-after-deadly-florida-school-shooting", "logo": null, "left_right_score": 0.9777025347465174, "bias": 5, "facebook_likes": 182, "title": "Trump Considers Gun Control Measures; Lawmakers Under Pressure One Week After Deadly Florida School Shooting", "source": "CBN News"}, "The Hill": {"body": "Sen. Chris Murphy Christopher (Chris) Scott MurphyGreen group backs Sens. Baldwin, Nelson for reelection Dems press Trump for 'Buy American' proposals in infrastructure plan Chuck Schumer’s deal with the devil MORE (D-Conn.) on Thursday rebutted Education Secretary Betsy DeVos Elizabeth (Betsy) Dee DeVosEPA to jumpstart 'war on lead' with strategy meeting Hundreds of teachers hold walkout, protest in West Virginia Why the coming midterms are so important MORE's suggestion to arm teachers in order to prevent future school shootings.\n\nDeVos said in an interview Thursday that states could consider training and arming teachers as a way to stop school shootings. She made the comment while discussing a shooting at a high school in Florida on Wednesday that left 17 people dead.\n\nAsked on ABC's \"This Week\" about his thoughts on DeVos's statement, Murphy said there is no evidence to support arming people for self-defense against gunmen.\n\n\"There's zero evidence, empirical or anecdotal, that more guns leads to less gun crime,\" Murphy said in an interview on ABC's \"This Week,\" following a Wednesday floor speech berating the Senate for inaction on gun control. \"In fact, if you have a gun in your house, you are more likely to be shot by that gun than you are to use it on a perpetrator.\"\n\nHost Martha Raddatz pointed out that the armed guard on the high school campus never got the chance to respond to the teen gunman.\n\n\"It's a wonderful story for the gun lobby to tell that if you just load up schools with weapons you'll be safer,\" Murphy continued. \"All of the evidence suggests that homes and communities that have more weapons have more gun crimes, not less.\"\n\nThe senator's comments come after his floor speech in response to the mass shooting, when he said such shootings are \"a consequence of our inaction” on guns, and a unique problem endemic to the U.S.\n\nMurphy is a prominent voice in the push for more gun control, and has introduced legislation that would expand background checks for possible gun purchasers.", "link": "http://thehill.com/blogs/blog-briefing-room/374155-murphy-responds-to-devos-on-arming-teachers-to-prevent-gun-violence", "logo": null, "left_right_score": 0.2742872627964933, "bias": 3, "facebook_likes": 4698, "title": "Murphy responds to DeVos on arming teachers to prevent gun violence", "source": "The Hill"}, "The New York Times": {"body": "“It’s a cult of personality,” said Mr. Sanford, who faces a primary challenge from a state legislator who charges that the congressman has been inadequately loyal to the president. “He’s fundamentally, at the core, about Donald Trump. He’s not about ideas. And ideas are what parties are supposedly based on.”\n\nSuch open divisions between a president and elected officials of the same party mark an extraordinary departure from modern political tradition. Even if they feuded at times with their president, lawmakers knew they could ultimately count on the White House to endorse and raise money for incumbents, because controlling as many seats as possible would serve both their interests.\n\nBut Mr. Trump’s decision to align himself with congressional Democrats this week over federal spending and hurricane relief cemented a view that he will not operate according to any such conventions. Relations between the president and congressional Republicans have frayed over the lawmakers’ failure to deliver on key legislation and Mr. Trump’s constant badgering and personal attacks against them.\n\nThe president has repeatedly assured Republicans that he will be an active campaigner for the party next year. But Republican leaders fret that he will gravitate toward candidates who share his distinctive political priorities and anti-Washington attitude, and that nominating some of the Trump-driven candidates could imperil their control of Congress. He will have spent as much time in his first year in office raising money for his own re-election as helping others.\n\nYet even Republicans who are uneasy about Mr. Trump say lawmakers need to understand the grip he holds on the conservative grass roots.\n\n“If you would go to my county Republican clubs right now, they are all about Trump,” said Representative Tom Rooney, Republican of Florida. “He is the party.”\n\nJust how far his reach extends could determine some of the most high-profile races next year.\n\nMr. Trump is in open war with Mr. Flake, who shunned the president last year and has written a scathing book about his party’s “Faustian bargain.” Mr. Trump’s political arm has aired ads against Mr. Heller, while the president himself used a televised White House meeting with Mr. Heller to warn that he would be voted out if he did not back repeal of the Affordable Care Act.\n\nNow, Mr. Flake and Mr. Heller, the only two Republican senators on the 2018 ballot from swing states, are facing primary challenges from pro-Trump candidates.\n\n“Hopefully the president recognizes it’s in his best political interest to have as many Republicans in the Senate as possible,” said Senator John Cornyn of Texas, the No. 2 Republican in the Senate, adding, “I think he can count.”\n\nNearly as worrisome to Republicans is what the president is not doing for another incumbent: Mr. Strange. Mr. Trump endorsed Mr. Strange, who was appointed to fill the seat vacated by Attorney General Jeff Sessions, shortly before the senator’s primary last month. At that time, he signaled to the senator that he would campaign with him before a runoff on Sept. 26.\n\n“He’s offered to do whatever he can to help,” Mr. Strange said the day before the primary.\n\nBut now that Mr. Strange finds himself locked in a difficult race with Mr. Moore, Mr. Trump has gone quiet. Stephen K. Bannon, the president’s former chief strategist, is loudly urging Mr. Trump to back away from Mr. Strange, while some current White House officials counsel the president to be careful about spending political capital on a candidate who may lose, according to a senior administration official.\n\nIn a phone call with Mr. Trump on Tuesday, Mr. Strange highlighted a radio interview that Mr. Moore had done with Laura Ingraham last month in which Mr. Moore said the president was disconnected from his base and suggested that Jared Kushner, the president’s son-in-law and adviser, was behind the endorsement of Mr. Strange, according to a Republican briefed on the call.\n\nHowever, any attempt at luring the president into scheduling an Alabama trip has yet to work: Mr. Strange, who has based his entire campaign on his support for and from the president, told Mr. Trump that a presidential or vice-presidential visit could win the race, but no commitment has come.\n\nRepublican leaders are holding out hope that Mr. Trump may still appear with Mr. Strange. Privately, they are furious about the prospect of being saddled with as polarizing a figure as Mr. Moore, who was removed from his post as chief justice of the State Supreme Court over his refusal to remove a Ten Commandments monument. And they are fuming that, even with his loyalists, Mr. Trump cannot be depended upon.\n\nUncertainty is also gripping the House, where this week two Republicans, Mr. Reichert and Mr. Dent, announced their retirements.\n\nTheir decisions, just months after Ms. Ros-Lehtinen, another center-right stalwart, said she would also leave, has Republicans fearing a wave of retirements going into next year. Representative Dave Trott of Michigan is considering retiring, and another Michigan Republican, Fred Upton, may retire or run for the Senate, according to multiple party officials.\n\n“Is the House at risk? Absolutely,” Mr. Dent said.\n\nMr. Dent’s announcement came a day after a pro-Trump candidate announced plans to run against him. That candidate, State Representative Justin Simmons, attacked Mr. Dent as a “ringleader” of opposition to the White House.\n\n“I’m appalled by the way he’s acted in his votes since President Trump was elected,” Mr. Simmons said in an interview.\n\nWhile they have not gotten the same attention as the threats to Mr. Flake and Mr. Heller, about a half-dozen pro-Trump Republicans have opened primary challenges against Republican members of the House, accusing the incumbents of inadequate fealty to the president. The House Republican campaign arm has quietly started a new incumbent-protection effort called the “Primary Patriot” program.\n\nMark Harris, a North Carolina minister running against Representative Robert Pittenger in a Republican primary, said voters had plainly validated Mr. Trump’s agenda last year, and expect cooperation from the Republican-led Congress.\n\n“The average person blames Congress for the failure to enact this president’s agenda,” Mr. Harris said. “And personally, I think they’re right.”\n\nMr. Trump will also leave his imprint on races beyond Congress by whom he chooses to support with his time and fund-raising power. Representative Jim Renacci of Ohio, a wealthy former auto dealer who is running for governor, said he had broached the subject of his race during an Oval Office meeting with the president, and Mr. Trump was tuned in.\n\n“The president has always been supportive of Jim Renacci, because I’ve been supportive of him,” Mr. Renacci said.\n\nBut skeptics of the president say Mr. Trump simply does not understand that his own fate may well hinge on the success of the party’s candidates.\n\nCongressional Republicans are “carrying water on the Trump agenda up to their eyeballs,” said Josh Holmes, a top lieutenant to Mr. McConnell, while “you’ve got a Democratic minority that is doing nothing less than trying to impeach the man.”\n\nRepublican frustrations boiled over this week after Mr. Trump torpedoed his own party on a fiscal deal, and then flew on Air Force One with Senator Heidi Heitkamp to North Dakota, where he handed Ms. Heitkamp, a Democrat, a ready-made commercial for her re-election next year by praising her as “a good woman.”\n\nIt was a vivid illustration of just how inconstant his enthusiasm for Republicans might be. Faced with a choice between helping his party weaken a vulnerable Democrat, and indulging a Democrat who has been nice to him and whose support he wants for a tax overhaul, Mr. Trump opted emphatically for the latter.", "link": "https://www.nytimes.com/2017/09/08/us/politics/trump-rattles-republicans-ahead-of-midterm-elections.html?partner=rss&emc=rss", "logo": "https://static01.nyt.com/images/misc/NYT_logo_rss_250x40.png", "left_right_score": 0.00429826722734769, "bias": 2, "facebook_likes": 1023, "title": "Mercurial Trump Rattles Republican Party Ahead of Midterms", "source": "The New York Times"}, "Fox News": {"body": "During a bipartisan meeting between Trump and lawmakers, the president issued new gun safety proposals to increase school safety. Here are the president's proposals.\n\n\t                        \t\n\n\t\t\t\t\t \n\n\t\t\t\t  \n\n              \n\n            \n\t\t \n\n    \n\n\n\n\n\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\n\n\n \n\n\n\n       \n       \n      \n          \n              Two weeks after a gunman walked into a high school in Parkland, Florida, and killed 17 students and faculty members, survivors aren't giving up their fight for stronger gun control efforts.\n\n              \n                  \n                  \n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Marjory Stoneman Douglas High School teenagers have moved front and center in the gun control debate, organizing a coming national school walkout, meeting with President Donald Trump, lobbying state lawmakers and participating in protests.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Since the Feb. 14 shooting, several ideas have been floated by the White House, Republicans, Democrats and state officials to combat gun violence. Trump also hosted a group of bipartisan lawmakers at the White House to discuss reform.\n\n              \n             \n                           \t\t\n\t\t\t\t\t\n              \n              \n              \n              \n\n\n              \n          \n              Here are seven measures lawmakers are now debating.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Arming teachers\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Trump and Republicans suggested the possibility of arming teachers after the school shooting – and Florida lawmakers moved closer to do that this week.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n                  \n              \n          \n              The Florida Senate narrowly passed a bill Monday that would allow for some teachers to be armed.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              On Twitter, Trump promoted the idea of having “highly trained, gun adept” teachers and coaches in schools who could confront a shooter before first responders arrived or serve as a “deterrent to the cowards that do this.”\n\n              \n             \n               \n              \n              \n              \n\n\n\n    \n    \n    \n        \n    \n\n\n\n\n\n    \n    \n    \n        \n    \n\n\n\n\n\n    \n    \n    \n        \n    \n\n\n\n\n              \n          \n              “If a potential ‘sicko shooter’ knows that a school has a large number of very weapons talented teachers (and others) who will be instantly shooting, the sicko will NEVER attack that school. Cowards won’t go there...problem solved. Must be offensive, defense alone won’t work!” Trump tweeted.\n\n              \n             \n               \n              \n              \n              \n\n\n\n    \n    \n    \n        \n    \n\n\n\n\n              \n          \n              Two school districts near Dayton, Ohio, already train a group of select teachers and faculty members to confront an active shooter. These staff members, whose identities are not revealed, have access to safes throughout the schools which have guns hidden inside.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Ohio offers funding for schools to train staff to respond in emergency situations. There are more than a dozen other states across the country with school districts that have teachers or staff members who are trained to fire back, or which legally allow adults with guns on school grounds.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Strengthening federal background checks\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Trump has seemed open to strengthening the federal background check process for gun purchases, saying it should be a bipartisan effort to do so.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Gun control advocates point to what they see as “loopholes” in the current system that could allow for people to purchase guns even when they legally should not be able to do so.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Specifically, Jonas Oransky, deputy legal director of Everytown for Gun Safety, a nonprofit that advocates for stronger gun control, noted the ability for consumers to purchase guns from a private seller without completing a background check.\n\n              \n             \n               \n              \n              \n              \n\n    \n\n    \n\n    \n    \t\n\t       \t\n\t       \t\n\t\t        \n\t\t            “It’s not that all sellers are dangerous or devious, but buyers who know that they can skip the background check can look for an unlicensed seller.”\n\n\t\t\t\t\t\n\t\t   \t\t\t\t- Jonas Oransky, Everytown for Gun Safety\n\t\t\t\t\t\n\t\t        \n\t        \n        \n    \n\n\n\n              \n          \n              “It’s not that all sellers are dangerous or devious, but buyers who know that they can skip the background check can look for an unlicensed seller,” Oransky told Fox News.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              He also pointed to the so-called “Charleston loophole,” which allows dealers to sell guns to a customer before a background check is completed – when National Instant Criminal Background Check System (NICS) marks a document “delayed” but does not approve or deny it within three business days. He said a disproportionate number of buyers who obtain a gun before a background check is completed are domestic abusers, citing complex records and restraining orders that investigators need additional time to read through or discuss with the appropriate local law enforcement agency.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              However, Second Amendment advocates argue the background check system already does too much.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              “We don’t think it’s proper for people to have to prove their innocence to the government in order to exercise their God-given right,” Erich Pratt, executive director of Gun Owners of America, a Virginia-based gun rights nonprofit, told Fox News.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Eliminating bump stocks\n              \n             \n               \n              \n              \n              \n\n\n\n\n\n\t\n    \n    \n    \n\t    \n\t    \t\t\n\t\t\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t \t        \n\t\t        \t\n\t\t       \t\n\t\t\t       \t\n\t\t\t       \t\t\n\t\t\t\t\t\t\tGraphic shows how the bump stock accelerates the firing rate of a semiautomatic rifle; 2c x 3 inches; 96.3 mm x 76 mm.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t (AP Photo)\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t        \n\n\t\t\t\t       \t\n\n\t\t\t\t    \n\t\t       \t\n\t        \n\t\t\n  \n\t\n\n\n\n              \n          \n              In the wake of the Parkland shooting, Trump said he signed an order instructing the Justice Department to ban bump stocks, an attachment that allows a semi-automatic rifle to resemble a fully automatic weapon.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Attorney General Jeff Sessions said top officials in the Justice Department believe they can ban bump stocks through the regulatory process. However, gun manufacturers and owners are likely to sue if they are banned without any legislation from Congress.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Bump stocks were approved in 2010 by the Bureau of Alcohol, Tobacco, Firearms and Explosives after concluding the devices did not turn guns into machine guns, which are prohibited under the National Firearms Act.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              The devices weren’t used in the Parkland shooting, but the massacre did reignite the debate over whether they should be banned.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Limiting high-capacity magazines\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Sen. Marco Rubio, R-Fla., said he's open to changing his stance on one gun control measure after meeting with survivors of the Marjory Stoneman Douglas High School shooting: high-capacity magazines.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              \"I have traditionally not supported looking at magazine clip size and after this and some of the details I have learned about it, I am reconsidering that position,\" Rubio said during a recent town hall. \"While it may not prevent an attack, it may save lives in an attack ... So we'll have to get into that debate, but that is something I believe that we can reach a compromise [on] in this country, and that I'm willing to reconsider.\"\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              The suspected gunman had to stop to reload his firearm during the massacre, which Rubio added was “evidence in this case that it saved the lives of some people.” \n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Several measures introduced in states across the country – including in Colorado, Illinois and Rhode Island – would ban high-capacity magazines.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Raising the age limit to buy certain guns\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              After hosting survivors of gun violence and their parents at the White House, Trump publicly backed raising the minimum age to purchase semi-automatic weapons to 21.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              “There’s nothing more important than protecting our children,” Trump said. \n\n              \n             \n               \n              \n              \n              \n\n    \n\n    \n\n    \n    \t\n\t       \t\n\t       \t\n\t\t        \n\t\t             “Certainly, nobody under 21 should have an AR-15.”\n\n\t\t\t\t\t\n\t\t   \t\t\t\t- Sen. Pat Roberts, R-Kan.\n\t\t\t\t\t\n\t\t        \n\t        \n        \n    \n\n\n\n              \n          \n              And when Republican Sen. Pat Toomey, R-Pa., acknowledged that a bill he’s sponsored with Sen. Joe Manchin, D-W.Va., to broaden background checks does not include raising the age limit, Trump accused him of being “afraid of the NRA.”\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              National Rifle Association spokeswoman Dana Loesch has already said the powerful gun lobby does not support raising the age limit to purchase certain firearms. After Trump’s White House meeting, she told Fox News it was “good TV,” but some of the proposals were “really bad policy.”\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              However, some Republican senators, including Rubio and Pat Roberts of Kansas, have voiced support for raising the minimum age to purchase certain types of firearms.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              “Certainly, nobody under 21 should have an AR-15,\" Roberts said.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Walmart, the nation’s largest retailer, announced this week that it would stop selling firearms and ammunition to anyone under the age of 21.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Banning ‘assault-style’ rifles\n              \n             \n               \n              \n              \n              \n\n\n\n\n\n\t\n    \n    \n    \n\t    \n\t    \t\t\n\t\t\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t \t        \n\t\t        \t\n\t\t       \t\n\t\t\t       \t\n\t\t\t       \t\t\n\t\t\t\t\t\t\tAR-15 rifles are displayed for sale at the Guntoberfest gun show in Oaks,  Roberts)\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t        \n\n\t\t\t\t       \t\n\n\t\t\t\t    \n\t\t       \t\n\t        \n\t\t\n  \n\t\n\n\n\n              \n          \n              House Democrats introduced a ban on semi-automatic firearms in February called the Assault Weapons Ban of 2018. More than 150 Democrats signed the legislation, the Washington Examiner reported.  \n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              According to a Harvard CAPS-Harris survey, 61 percent of respondents support banning the AR-15 firearm, used in many of the recent mass shootings in the U.S., including Parkland. Just 39 percent of respondents said adults who pass a background check should be allowed to purchase the firearm.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Dick’s Sporting Goods announced in February that it would stop selling assault-style rifles and prohibit anyone under the age of 21 from purchasing a firearm.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              “We support and respect the Second Amendment, and we recognize and appreciate that the vast majority of gun owners in this country are responsible, law-abiding citizens,” Edward W. Stack, chairman and CEO of Dick’s Sporting Goods, said in a statement. “But we have to help solve the problem that’s in front of us. Gun violence is an epidemic that’s taking the lives of too many people, including the brightest hope for the future of America – our kids.”\n\n              \n             \n               \n              \n              \n              \n\n\n\n    \n    \n    \n        \n    \n\n\n\n\n              \n          \n              Stack also said the company would stop selling high-capacity magazines and will continue its policy of not selling bump stocks.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              “Some will say these steps can’t guarantee tragedies like Parkland will never happen again. They may be correct – but if common sense reform is enacted and even one life is saved, it will have been worth it,” Stack said.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Cutting ties with the NRA\n              \n             \n               \n              \n              \n              \n\n\n\n\n\n\t\n    \n    \n    \n\t    \n\t    \t\t\n\t\t\t\t\t\n\t\t\t\n\t\t\t\n\t\t\t \t        \n\t\t        \t\n\t\t       \t\n\t\t\t       \t\n\t\t\t       \t\t\n\t\t\t\t\t\t\tMultiple companies have cut ties with the National Rifle Association after the Parkland, Fla., high school  Photo/Seth Perlman)\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t        \n\n\t\t\t\t       \t\n\n\t\t\t\t    \n\t\t       \t\n\t        \n\t\t\n  \n\t\n\n\n\n              \n          \n              Trump encouraged lawmakers not to be afraid to disagree with the NRA, the powerful nonprofit that advocates for gun rights, during a televised meeting with lawmakers.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              “I’m a fan of the NRA,” Trump said. “There’s no bigger fan. I'm a big fan of the NRA. These are great people, these great patriots. They love our country. But that doesn't mean we have to agree on everything.”\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Several companies have cut ties with the NRA since the Parkland school shooting. Among them are: Avis Budget Group, Enterprise Holdings, MetLife, United and Delta.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Georgia lawmakers voted to yank a tax break for Atlanta-based Delta on March 1 after the airline severed ties with the NRA.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              The bill cleared the state House with an overwhelming 135-24 vote, after being approved in the state Senate on a 44-10 vote. It was then sent to the governor's desk.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              The final version dropped an earlier amendment that would have renewed a jet fuel tax exemption worth $50 million that was taken off the books in 2015.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              “Businesses have every legal right to make their own decisions, but the Republican majority in our state legislature also has every right to govern guided by our principles,” said Lieutenant Gov. Casey Cagle, who threatened to kill the airline tax break days prior to the vote.\n\n              \n             \n               \n              \n              \n              \n\n\n\n    \n    \n    \n        \n    \n\n\n\n\n              \n          \n              The threat prompted liberal governors nationwide to court the airline, including New York Gov. Andrew Cuomo who tweeted his support and encouraged Delta to move its headquarters north.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              “Now more than ever the NRA is showing just how out of step they are with the American people,” Cuomo said in a statement, calling the NRA's agenda “dangerous.”\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              The NRA has fired back at companies like Delta – and at the lawmakers encouraging them – for allegedly not supporting the Second Amendment.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              “Ultimately, our members are passionate #2A supporters. Having those on the left pushing for a boycott to pressure companies to drop discounts just shows how out of touch some are,” the NRA said on Twitter.\n\n              \n             \n               \n              \n              \n              \n\n\n\n    \n    \n    \n        \n    \n\n\n\n\n              \n          \n              Fox News’ Jennifer Earl, Matt Finn, Brooke Singman and The Associated Press contributed to this report.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n  \n          \n              \n              \n\n\n \n\n\t\n\t\t\n\t\t\tKaitlyn Schallhorn is a Reporter for Fox News. Follow her on Twitter @K_Schallhorn.", "link": "http://feeds.foxnews.com/~r/foxnews/politics/~3/g36FayKlh2k/gun-control-measures-proposed-by-trump-lawmakers-after-florida-school-shooting.html", "logo": null, "left_right_score": 0.2362300794874176, "bias": 4, "facebook_likes": 25, "title": "Gun control measures proposed by Trump, lawmakers after Florida school shooting", "source": "Fox News"}, "Daily Beast": {"body": "President-elect Donald Trump has selected Goldmach Sachs president and COO Gary Cohen to serve as director of the National Economic Council, the chief economic policy-advising arm of the White House. Cohn has been with Goldman Sachs since the 1990s, attaining his current executive positions in 2006. A registered Democrat, Cohn has long been a prolific political donor, but reportedly remains friendly with leaders of both parties—including Jared Kushner, the son-in-law of Trump who took on a prominent role in his presidential campaign. Cohn’s appointment would come seemingly in direct contradiction of Trump’s promises to “drain the swamp” of the usual power-brokers—a line he frequently used when decrying rival Hillary Clinton’s status as a favored candidate among Wall Street bankers. A spokesman for the Trump Transition Team would not comment on a call with reporters Friday morning.", "link": "http://www.thedailybeast.com/cheats/2016/12/09/report-trump-picks-goldman-sachs-exec-to-lead-economic-council.html", "logo": "https://www.thedailybeast.com/static/images/square_logo_1x.16983b61.png", "left_right_score": 0.08856896136586984, "bias": 1, "facebook_likes": 1133, "title": "Report: Trump Picks Goldman Sachs Exec to Lead Economic Council", "source": "Daily Beast"}}