{"The Washington Post": {"body": "By Associated Press  By Associated Press  March 21 at 11:08 AM  \n  NAIROBI, Kenya — A Kenyan opposition official says they are poring through a British broadcaster’s investigation to see whether legal action is possible against data analytics firm Cambridge Analytica over its role in last year’s disputed presidential election.\n The firm already is being investigated by British and U.S. authorities over the alleged improper use of Facebook data.\n Kenya’s National Super Alliance chief executive Norman Magaya says they will look into whether Cambridge Analytica was involved in what the opposition claims is a hack of the electoral commission and manipulation of results in favor of President Uhuru Kenyatta in the August election.\n Kenyatta won a fresh election after the Supreme Court nullified the August vote over “illegalities.”\n In the Channel 4 report based on undercover video, Cambridge Analytica took credit for stage-managing Kenyatta’s campaign.\n Copyright 2018 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "link": "https://www.washingtonpost.com/world/africa/kenya-opposition-probes-cambridge-analyticas-election-role/2018/03/21/ab3a37da-2d19-11e8-8dc9-3b51e028b845_story.html", "logo": null, "left_right_score": 0.1111397156693069, "bias": 2, "facebook_likes": 1, "title": "Kenya opposition probes Cambridge Analytica's election role", "source": "The Washington Post"}, "Salon": {"body": "“It’s no secret that I didn’t want to see Donald Trump win yesterday,” Sen. Warren wrote to The Boston Globe. “I’m intensely frustrated by the apparent likelihood that, for the second time in five elections, a Democratic nominee will have won the popular vote but lost the presidency in the electoral college. But the integrity of our democracy is more important than any individual election, and those of us who supported Hillary Clinton will respect this result.\n\n“President-elect Trump promised to rebuild our economy for working people, and I offer to put aside our differences and work with him on that task. When he takes the oath of office as the leader of our democracy and the leader of all Americans, it is my sincere hope that he will fulfill that role with respect and concern from every single person in this country, no matter who they are, where they come from, what they believe, or whom they love.”\n\nWarren’s statement comes one day after she admitted to reporters outside her polling place in Cambridge that she was anxious about the possibility of Trump winning. “Of course I’m nervous,” she said. “If there is any chance at all that Donald Trump could be elected to lead this country, then I’m nervous, and that’s why I’m out working, I’m headed out to do more work today.” Sen. Warren is widely regarded to be a leader of the Democratic Party’s progressive wing. Like many other political leaders, she was viciously ridiculed and attacked by Trump during the campaign, most notably when he derisively called her “Pocahontas” in reference to her having claimed to have Native American ancestry.", "link": "http://www.salon.com/2016/11/09/elizabeth-warren-offers-donald-trump-an-olive-branch-i-offer-to-put-aside-our-differences/", "logo": null, "left_right_score": 0.38872367796081736, "bias": 1, "facebook_likes": 1375, "title": "Elizabeth Warren offers Donald Trump an olive branch: “I offer to put aside our differences”", "source": "Salon"}, "CBS News": {"body": "Rep. Trey Gowdy, R-South Carolina, one of the four authors of the GOP memo released Friday, told CBS News' \"Face the Nation\" that he believes a surveillance warrant for former Trump campaign adviser Carter Page would not have ever been authorized without the existence of the controversial \"Steele dossier.\"\n\nGowdy's comments come on the heels of the Friday release of a memo drafted by Gowdy, House Intelligence Committee chairman Rep. Devin Nunes, R-Calif., and two investigators on the committee. The memo, declassified by President Trump and released by Republicans on the House Intelligence Committee Friday, outlines how Foreign Intelligence Surveillance Act (FISA) warrants were obtained for former Trump campaign official Carter Page, and what relationship the Trump dossier compiled by former British intelligence officer Christopher Steele had with those FISA warrant applications.\n\nGowdy said the public will \"never know\" if the surveillance against Page was justified, saying the warrants relied on three pieces of information -- the dossier, a reference to a Yahoo News article and other information available to the FISA court judges who approved warrants.\n\nBut, Gowdy, the only Republican on the House Intelligence Committee who has seen the actual FISA warrant applications -- Nunes has not -- emphasized that the memo does not discredit special counsel Robert Mueller's investigation into Russian election meddling and any ties to Trump associates.\n\n\"Not to me, it doesn't, and I was pretty integrally involved in the drafting of it,\" Gowdy said, asked if the memo has an impact on the Russia probe. \"There is a Russia investigation without a dossier.\"\n\nThe dossier has \"nothing to do\" with the June 2016 Trump Tower meeting involving Donald Trump Jr., Trump son-in-law and senior adviser Jared Kushner, and a Russian lawyer, Gowdy noted. Gowdy also said the dossier did not form the basis for the case against George Papadopoulos, the former Trump campaign aid who has pleaded guilty to lying to the FBI about foreign contacts. The dossier has nothing to do with obstruction of justice, Gowdy noted.\n\n\"So there's going to be a Russia probe, even without a dossier,\" he said.\n\nMeanwhile, Gowdy said \"it would\" concern him if President Trump makes any move to fire Deputy Attorney General Rod Rosenstein.\n\nThe South Carolina Republican and chairman of the House Oversight and Government Reform Committee said he has confidence in the deputy attorney general, of whom Mr. Trump has been publicly critical, and he would be concerned if the commander-in-chief attempts to fire him.\n\n\"It would. Again, I'm not in the Senate. I don't have advice and consent. And the president has not sought my counsel on this,\" Gowdy told CBS News' White House and senior foreign affairs correspondent Margaret Brennan.\n\nPressed as to whether he thinks Rosenstein should be fired, based on the information he has seen in compiling the memo, Gowdy said no.\n\n\"I don't,\" Gowdy said. \"I think it is fair to ask the deputy attorney general, what did you know at the time you signed one of the applications? I think it is fair to ask, what FISA reforms are you going to implement to make sure we don't have this fact pattern come up again? I don't judge people based on a single decision that they make throughout the course of an otherwise really stellar career.\"\n\nGowdy also expressed confidence in FBI Director Christopher Wray, whom President Trump selected to replace fired FBI Director James Comey last May.\n\n\"I've had my differences with Rod Rosenstein and I still think that he is fully capable of helping run a Justice Department that we can all have confidence in,\" Gowdy said. \"I'm actually really impressed with Chris Wray and I say that even though we are on totally opposite sides of this issue and probably will always be. He doesn't think the memo should have been publicly disseminated. I have real questions about the process that the bureau went through in 2016, but I also think he's the person to lead the bureau. I think he's doing a good job.\"\n\nGowdy went on to express his support for Mueller, whose investigation he said is independent.\n\n\"Well I'm actually in a really small group, I think, of Republicans that think that this FISA process is suspect and wrong and should not have taken place. But you still have a Russia investigation even without it,\" Gowdy said. \"So I don't know how many other Republicans feel that way. I am on record as saying I support Bob Mueller 100 percent. I think you would have a Russia -- look, Russia tried to interfere with our election in 2016 with or without a dossier. So you need an investigation into Russia. You need an investigation into the Trump Tower and the Cambridge Analytica email, separate and apart from the dossier. So those are not connected issues to me. They may be for Republicans, but they're not for me. I say investigate everything Russia did but admit that this was a really sloppy process that you engaged in to surveil a U.S. citizen.\"\n\nGowdy's claims would seem to conflict with Mr. Trump, who took to Twitter Saturday morning to claim the GOP memo \"totally vindicates 'Trump.'\" The president frequently describes the Russia probe as a \"witch hunt,\" and did so on Saturday morning.\n\nGowdy also opened up about his upcoming departure from Congress. His announcement that he would not run for reelection in 2018 sent shockwaves throughout Washington.\n\n\"You know, I'm just -- I enjoy the justice system more. I enjoy being fair,\" Gowdy said, explaining the reason for his departure. \"I enjoy the pursuit of fairness as a virtue and I'm just more comfortable in that system. My wife hates it when I say this but I was a pretty good prosecutor, I think. But I've been a pretty lousy politician. So, I've done it for seven years. I'm really grateful for the opportunity to do it but it's time for me to -- whatever time I've got left, I want to spend it in the justice system because that's where my heart is.\"\n\nYou can watch Gowdy's interview with Margaret Brennan on Sunday on \"Face the Nation\" (@FaceTheNation). Click here to check your local listings.", "link": "http://www.cbsnews.com/news/trey-gowdy-face-the-nation-fisa-surveillance-warrant-would-not-have-been-authorized-without-dossier/", "logo": "http://wwwimage.cbsnews.com/common/images/v2/logo_cbsnews_small.gif", "left_right_score": 0.029791300866684634, "bias": 2, "facebook_likes": 3416, "title": "Gowdy says surveillance warrant would not have been authorized without dossier", "source": "CBS News"}, "Wall Street Journal": {"body": "This transcript has been automatically generated and may not be 100% accurate.\n\n... the more intriguing relationships in this very intriguing political seasons between the tea party movement ... and the Donald Trump with mature they look the same in many ways the votes are grassroots anti establishment political uprisings that ... have roots in the Republican party but there actually are some very significant differences between the two more of the Treaty questions now for the tea party movement ... can fully embrace Donald Trump down the road that while things about our trump the tea party activists like ... that like his attitude about upending the political system ... they like his attitude about illegal immigration in stopping that in dealing with the legal immigrants already here ... and they like the fact that he is prepared to take on the political establishment in Washington specifically is the isthe strong guy who could do it ... the rhetoric is somewhere but they're also some big difference is the tea party activists and be very strict conservative suits have a view of the Constitution strict adherence to the Constitution they don't hear da from talking bout that very much ... their little worried that he's chewing Negishi on things like is large tax cut and they were a will that that he is expansive view of presidential power their wary of imperial presidencies ... bigger Donald Trump talk about how what he's gonna do is present and they were a little bit too much about ... party centralize that's not a tea party impulse ... so where does this all go I think in the long run most tea party activists will probably end up supporting Donald Trump ... some more likely than others but there's one major point for the Trump campaign in this which is that if there is an independent conservative third party candidacy that emerges play some tea party supporters might be inclined to go that direction they're like Ted Cruz a lot during the primaries that like Donald Trump plus ... there's some danger they may move away from the front movement if that doesn't happen my guess is most of these tea party supporters will turn into cross supporters eventually some more enthusiastic than others ...", "link": "http://www.wsj.com/video/will-the-tea-party-support-donald-trump/9C8327C1-BDF6-4156-925A-AFD2A2185F97.html", "logo": "http://online.wsj.com/img/myYahooWSJlogo.gif", "left_right_score": 0.2760200452818091, "bias": 3, "facebook_likes": 7, "title": "Will the Tea Party Support Donald Trump?", "source": "Wall Street Journal"}, "Breitbart": {"body": "State Rep. Scott Hamann (D-South Portland) sent a written statement to the Bangor Daily News Wednesday apologizing for his rant after he threatened to make Trump a “half-term president” and called him a “pussy.”\n\n“I regret my impulsive decision to post something aggressively sarcastic and inappropriate in a Facebook exchange with a childhood friend,” Hamann wrote in his statement, adding that this is not the language he typically uses.\n\nHamann, who posted the comments as a reply to another Facebook user, also claimed Trump was “installed by the Russians” and was “an admitted rapist.”\n\nThe Secret Service is reportedly investigating the post, but could not comment on the opening of an investigation.\n\nRadio host Keith Hanson reportedly circulated Hamann’s Facebook post and reached out to the state lawmaker about his comments.\n\n“If anything negative comes from your attack on my employment, my attorney will be in touch, Hamann told Hanson. “Cease and desist.”\n\nThe chairwoman of the Maine GOP, Demi Kouzounas, called for Hamann’s resignation.\n\n“Words cannot even begin to describe the revulsion I feel after reading [Hamann’s] recent tirade that has come to light,” she said. “The best way I can describe these comments is simple: unhinged and dangerous.”\n\nEven the chairman of the Maine Democratic Party hammered Hamann over his statement.\n\n“The Maine Democratic Party does not condone this kind of discourse – period,” Maine Democratic Party Chairman Phil Bartlett said in a prepared statement. “Rep. Hamann’s comments were unacceptable and do not represent our values as a party. He has rightly apologized for them and removed the post.”", "link": "http://feedproxy.google.com/~r/breitbart/~3/SdtcL-N0ISQ/", "logo": "http://www.breitbart.com/t/assets/i/breitbart-logo.png", "left_right_score": 0.5295360047187041, "bias": 5, "facebook_likes": 9227, "title": "Maine Democrat Apologizes for Facebook Rant Threatening Trump", "source": "Breitbart"}, "USA Today": {"body": "Noga Tarnopolsky, Special to USA TODAY\n            Published 8:09 p.m. ET March 22, 2018 | Updated 8:15 p.m. ET March 22, 2018\nA cellphone and a computer screen display the logo of the social networking site Facebook on March 22, 2018.(Photo: Norberto Duarte, AFP/Getty Images)\n\n\nIsrael takes the privacy of its citizens very seriously.\nJust how seriously became clear Thursday as the Israeli Privacy Protection Authority — a body empowered to issue criminal charges — launched an “administrative investigation” into Facebook’s possible violations of Israeli law.\nGrowing public outrage over the misuse of the private information of tens of millions of Facebook users by Cambridge Analytica, a firm that claimed it helped Donald Trump win the White House, has ignited a full-blown crisis for the technology giant. \nAlon Bachar, director of the IPPA, said that due to the scale of Facebook's global platform, “it is reasonable to assume the action constitutes the illegal use of private data under Israel’s privacy law.”\nMore: Bye Facebook, hello Instagram: Users make beeline for Facebook-owned social network\nMore: Zuckerberg is willing to testify to Congress, isn't sure if the Russians have your data\nThe law, established in 1981, represents a constitutional right for Israelis, whose personal data may only be used to the purpose for which it was given with explicit consent. “It is a significant law, heavily weighted toward the citizen’s right to privacy,” Bachar said in an interview with USA TODAY.\nIsrael’s law is similar to European Union statutes on personal data and confidentiality, where the right to privacy is considered a basic one.\nAnd the IPPA, a department within the Israeli Justice Ministry, has wide-ranging authority to investigate any suspected violations.\nThe Israeli daily Haaretz reported earlier that the “abuse of data of 50 million Facebook users may also have included Israelis – including some 200,000 U.S. voters living in Israel.”\nHowever, Bachar said there is no connection between the Israeli \"probe and U.S. law enforcement.”\nInstead, he said the rights of all 8.5 million Israelis may be at risk. “We are not looking into American voters in Israel. Our concern is to examine if the privacy of Israeli citizens has been violated, full stop.”\nHinting at a global legal avalanche facing Facebook, Bachar said that to his knowledge the European Union, Canada, Australia and India had announced similar investigations.\n“We are in contact with and cooperating with privacy protection authorities around the world,” he said.  \nRead or Share this story: https://usat.ly/2DNDmTi", "link": "http://rssfeeds.usatoday.com/~/534342414/0/usatoday-newstopstories~Israel-opens-investigation-into-Facebook-to-examine-if-citizensapos-privacy-was-violated/", "logo": "http://www.gannett-cdn.com/sites/usatnetwork/images/RSS_Syndication_Logo-USATN.png", "left_right_score": 0.1523884796680243, "bias": 3, "facebook_likes": 0, "title": "Israel opens investigation into Facebook to examine if citizens' privacy was violated", "source": "USA Today"}, "Politico": {"body": "Sen. Dianne Feinstein earlier this month suggested that partisan pressures could hurt Congress' ability to come to a final conclusion on whether Trump associates colluded with Russian entities during the election.  | Saul Loeb/AFP/Getty Images\n        \n    \n            \n                \n                    Feinstein sends Russia inquiries to White House, Facebook, Twitter\n                        \n\n                \n                        Feinstein sent five letters to key players, including one asking Facebook and Twitter for copies of advertising that Russian buyers aimed at the U.S.\n                \n            \n    \n                \n                \n            \n        \n            By ELANA SCHOR\n    10/27/2017 02:48 PM EDT\n                    \n\n        \nThe Senate Judiciary Committee's top Democrat, Dianne Feinstein of California, on Friday launched several new investigative queries about Russian electoral meddling — without sign-on from the panel's GOP chairman.\nThe solo step from Feinstein follows something of a split between her and Senate Judiciary Committee Chairman Chuck Grassley (R-Iowa), as they have begun pursuing separate avenues of inquiry regarding Russian interference in the 2016 election. Feinstein is working on legislation that would make it illegal for Americans to take help from foreign nationals to influence an election, while Grassley is zeroing in on an inquiry of his own into a Russian uranium sale approved by Hillary Clinton's State Department.Story Continued Below\n\n Feinstein sent five letters to key players, including one asking Facebook and Twitter for copies of advertising that Russian buyers aimed at the U.S. Another expansive request from Feinstein asks the White House to produce documents regarding President Donald Trump's former national security adviser Michael Flynn and former campaign chairman Paul Manafort as well as the firing of FBI Director James Comey.\nFeinstein's other letters seek information from Trump lawyer Michael Cohen and Cambridge Analytica, a data firm engaged by the Trump campaign that Wikileaks founder Julian Assange has said reached out to him last year amid his website's public posting of hacked emails from the Hillary Clinton campaign.\n        \n        \n        \n            \n                \n                    Sign up here for POLITICO Huddle\n                                A daily play-by-play of congressional news in your inbox.\n                    \n            \n        \n        \n            \n                \n                            By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n                            \n        \n    \n    \n\nThe California Democrat earlier this month suggested that partisan pressures could hurt Congress' ability to come to a final conclusion on whether Trump associates colluded with Russian entities during the election, describing Special Counsel Robert Mueller as best positioned to address the issue.\n\"What happens in a political body — and I am finding this as the ranking member on the Judiciary Committee — everything has to be negotiated with the party in power, and it's very difficult to do an investigation under those circumstances,\" Feinstein told CBS' \"Face the Nation\" on Oct. 8.\n\n\n    \n         \n            \n                Missing out on the latest scoops? Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.", "link": "https://www.politico.com/story/2017/10/27/feinstein-russia-inquiries-facebook-twitter-244247", "logo": null, "left_right_score": 0.002010740908402948, "bias": 2, "facebook_likes": 747, "title": "Feinstein sends Russia inquiries to White House, Facebook, Twitter", "source": "Politico"}, "Vox": {"body": "It was a wild week at the White House. One of President Donald Trump’s closest aides, Hope Hicks, announced her exit — without warning. The president’s son-in-law and White House adviser, Jared Kushner, saw his security clearance downgraded and is under increasing ethical scrutiny over his business deals and foreign contacts. The president attacked Attorney General Jeff Sessions on Twitter over his refusal corroborate a conspiracy theory of widespread conspiring in federal law enforcement against Trump, and there are rumors National Security Adviser HR McMaster and National Economic Council Director Gary Cohn might soon be out the door. At the same time, Trump decided it might be a good time to kick off a trade war, too, and announced plans to slap large tariffs on imports of aluminum and steel. \n\nIn the midst of all of this White House chaos, wheels were turning on another front: Trump’s 2020 reelection campaign. The president has been campaigning for reelection since he arrived at the White House — Trump filed the paperwork for his reelection campaign the same day he was inaugurated as president on January 20, 2017. He has been fundraising for the past year, ending 2017 with $22 million in cash, and has held multiple campaign rallies across the country. \n\nFirst there was Corey, then Paul, then Steve, and now Brad\nMatt Drudge spent Tuesday morning teasing a “shock” announcement from President Trump — which turned out to be that Trump is running for reelection in 2020. (Not especially shocking.) But there was in the announcement some new news: that the Trump reelection campaign has tapped Brad Parscale as campaign manager. Parscale was in charge of digital operations in Trump’s 2016 campaign. In an announcement of the decision to tap Parscale as campaign manager, Trump’s son, Eric, described Parscale as an “amazing talent,” and Kushner, said his leadership and expertise will “help build a best-in-class campaign.”\n\nParscale worked closely with Facebook, Twitter, and Google to boost Donald Trump’s online presence in 2016 and was a major part of his victory. A 60 Minutes profile of Parscale called him the Trump campaign’s “secret weapon,” who leveraged Facebook specifically to give Trump a boost. “I think Donald Trump won, but I think Facebook was the method,” he told CBS’s Lesley Stahl. “It was the highway in which his car drove on.”\n\nFacebook, of course, wasn’t the only technology Parscale used during the 2016 campaign. He is also tied to Cambridge Analytica, Vox’s Sean Illing pointed out, a data analytics form that has become a major focus of both the House Intelligence Committee’s investigation into Russian meddling in the election and special counsel Robert Mueller’s probe. Kushner brought on Cambridge Analytica to take over the Trump campaign’s data operations in 2016, while Parscale was developing its online microtargeting strategy. (During his 60 Minutes interview, Parscale denied that the firm was useful.)\n\nThe Cambridge Analytica question aside, hiring Parscale as campaign manager is a significant step for Trump’s reelection bid. Trump’s previous campaign managers include Corey Lewandowski, Paul Manafort (who was chair), and Steve Bannon.\n\nAfter announcing Parscale, the Trump campaign also put out a press release on building out its leadership team. They said Michael Glassner, the 2016 campaign deputy manager, will serve as chief operating officer of Trump’s reelection campaign, and Lara Trump, the president’s daughter-in-law, will serve as a senior adviser. \n\nTrump is getting ready to ramp up fundraising efforts\nOn Saturday, Trump is launching a fundraising initiative that mimics a tactic employed by former President George W. Bush to raise money, according to a report from Alex Isenstadt at Politico. \n\nTrump is appearing before Republican donors at Mar-a-Lago to kick off the plan that rewards donors who have “bundled” thousands of dollars in contributions, meaning they gather campaign contributions from others. Donors who raise $25,000 will join the “Trump Train,” and those who raise $45,000 will be part of the “45 Club.” The program will jointly benefit Trump’s reelection campaign and the Republican National Committee. \n\nThis marks a new step in campaign fundraising for Trump’s 2020 campaign, which has already been taking in millions of dollars in donations. His campaign committee ended 2017 with $22 million in cash, having brought in $6.9 million in the fourth quarter of the year alone. Per FEC data, his campaign committee raised $32 million in 2017. His campaign committee and two fundraising committees that are joint operations with the Republican National Committee — Trump Victory and the Trump Make America Great Again Committee — raised a combined $52 million in 2017, according to the Washington Post.\n\nA significant chunk of the reelection campaign’s money has gone to legal fees — about a quarter, according to the New York Times. The campaign has also been paying hundreds of thousands of dollars to Parscale and his firm quarterly for digital advertising efforts.\n\nIsenstadt also reported on Saturday that Parscale will attend an RNC donor retreat at the Four Seasons Resort in Palm Beach, Florida, this weekend. Trump is keeping an eye on potential Republican challengers in 2020, including Ohio Governor John Kasich and Senators Ben Sasse (R-NE) and Jeff Flake (R-AZ). He’s also trying to focus a lot of his presidential travel around the country on swing states.\n\n“It’s important that President Trump continue to lay the groundwork for a strong reelection campaign because he’s not going to be able to drain the swamp overnight,” Jason Miller, a former Trump campaign aide, told Politico. \n\n2020 is a long way away, but right now, Trump is pretty unpopular\nTrump has kicked off reelection efforts unusually early compared to his predecessors. George W. Bush filed his paperwork in the spring of 2003 for his 2004 reelection campaign; Barack Obama filed in April 2011 for 2012.\n\nOver a year into his presidency, Donald Trump remains a historically unpopular figure. According to FiveThirtyEight’s tracker that averages presidential approval polls, 40.4 percent of voters approve of the job Trump is doing as president. At the same point in their presidencies, Obama’s approval rating was at 49.1 percent, Bush’s was at 75.5 percent, and Bill Clinton’s was at 55.3 percent. It might not be a bad idea for Trump to try to get a head start.", "link": "https://www.vox.com/policy-and-politics/2018/3/3/17075516/trump-reelection-2020-brad-parscale", "logo": null, "left_right_score": 0.015243147439478716, "bias": 2, "facebook_likes": 358, "title": "During a chaotic week in the White House, Trump quietly ramped up his 2020 reelection campaign", "source": "Vox"}, "BBC.com": {"body": "Brazil: home of its namesake “butt lift,” South America’s largest country has long had a thriving plastic surgery industry that has fuelled countless liposuctions, implants, nips and tucks.\n\nBut recently, the economic woes of Brazil’s northern neighbour Venezuela are prompting more Brazilians to cross the border for surgery, where cosmetic tweaks are far cheaper.\n\nUnder the administration of its president Nicolas Maduro, Venezuela has been stricken by falling oil revenues, violent anti-government protests and widespread food shortages. Inflation is rife and the value of the country’s currency – the bolivar – has dropped dramatically since early 2016.\n\nThe sudden increase in purchasing power has created a unique opportunity for Francisca Maia Vasconcelos, who has built a business ferrying patients, mostly from the city of Manaus in Brazil, across the border to the Venezuelan town of Puerto Ordaz, where surgeries are cheaper.\n\nThough prices vary, a liposuction, breast and buttock augmentation surgery in Venezuela can cost Brazilians around 10,000 real ($3,098). In Brazil the same procedures can cost closer to 30,000 real.\n\nTo comment on this story or anything else you have seen on BBC Capital, please head over to our Facebook page or message us on Twitter.", "link": "http://www.bbc.com/capital/story/20180110-venezuelas-butt-lift-boom?ocid=global_capital_rss", "logo": "http://static.bbci.co.uk/onesport/2.11.536/images/rss-logo_144x144.png", "left_right_score": 0.22844475937563372, "bias": 3, "facebook_likes": 104, "title": "Venezuela's 'butt-lift' boom", "source": "BBC.com"}, "The Blaze": {"body": "Republican presidential nominee Donald Trump’s campaign has parted ways with its Virginia state chairman after he organized a protest outside the Republican National Committee’s headquarters on Monday.\n\nThe campaign confirmed in a statement today that Corey Stewart, the state chairman who is also running for governor, “is no longer affiliated” with the Trump campaign.\n\nStewart had reportedly organized a pro-Trump protest outside the RNC’s Washington, D.C. headquarters today along with Virginia Women for Trump.\n\nA number of attendees and journalists tweeted images and videos from the event:\n\nIn another statement, Trump campaign manager Kellyanne Conway reaffirmed the campaign’s “tremendous working relationship” with the RNC.\n\nFollow the author of this story on Twitter and Facebook:\n\nFollow @LeighMunsil", "link": "http://www.theblaze.com/stories/2016/10/10/trump-campaign-fires-virginia-state-chairman-for-organizing-protest-outside-rnc/?utm_source=TheBlaze.com&utm_medium=rss&utm_campaign=story&utm_content=trump-campaign-fires-virginia-state-chairman-for-organizing-protest-outside-rnc", "logo": null, "left_right_score": 0.32698141593154056, "bias": 5, "facebook_likes": 288, "title": "Trump campaign fires Virginia state chairman for organizing protest outside RNC", "source": "The Blaze"}, "Townhall": {"body": "Hillary Clinton and Donald Trump, the respective presumptive Democratic and Republican nominees, issued statements after today’s horrific attack on law enforcement in Baton Rouge, Louisiana. Clinton called the attack “devastating” adding” there is no justification for violence, for hate, for attacks on men and women who put their lives on the line every day in service of our families and communities.”\n\nTrump asked how many police officers have to die over poor leadership in a post on Facebook. He closed by saying “We demand law and order.” On Twitter, Trump described the country as a divided crime scene.", "link": "http://townhall.com/tipsheet/MattVespa/2016/07/17/trump-clinton-respond-to-baton-rouge-attack-n2193928", "logo": null, "left_right_score": 0.6423955052306997, "bias": 5, "facebook_likes": 12, "title": "Trump, Clinton Respond To Police-Targeted Shootings In Baton Rouge Attack", "source": "Townhall"}, "The Washington Times": {"body": "LONDON (AP) - Britain’s information commissioner plans to apply for a warrant to access the servers of Cambridge Analytica, which allegedly used data mined from Facebook to help Donald Trump win the 2016 presidential election.\nCommissioner Elizabeth Denham said in a statement Monday that she would request the warrant because Cambridge Analytica had been uncooperative with her investigation into whether the company illegally acquired and used Facebook data.\n“This is a complex and far-reaching investigation for my office and any criminal or civil enforcement actions arising from it will be pursued vigorously,” she said.\nDenham launched her investigation after weekend reports that Cambridge Analytica improperly used information from more than 50 million Facebook accounts. Facebook has suspended the company from the social network while it investigates the claims.\nFacebook said Monday that it has put its own audit of the claims on hold at the request of the U.K. information commissioner.\nThe New York Times and the U.K.’s Guardian newspaper reported that the U.K.-based company obtained Facebook account data without the users’ knowledge and retained it after claiming it had been deleted. Chris Wylie, who once worked for Cambridge Analytica, was quoted as saying the company used the data to build psychological profiles so voters could be targeted with ads and stories.\nCambridge Analytica says the information was acquired from a contractor who was contractually obligated to comply with data-protection laws. None of the data was used in the Trump campaign, the company said.\n“I’m not accepting their response so therefore I’ll be applying to the court for a warrant,” Denham told Britain’s Channel 4. “We need to get in there, we need to look at the databases, we need to look at the servers and understand how data was processed or deleted by Cambridge Analytica.”\nThe scandal has also triggered calls for further investigation from the European Union, as well as federal and state officials in the United States.\nThe head of the EU parliament said Monday that the bloc will investigate Facebook’s role in the case.\n“Allegations of misuse of Facebook user data is an unacceptable violation of our citizens’ privacy rights,” Antonio Tajani tweeted. “The European Parliament will investigate fully, calling digital platforms to account.”\nU.S. Sen. Ron Wyden of Oregon and Connecticut Attorney General George Jepsen, both Democrats, have sought written responses from Facebook. Massachusetts Attorney General Maura Healey, also a Democrat, promised an investigation.\nU.K. lawmakers have already called on Facebook CEO Mark Zuckerberg to testify before a parliamentary committee.\n___\nAssociated Press Writers Nick Jessdanun and Barbara Ortutay in New York contributed to this story\nCopyright © 2018 The Washington Times, LLC. \n\nThe Washington Times Comment PolicyThe Washington Times is switching its third-party commenting system from Disqus to Spot.IM. You will need to either create an account with Spot.im or if you wish to use your Disqus account look under the Conversation for the link \"Have a Disqus Account?\".  Please read our \nComment Policy before commenting.", "link": "http://www.washingtontimes.com/news/2018/mar/19/uk-official-to-seek-access-to-cambridge-analyticas/?utm_source=RSS_Feed&utm_medium=RSS", "logo": null, "left_right_score": 0.6959107998390051, "bias": 5, "facebook_likes": 0, "title": "UK official to seek access to Cambridge Analytica’s servers", "source": "The Washington Times"}, "NPR": {"body": "The British data-mining firm Cambridge Analytica has gone from mysterious genius to potential defendant as details emerge of its role in President Trump's 2016 election campaign. With conservative strategist Steve Bannon playing a founding role, backed by money from billionaire Robert Mercer and his daughter Rebekah, the firm was able to develop data from 50 million Facebook users into a psychologically-based strategy to target voters.\n\nNow there are legal questions about how it obtained that Facebook data. Investigations are gearing up in the U.S. and the U.K. The company this week suspended its CEO, Alexander Nix, over comments he made to undercover reporters from the British Television 4 News.\n\nU.S. campaign finance law may have a lot to say about this. Here are some of the biggest questions.\n\n1. Did Cambridge Analytica have a role in running the Trump campaign?\n\nTo hear now-suspended CEO Alexander Nix in the Television 4 News report, his firm handled almost everything except those Make America Great Again caps. He claimed it was responsible for all of the data, research, analytics and targeting, plus the digital and television campaigns. Notably, he said, \"Our data informed all the strategy.\"\n\nBut as a British firm, Cambridge Analytica runs into a federal statute that bars foreign involvement in American elections. The law was strengthened after the 1996 Clinton re-election effort had to disgorge millions of dollars from illegal donors.\n\n\"The Federal Election Campaign Act's prohibition on foreign contributions is the broadest prohibition in the entire statute,\" said Brett Kappel, a partner in the government affairs and public policy practice of the law firm Ackerman in Washington, D.C.\n\nOne provision of the law prohibits foreign nationals from holding decision-making positions in American campaigns. So the Trump campaign could hire Cambridge Analytica, and the firm could recommend, say, an ad-targeting strategy for Wisconsin. But a campaign official — a U.S. citizen or green-card holder — would have to approve it.\n\nNix's comment seems to acknowledge that line; he's saying the firm stayed on the right side of it.\n\n2. Did Cambridge Analytica give or sell the data to the Trump campaign?\n\nIf the answer is yes, it would raise questions.\n\nThe Trump campaign paid the firm a total of $5.9 million, according to Federal Election Commission data processed by the nonprofit Center for Responsive Politics. The campaign's filings say the firm provided data management and survey research. But estimates for how much the data is worth, as processed by Cambridge Analytica, run much higher.\n\nIf the firm gave the data, or sold it at less than fair market value, the transaction would amount to a campaign contribution — a two-fer violation of the law, which bars corporations and foreign nationals from contributing.\n\n3. Did Cambridge Analytica have any other clients?\n\nJust one of note: a superPAC called Make American Number 1. During the campaign it used the name Stop Crooked Hillary PAC. As that suggests — and as Cambridge Analytica executives indicated in the Channel Four report — the superPAC served as an attack dog to supplement the campaign's messages.\n\nAccording to that report, Cambridge Analytica treated the campaign and the superPAC as a single project. This might explain why Stop Crooked Hillary PAC paid the firm almost the same sum as the campaign — $5.7 million — for its services.\n\nCampaigns and superPACs are supposed to be independent of each other. But ironically, the seemingly sleazy arrangement is within the norms of American politics. While the two political entities cannot coordinate their messages, they can hire the same vendor. It's the vendor's duty to set up two teams, walled-off from each other and legally bound to maintain the separation.\n\n4. How much trouble is Cambridge Analytica in?\n\nNothing is proven yet, or even alleged. But it's worth noting that the Justice Department has a small set of \"core prohibitions\" around campaign finance issues that it is vigilant about prosecuting. The core prohibitions include the bans on corporate contributions and on foreign contributions and expenditures, both of which could put Cambridge Analytica in the department's sights.", "link": "https://www.npr.org/2018/03/21/595535935/cambridge-analyticas-role-in-trump-s-2016-campaign-raises-potential-legal-flags?utm_medium=RSS&utm_campaign=news", "logo": "https://media.npr.org/images/podcasts/primary/npr_generic_image_300.jpg?s=200", "left_right_score": 0.020460319385349774, "bias": 3, "facebook_likes": 6205, "title": "Cambridge Analytica's Role In Trump's 2016 Campaign Raises Potential Legal Flags", "source": "NPR"}, "CBN News": {"body": "WASHINGTON – A controversial memo that Republicans say shows the FBI playing politics is expected to be released today at the approval of President Trump.\n\nThe House Intelligence Committee gave the memo to Trump earlier this week and when asked Tuesday if he would make it public he said he would, “100 percent.”\n\nThe memo centers around the 2016 election and how the FBI reportedly targeted a Trump campaign official.\n\nRepublicans say the dossier the agency used to get the warrant to monitor Carter Page, paid for by Democrats, was incomplete and misrepresented to the court.\n\nThe Trump administration believes this memo could discredit Special Counsel Robert Mueller’s Russian collusion investigation which Trump has long called a political “witch hunt.”\n\nWhen and if Trump signs off on declassifying the memo, it will be given to lawmakers who can then release it to the public.", "link": "http://www.cbn.com/api/urlredirect.aspx?u=http://www1.cbn.com/cbnnews/politics/2018/february/president-trump-expected-to-approve-declassification-of-fisa-memo-today", "logo": null, "left_right_score": 0.9386308932416754, "bias": 5, "facebook_likes": 0, "title": "President Trump Expected to Approve Declassification of FISA Memo Today", "source": "CBN News"}, "The Hill": {"body": "Facebook late last week banned the company, saying it violated the platform’s policies by failing to delete data on 50 million of the social media giant’s users. The firm did work for President Trump Donald John TrumpAccuser says Trump should be afraid of the truth Woman behind pro-Trump Facebook page denies being influenced by Russians Shulkin says he has White House approval to root out 'subversion' at VA MORE's 2016 campaign and is also alleged to have links to the Brexit campaign in the United Kingdom.\n\nFacebook is also facing mounting pressure from lawmakers in Washington to explain how the firm was able to get its hand on the data.\n\nHere are five things to watch as the controversy unfolds.\n\nHow much damage has Facebook’s reputation taken?\n\nThis is a big crisis for Facebook, which saw its stock fall 7 percent in trading on Monday.\n\nThe dip suggests that investors expect the Cambridge Analytica scandal to have a material impact on the company, including its reputation among consumers.\n\n“On the consumer level, consumers are very concerned about what’s being collected,” said Michael Priem, CEO of the advertising firm Modern Impact.\n\nHe said it’s possible the controversy will highlight the kinds of information that Facebook has about its users.\n\nLawmakers suggested the news is another reason for Congress to step in.\n\n“It's clear these platforms can't police themselves,” Sen. Amy Klobuchar Amy Jean KlobucharOvernight Health Care: Trump eases rules on insurance outside ObamaCare | HHS office on religious rights gets 300 complaints in a month | GOP chair eyes opioid bill vote by Memorial Day Overnight Regulation: Trump to take steps to ban bump stocks | Trump eases rules on insurance sold outside of ObamaCare | FCC to officially rescind net neutrality Thursday | Obama EPA chief: Reg rollback won't stand Dems seek reversal of nursing home regulatory rollback MORE (D-Minn.) said Sunday.\n\nRepublican Sen. John Kennedy John Neely KennedyMORE (R-La.) joined Klobuchar in sending a letter to Facebook CEO Mark Zuckerberg Mark Elliot ZuckerbergOvernight Tech: Dems turn up the heat on Equifax | Trump's science budget | Inside Rupert Murdoch's fight with Facebook | Cyber experts identify Olympics malware Rupert Murdoch pressured Facebook for changes to help news publishers: report Overnight Tech: GOP bill would bar agencies from using Chinese tech | How Russian accounts used Tumblr during the election | Warren, Equifax spar over breach claims | Dem worries about tech addiction | New lobster emoji MORE asking that he testify to Congress — a move that underlines\n\na new level of skepticism about technology firms among lawmakers.\n\nHow might this be connected to Russia?\n\nCambridge Analytica had already attracted some scrutiny in Washington.\n\nCEO Alexander Nix reached out to WikiLeaks before the 2016 election, according to a\n\nDaily Beast in October. It said that Nix told a third party he contacted WikiLeaks founder Julian Assange about helping to release emails that Democratic presidential nominee Hillary Clinton Hillary Diane Rodham ClintonWoman behind pro-Trump Facebook page denies being influenced by Russians Trump: CNN, MSNBC 'got scammed' into covering Russian-organized rally Pennsylvania Democrats set to win big with new district map MORE had deleted from her private email server while secretary of state.\n\nA spokesman for WikiLeaks confirmed to The Hill at the time that “a request for information from Cambridge Analytica was rejected,” but did not address the content of the interaction.\n\nWikiLeaks went on to release hacked emails from the Democratic National Committee and Clinton campaign chair John Podesta. U.S. intelligence officials have tied the hacks to Russia’s broader effort to interfere in the election.\n\n“We’ve never worked in Russia,” Nix told British Parliament in February. “As far as I’m aware, we’re never worked for a Russian company.”\n\nBut the latest news will lead to new scrutiny.\n\nCambridge is the American offshoot of a British company called SCL Group, which The New York Times reported Saturday had contact with Russian oil company Lukoil in 2014 and 2015.\n\nExecutives at the company were reportedly interested in the way data was used to target U.S. voters.  Lukoil is among the Russian entities sanctioned by the United States over Moscow’s annexation of Ukraine’s Crimean Peninsula.\n\nMoreoever, the British researcher who harvested Facebook data on behalf of Cambridge Analytica is also said to have ties to Moscow.\n\nBritish news outlet The Observer is reporting that the Cambridge University researcher, named Aleksandr Kogan, worked as an associate professor at St. Petersburg State University during the time he was harvesting the data for Cambridge Analytica. His work included accepting grants from the Kremlin to fund social media research, the Observer reported.\n\nWhat does it mean for the Mueller probe?\n\nThe latest revelations could provide fodder for special counsel Robert Mueller Robert Swan MuellerSasse: US should applaud choice of Mueller to lead Russia probe MORE’s sprawling investigation into Russian interference in the election, including whether there was coordination between Trump’s campaign and Moscow.\n\nMueller will almost certainly be interested in how the firm leveraged Facebook data, and whether any information may have been shared with Russia-linked individuals.\n\nThe new revelations about Cambridge come after Mueller indicted 13 Russians and three Russian groups in an elaborate plot that involved using Facebook and other social media platforms to spread divisive political and social content to American audiences ahead of the election.\n\nThe Wall Street Journal reported in December that Mueller had requested that Cambridge Analytica turn over documents as part of his investigation.\n\nPeople already ensnared in Mueller’s investigation have ties to Cambridge.\n\nFormer White House chief strategist Steve Bannon Stephen (Steve) Kevin BannonIt’s time for conservatives to retire the term ‘alt-right’   Kurtz sees media forfeiting credibility in war with Trump Bannon wanted Trump to keep Yellen as Fed chair: report MORE, who was reportedly interviewed by the special counsel’s office for 20 hours in February, once served on Cambridge’s board. Former national security adviser Michael Flynn, who Mueller charged with making false statements to the FBI, disclosed a brief advisory role with the data firm in an amended filing last summer.\n\nThe Trump campaign paid Cambridge Analytics $5.9 million for data management services between 2015 and 2016, according to campaign finance records.\n\nHowever, the campaign appeared to distance itself from Cambridge last year as the company attracted scrutiny over Nix’s WikiLeaks contacts, describing the Republican National Committee as its “main source for data analytics.”\n\nWhat else are we going to learn about Cambridge Analytica?\n\nLawmakers have made it clear that they will demand much more information from Cambridge Analytica.\n\nThe House Intelligence Committee’s top Democrat, Rep. Adam Schiff Adam Bennett SchiffGOP strategist confronts ex-Trump staffer: ‘I’m sick of you guys making excuses for him’ Shepard Smith goes after Trump for not condemning Russia in tweets Trump: Why didn't Obama 'do something about Russian meddling?' MORE (Calif.) said that he wants answers on the level of detail of the data that Cambridge Analytica had about Facebook users. He also wants to know whether this information was acquired illegally and whether the information was “abused” to help the Trump campaign or bolster the Brexit vote.\n\nFacebook will also have to provide answers to Schiff on how it dealt with Cambridge Analytica, including information on why it “provided private user information to an academic, how they have informed users in advance of these kinds of data transfers, and whether it can demonstrate that this data has indeed been destroyed.”\n\nThe House Intelligence Committee had already requested documents from Cambridge Analytica and interviewed Nix in December as part of its investigation into Russian interference, which the Republican leaders are currently winding down despite backlash from Democrats.\n\nOther lawmakers, including the Senate Intelligence Committee’s top Democrat Sen. Mark Warner Mark Robert WarnerLawmakers worry about rise of fake video technology Mueller indictment reveals sophisticated Russian manipulation effort GOP cautious, Dems strident in reaction to new indictments MORE (D-Va.) and Sen. Edward Markey Edward (Ed) John MarkeyRegulators seek to remove barriers to electric grid storage Markey, Paul want to know if new rules are helping opioid treatment Oil spill tax on oil companies reinstated as part of budget deal MORE (D-Mass.) have also publicly said that they want more answers from Facebook and Cambridge Analytica.\n\nCould Cambridge Analytica have had a big effect on the election?\n\nExperts say that the large swath of data Cambridge Analytica had would be highly valuable for targeting U.S. voters over Facebook.\n\n“The potential of this data to have massive impact on the elections is huge if it was used to its fullest extent,” said Alan Rosenblatt, a partner at the digital strategy group Lake Research partners, which is aligned with Democrats.\n\nBert Huang, a computer science professor at Virginia Tech University, explained that the data could give Cambridge a significant leg up when it comes to targeting Facebook.\n\nEven with such information, however, experts say it would be virtually impossible to measure the magnitude of Cambridge Analytica’s effect on the election.\n\n“This is like trying to get the toothpaste back in the tube,” Huang said.\n\n“I don’t know how you would do it, and I don’t know how you would do it [even] if you had access to all of the data in the world.”\n\nIt remains unclear exactly how Cambridge Analytica used the information. On Monday, the firm pushed back on allegations of data misuse, saying in a statement that \"”his Facebook data was not used by Cambridge Analytica as part of the services it provided to the Donald Trump presidential campaign; personality targeted advertising was not carried out for this client either.”", "link": "http://thehill.com/policy/cybersecurity/379209-cambridge-analytica-five-things-to-watch", "logo": null, "left_right_score": 0.001699414610145778, "bias": 3, "facebook_likes": 93, "title": "Cambridge Analytica: Five things to watch", "source": "The Hill"}, "Reuters": {"body": "KUALA LUMPUR (Reuters) - The Malaysian government and the ruling party on Tuesday denied they had ever hired Cambridge Analytica, the British data analytics firm accused of improperly harvesting personal data from millions of Facebook users. \nA Facebook logo is seen at the Facebook Gather conference in Brussels, Belgium, January 23, 2018. REUTERS/Yves Herman/Files\n\nThe New York Times and the British Observer reported that Cambridge Analytica had acquired private data harvested from more than 50 million Facebook users to support Donald Trump’s 2016 presidential election campaign. \nIn a secretly recorded video by Britain’s Channel 4 News, Cambridge Analytica officials were also recorded saying they have used a web of shell companies to disguise their activities in elections in Malaysia, Mexico and Brazil, among various countries where they have worked to sway election outcomes. \n“Contrary to media reports, neither Cambridge Analytica nor its parent company SCL Group have ever – now or in the past – been contracted, employed or paid in any way by Barisan Nasional, the Prime Minister’s Office or any part of the Government of Malaysia,” the office of Malaysian prime minister Najib Razak said on Tuesday. Barisan Nasional (BN) is Malaysia’s ruling coalition.  \nSCL and Cambridge Analytica did not respond to requests by Reuters for comment regarding their work in Malaysia. Cambridge Analytica had earlier denied all the media claims and said it deleted the data after learning the information did not adhere to data-protection rules.  \nMalaysia is gearing up for national elections that have to be called by August, with sources telling Reuters that polls may be held as early as April. Najib’s coalition is widely expected to retain power.  \nNajib’s office also said SCL has informed the government that “Cambridge Analytica’s advice on the 2013 general election was provided personally to Mukhriz Mahathir,” who was then with the ruling coalition but is now part of the opposition.  \n“The SCL representative also confirmed that he reported directly to Mukhriz Mahathir, not BN or the government,” Najib’s office said. \nMukhriz told Reuters that the statement by PMO was misleading.  \n“I categorically deny any contact with Cambridge Analytica at any time,” he said. Earlier in the day, he denied receiving any analysis, data or advice from the firm.  \nMukhriz is the son of the former Malaysian premier Mahathir Mohamad, who is now the opposition’s prime ministerial candidate.  \nAccording to Cambridge Analytica’s website, the firm “supported Barisan Nasional in Kedah state with a targeted messaging campaign highlighting their school improvements since 2008.” It also notes how BN wrested power back from the opposition in the 2013 elections.  \nMukhriz was appointed chief minister of Kedah after the 2013 win, but he was sacked by the ruling party in 2016 after being critical of Najib in a corruption scandal. \nReporting by A. Ananthalakshmi and Praveen Menon, editing by Larry King", "link": "http://feeds.reuters.com/~r/reuters/INtechnologyNews/~3/zlGatfyu5qA/malaysia-says-never-hired-british-data-firm-at-centre-of-scrutiny-idINKBN1GW1Y3", "logo": "http://in.reuters.com/resources_v2/images/reuters125.png", "left_right_score": 0.011931244355132358, "bias": 3, "facebook_likes": 0, "title": "Malaysia says never hired British data firm at centre of scrutiny", "source": "Reuters"}, "The New York Times": {"body": "The documents also raise new questions about Facebook, which is already grappling with intense criticism over the spread of Russian propaganda and fake news. The data Cambridge collected from profiles, a portion of which was viewed by The Times, included details on users’ identities, friend networks and “likes.”\n\n“Protecting people’s information is at the heart of everything we do,” Mr. Grewal said. “No systems were infiltrated, and no passwords or sensitive pieces of information were stolen or hacked.”\n\nStill, he added, “it’s a serious abuse of our rules.”\n\nThe Bordeaux flowed freely as Mr. Nix and several colleagues sat down for dinner at the Palace Hotel in Manhattan in late 2013, Mr. Wylie recalled in an interview. They had much to celebrate.\n\nMr. Nix, a brash salesman, led the small elections division at SCL Group, a political and defense contractor. He had spent much of the year trying to break into the lucrative new world of political data, recruiting Mr. Wylie, then a 24-year-old political operative with ties to veterans of President Obama’s campaigns. Mr. Wylie was interested in using inherent psychological traits to affect voters’ behavior and had assembled a team of psychologists and data scientists, some of them affiliated with Cambridge University.\n\nThe group experimented abroad, including in the Caribbean and Africa, where privacy rules were lax or nonexistent and politicians employing SCL were happy to provide government-held data, former employees said.\n\nThen a chance meeting bought Mr. Nix into contact with Mr. Bannon, the Breitbart News firebrand who would later become a Trump campaign and White House adviser, and with Mr. Mercer, one of the richest men on earth.\n\nMr. Nix and his colleagues courted Mr. Mercer, who believed a sophisticated data company could make him a kingmaker in Republican politics, and his daughter Rebekah, who shared his conservative views. Mr. Bannon was intrigued by the possibility of using personality profiling to shift America’s culture and rewire its politics, recalled Mr. Wylie and other former employees, who spoke on the condition of anonymity because they had signed nondisclosure agreements. Through a spokeswoman, Mr. Bannon declined to comment.\n\nMr. Mercer agreed to help finance a $1.5 million pilot project to poll voters and test psychographic messaging in Virginia’s gubernatorial race in November 2013, where the Republican attorney general, Ken Cuccinelli, ran against Terry McAuliffe, the Democratic fund-raiser. Though Mr. Cuccinelli lost, Mr. Mercer committed to moving forward.\n\nThe Mercers wanted results quickly, and more business beckoned. In early 2014, the investor Toby Neugebauer and other wealthy conservatives were preparing to put tens of millions of dollars behind a presidential campaign for Senator Ted Cruz of Texas, work that Mr. Nix was eager to win.\n\nWhen Mr. Wylie’s colleagues failed to produce a memo explaining their work to Mr. Neugebauer, Mr. Nix castigated them over email.\n\n“ITS 2 PAGES!! 4 hours work max (or an hour each). What have you all been doing??” he wrote.\n\nMr. Wylie’s team had a bigger problem. Building psychographic profiles on a national scale required data the company could not gather without huge expense. Traditional analytics firms used voting records and consumer purchase histories to try to predict political beliefs and voting behavior.\n\nBut those kinds of records were useless for figuring out whether a particular voter was, say, a neurotic introvert, a religious extrovert, a fair-minded liberal or a fan of the occult. Those were among the psychological traits the firm claimed would provide a uniquely powerful means of designing political messages.\n\nMr. Wylie found a solution at Cambridge University’s Psychometrics Centre. Researchers there had developed a technique to map personality traits based on what people had liked on Facebook. The researchers paid users small sums to take a personality quiz and download an app, which would scrape some private information from the their profiles and those of their friends, activity that Facebook permitted at the time. The approach, the scientists said, could reveal more about a person than their parents or romantic partners knew — a claim that has been disputed.\n\nWhen the Psychometrics Centre declined to work with the firm, Mr. Wylie found someone who would: Dr. Kogan, who was then a psychology professor at the university and knew of the techniques. Dr. Kogan built his own app and in June 2014 began harvesting data for Cambridge Analytica. The business covered the costs — more than $800,000 — and allowed him to keep a copy for his own research, according to company emails and financial records.\n\nAll he divulged to Facebook, and to users in fine print, was that he was collecting information for academic purposes, the social network said. It did not verify his claim. Dr. Kogan declined to provide details of what happened, citing nondisclosure agreements with Facebook and Cambridge Analytica, though he maintained that his program was “a very standard vanilla Facebook app.”\n\nHe ultimately provided over 50 million raw profiles to the firm, Mr. Wylie said, a number confirmed by a company email and a former colleague. Of those, roughly 30 million contained enough information, including places of residence, that the company could match users to other records and build psychographic profiles. Only about 270,000 users — those who participated in the survey — had consented to having their data harvested.\n\nMr. Wylie said the Facebook data was “the saving grace” that let his team deliver the models it had promised the Mercers.\n\n“We wanted as much as we could get,” he acknowledged. “Where it came from, who said we could have it — we weren’t really asking.”\n\nMr. Nix tells a different story. Appearing before a parliamentary committee last month, he described Dr. Kogan’s contributions as “fruitless.”\n\nJust as Dr. Kogan’s efforts were getting underway, Mr. Mercer agreed to invest $15 million in a joint venture with SCL’s elections division. The partners devised a convoluted corporate structure, forming a new American company, owned almost entirely by Mr. Mercer, with a license to the psychographics platform developed by Mr. Wylie’s team, according to company documents. Mr. Bannon, who became a board member and investor, chose the name: Cambridge Analytica.\n\nThe firm was effectively a shell. According to the documents and former employees, any contracts won by Cambridge, originally incorporated in Delaware, would be serviced by London-based SCL and overseen by Mr. Nix, a British citizen who held dual appointments at Cambridge Analytica and SCL. Most SCL employees and contractors were Canadian, like Mr. Wylie, or European.\n\nBut in July 2014, an American election lawyer advising the company, Laurence Levy, warned that the arrangement could violate laws limiting the involvement of foreign nationals in American elections.\n\nIn a memo to Mr. Bannon, Ms. Mercer and Mr. Nix, the lawyer, then at the firm Bracewell & Giuliani, warned that Mr. Nix would have to recuse himself “from substantive management” of any clients involved in United States elections. The data firm would also have to find American citizens or green card holders, Mr. Levy wrote, “to manage the work and decision making functions, relative to campaign messaging and expenditures.”\n\nIn summer and fall 2014, Cambridge Analytica dived into the American midterm elections, mobilizing SCL contractors and employees around the country. Few Americans were involved in the work, which included polling, focus groups and message development for the John Bolton Super PAC, conservative groups in Colorado and the campaign of Senator Thom Tillis, the North Carolina Republican.\n\nCambridge Analytica, in its statement to The Times, said that all “personnel in strategic roles were U.S. nationals or green card holders.” Mr. Nix “never had any strategic or operational role” in an American election campaign, the company said.\n\nWhether the company’s American ventures violated election laws would depend on foreign employees’ roles in each campaign, and on whether their work counted as strategic advice under Federal Election Commission rules.\n\nCambridge Analytica appears to have exhibited a similar pattern in the 2016 election cycle, when the company worked for the campaigns of Mr. Cruz and then Mr. Trump. While Cambridge hired more Americans to work on the races that year, most of its data scientists were citizens of the United Kingdom or other European countries, according to two former employees.\n\nUnder the guidance of Brad Parscale, Mr. Trump’s digital director in 2016 and now the campaign manager for his 2020 re-election effort, Cambridge performed a variety of services, former campaign officials said. That included designing target audiences for digital ads and fund-raising appeals, modeling voter turnout, buying $5 million in television ads and determining where Mr. Trump should travel to best drum up support.\n\nCambridge executives have offered conflicting accounts about the use of psychographic data on the campaign. Mr. Nix has said that the firm’s profiles helped shape Mr. Trump’s strategy — statements disputed by other campaign officials — but also that Cambridge did not have enough time to comprehensively model Trump voters.\n\nIn a BBC interview last December, Mr. Nix said that the Trump efforts drew on “legacy psychographics” built for the Cruz campaign.\n\nBy early 2015, Mr. Wylie and more than half his original team of about a dozen people had left the company. Most were liberal-leaning, and had grown disenchanted with working on behalf of the hard-right candidates the Mercer family favored.\n\nCambridge Analytica, in its statement, said that Mr. Wylie had left to start a rival firm, and that it later took legal action against him to enforce intellectual property claims. It characterized Mr. Wylie and other former “contractors” as engaging in “what is clearly a malicious attempt to hurt the company.”\n\nNear the end of that year, a report in The Guardian revealed that Cambridge Analytica was using private Facebook data on the Cruz campaign, sending Facebook scrambling. In a statement at the time, Facebook promised that it was “carefully investigating this situation” and would require any company misusing its data to destroy it.\n\nFacebook verified the leak and — without publicly acknowledging it — sought to secure the information, efforts that continued as recently as August 2016. That month, lawyers for the social network reached out to Cambridge Analytica contractors. “This data was obtained and used without permission,” said a letter that was obtained by the Times. “It cannot be used legitimately in the future and must be deleted immediately.”\n\nMr. Grewal, the Facebook deputy general counsel, said in a statement that both Dr. Kogan and “SCL Group and Cambridge Analytica certified to us that they destroyed the data in question.”\n\nBut copies of the data still remain beyond Facebook’s control. The Times viewed a set of raw data from the profiles Cambridge Analytica obtained.\n\nWhile Mr. Nix has told lawmakers that the company does not have Facebook data, a former employee said that he had recently seen hundreds of gigabytes on Cambridge servers, and that the files were not encrypted.\n\n\n\nToday, as Cambridge Analytica seeks to expand its business in the United States and overseas, Mr. Nix has mentioned some questionable practices. This January, in undercover footage filmed by Channel 4 News in Britain and viewed by The Times, he boasted of employing front companies and former spies on behalf of political clients around the world, and even suggested ways to entrap politicians in compromising situations.\n\nAll the scrutiny appears to have damaged Cambridge Analytica’s political business. No American campaigns or “super PACs” have yet reported paying the company for work in the 2018 midterms, and it is unclear whether Cambridge will be asked to join Mr. Trump’s re-election campaign.\n\nIn the meantime, Mr. Nix is seeking to take psychographics to the commercial advertising market. He has repositioned himself as a guru for the digital ad age — a “Math Man,” he puts it. In the United States last year, a former employee said, Cambridge pitched Mercedes-Benz, MetLife and the brewer AB InBev, but has not signed them on.", "link": "https://www.nytimes.com/2018/03/17/us/politics/cambridge-analytica-trump-campaign.html?partner=rss&emc=rss", "logo": "https://static01.nyt.com/images/misc/NYT_logo_rss_250x40.png", "left_right_score": 0.0006965604061398598, "bias": 2, "facebook_likes": 81068, "title": "How Trump Consultants Exploited the Facebook Data of Millions", "source": "The New York Times"}, "Fox News": {"body": "Sen. Graham also says ex-FBI chief Comey should testify again about the Clinton probe; Catherine Herridge goes in-depth for 'Special Report'\n\t                        \t\n\t\t\t\t\t \n\t\t\t\t  \n              \n            \n\t\t \n\n           \n       \n      \n          \n              President Trumpâ\u0080\u0099s eldest son, Donald Trump Jr., corresponded with WikiLeaks before the 2016 presidential election, a dialogue of which the presidentâ\u0080\u0099s son confirmed Monday night on Twitter.\n              \n                  \n                  \n              \n              \n               \n              \n              \n              \n\n\n              \n          \n              In a series of tweets, Trump Jr. produced â\u0080\u009cthe entire chain of messages with @wikileaks (with my whopping 3 responses) which one of the congressional committees has chosen to selectively leak. How ironic!â\u0080\u009d\n              \n              \n               \n              \n              \n              \n\n\n\n    \n    \n    \n        \n    \n\n\n\n\n\n    \n    \n    \n        \n    \n\n\n\n\n\n    \n    \n    \n        \n    \n\n\n\n\n              \n          \n              The Atlantic first reported on Monday that Trump Jr. received a private message from the WikiLeaks Twitter account on September 20, 2016 â\u0080\u0094 a message shown in the tweets produced by the presidentâ\u0080\u0099s son.\n              \n              \n                             \t\t\n\t\t\t\t\t\n              \n              \n              \n              \n\n\n              \n          \n              â\u0080\u009cA PAC run anti-Trump site putintrump.org is about to launch,â\u0080\u009d WikiLeaks wrote. â\u0080\u009cThe PAC is a recycled pro-Iraq war PAC. We have guessed the password. It is â\u0080\u0098putintrump.â\u0080\u0099 See â\u0080\u0098Aboutâ\u0080\u0099 for who is behind it. Any comments?â\u0080\u009d\n              \n              \n               \n              \n              \n              \n\n\n              \n          \n              Trump Jr. replied, â\u0080\u009cOff the record I donâ\u0080\u0099t know who that is, but Iâ\u0080\u0099ll ask around. Thanks.â\u0080\u009d\n              \n              \n               \n              \n              \n              \n\n\n              \n          \n              In a separate October 2016 exchange, WikiLeaks urged Trump Jr. to â\u0080\u009ccomment on/push this storyâ\u0080\u009d about then-Democratic presidential nominee Hillary Clinton wanting to â\u0080\u009cjust droneâ\u0080\u009d Julian Assange, the Wikileaks founder.\n              \n              \n               \n              \n              \n              \n\n\n    \n    \n    \t\n\t\t\n    \n\n\n\n\n\n\n\n              \n                  \n              \n          \n              â\u0080\u009cAlready did that earlier today,â\u0080\u009d Trump Jr. later replied. â\u0080\u009cItâ\u0080\u0099s amazing what she can get away with.â\u0080\u009d\n              \n              \n               \n              \n              \n              \n\n\n              \n          \n              The messages obtained by The Atlantic were turned over to investigators by Trump Jr.â\u0080\u0099s attorneys. The House Permanent Select Committee on Intelligence had access to the documents, a source told Fox News.\n              \n              \n               \n              \n              \n              \n\n\n              \n          \n              â\u0080\u009cOver the last several months, we have worked cooperatively with each of the committees and have voluntarily turned over thousands of documents in response to their requests,â\u0080\u009d Alan Futerfas, an attorney for Trump Jr., said in a statement.\n              \n              \n               \n              \n              \n              \n\n\n    \n    \n    \t\n\t\t\n    \n\n\n\n\n\n\n\n              \n          \n              â\u0080\u009cPutting aside the question as to why or by whom such documents, provided to Congress under promises of confidentiality, have been selectively leaked, we can say with confidence that we have no concerns about these documents and any questions raised about them have been easily answered in the appropriate forum.â\u0080\u009d\n              \n              \n               \n              \n              \n              \n\n\n              \n          \n              According to the report, the messages are part of a long correspondence between WikiLeaks and Trump Jr., though Trump Jr. seemed to ignore many of the messages, including some which urged him to release â\u0080\u009cone or more of your fatherâ\u0080\u0099s tax returns.â\u0080\u009d\n              \n              \n               \n              \n              \n              \n\n\n              \n          \n              President Trumpâ\u0080\u0099s attorney Ty Cobb told Fox News on Monday that he was not aware that Donald Trump Jr.â\u0080\u0099s attorneys provided these documents to congressional investigators, but said there is likely no legal issue, from what he knows of the documents.\n              \n              \n               \n              \n              \n              \n\n\n              \n          \n              Wikileaks publisher Julian Assange tweeted about the report on Monday, saying that the organization couldnâ\u0080\u0099t â\u0080\u009cconfirmâ\u0080\u009d the messages with Trump Jr.\n              \n              \n               \n              \n              \n              \n\n\n              \n          \n              Wikileaks â\u0080\u009cdoes not keep such records and the Atlanticâ\u0080\u0099s presentation is edited and clearly does not have the full context,â\u0080\u009d Assange wrote.\n              \n              \n               \n              \n              \n              \n\n\n\n    \n    \n    \n        \n    \n\n\n\n\n              \n          \n              â\u0080\u009cWikiLeaks loves its pending publications and ignores those who ask for details,â\u0080\u009d Assange continued. â\u0080\u009cTrump Jr. was rebuffed just like Cambridge Analytica. In both cases WikiLeaks had publicly teased the publications. Thousands of people asked about them. WikiLeaks can be very effective at convincing even high profile people that it is their interest to promote links to its publications.\n              \n              \n               \n              \n              \n              \n\n\n\n    \n    \n    \n        \n    \n\n\n\n\n\n    \n    \n    \n        \n    \n\n\n\n\n              \n          \n              â\u0080\u009cWikiLeaks has such chutzpah that it allegedly tried to convince Trump Jr to leak his fatherâ\u0080\u0099s tax returns  his own â\u0080\u009cRussian lawyer meetingâ\u0080\u009d emails (he did),â\u0080\u009d Assange wrote. â\u0080\u009cWikiLeaks appears to beguile some people into transparency by convincing them that it is in their interest.â\u0080\u009d\n              \n              \n               \n              \n              \n              \n\n\n\n    \n    \n    \n        \n    \n\n\n\n\n              \n          \n              Assange also claimed that the â\u0080\u009cfull text of alleged DMs with context provides a different reading, unsurprisingly.â\u0080\u009d\n              \n              \n               \n              \n              \n              \n\n\n\n    \n    \n    \n        \n    \n\n\n\n\n              \n          \n              This is not the first time that Trump Jr. has been in the spotlight, and has had his actions brought into question amid the larger probe into Russian meddling and potential collusion with Trump campaign associates in the 2016 presidential election.\n              \n              \n               \n              \n              \n              \n\n\n              \n          \n              In June 2016, Trump Jr. accepted a now-highly scrutinized meeting with Russian attorney Natalia Veselnitskaya, after he allegedly was promised â\u0080\u009cdirtâ\u0080\u009d on Hillary Clinton. The meeting was brokered by music publicist Rob Goldstone who promised the campaign information. Jared Kushner and Paul Manafort, who was charged last month in Special Counsel Robert Muellerâ\u0080\u0099s probe into Russian collusion, also attended the meeting.\n              \n              \n               \n              \n              \n              \n\n\n              \n          \n              Fox Newsâ\u0080\u0099 Matt Richardson and John Roberts contributed to this report. \n              \n              \n               \n              \n              \n              \n\n\n              \n          \n  \n          \n              \n              \n\n\n \n\n\t\n\t\t\n\t\t\tBrooke Singman is a Politics Reporter for Fox News. Follow her on Twitter at @brookefoxnews.", "link": "http://feeds.foxnews.com/~r/foxnews/most-popular/~3/jCLYs6qYaWA/donald-trump-jr-releases-messages-with-wikileaks-from-before-election.html", "logo": "http://tools.foxnews.com/sites/tools.foxnews.com/files/images/fox-news-logo.png", "left_right_score": 0.3046936124947295, "bias": 4, "facebook_likes": 0, "title": "Donald Trump Jr. releases messages with WikiLeaks from before election", "source": "Fox News"}, "Bloomberg": {"body": "Cambridge Analytica, the Trump-campaign data firm embroiled in scandal over its misuse of Facebook accounts, suspended Chief Executive Officer Alexander Nix after he was filmed bragging about dirty tricks. But the business’s ties to Nix and dubious tactics run deep.\nHe retains a large ownership stake in Cambridge Analytica’s affiliated companies, and many of its top executives share his history of questionable campaign techniques. Nix remains a director and retains partial ownership of Cambridge Analytica’s British affiliate, SCL Group, which continues to work on political campaigns around the world and for governments. It signed a contract with the U.S. State Department last week.\nAlexander Nix leaves Cambridge Analytica’s offices in London, on March 20.\n\nPhotographer: Chris J. Ratcliffe/Bloomberg\nSCL also has deep ties to the U.K.’s Conservative Party, forcing Prime Minister Theresa May to distance her party from the firm. British lawmakers are calling for an investigation into SCL’s activities and why the Ministry of Defense granted the company access to secret government documents.\n\n        \n        The company said bribes and fake IDs “do not represent the values or operations of the firm” and Nix denies he engaged in such activities.\n\n        \n        Cambridge Analytica and SCL share a London office and many staff members. Receptionists say “Cambridge Analytica” when answering calls to SCL’s London phone number. Cambridge Analytica also takes credit on its website for many of SCL’s political campaigns.\nRead more: The Facebook-Cambridge Analytica saga explained\nIn an interview with Bloomberg last year, Nix said the two companies overlap and share methodology and data analytics. But even he seemed at a loss to define the border between them. “There’s a relationship there,” Nix said, adding when pressed: “It’s just not clear what the relationship is.” Nix, with his mother and sister, still owns roughly 25 percent of SCL Group, according to company records.\nNeither Cambridge Analytica nor SCL returned calls seeking comment for this story.\nPhotographer: Oliver Contreras/For The Washington Post via Getty Images\n\n        \n        Cambridge Analytica is partly owned by the family of hedge-fund chief Robert Mercer, a big donor and supporter of President Donald Trump, but Nix’s ties to the family go far beyond that link. Earlier this year, Nix joined other SCL colleagues on the board of a new company, Emerdata Ltd., which shares an address with SCL. This month, Mercer’s daughters Rebekah and Jennifer joined Emerdata’s board, according to Companies House, a British government website.\nEmerdataOther Emerdata directors include Johnson Ko Chun Shun, deputy chairman of Hong Kong-based Frontier Services Group, which is chaired by Blackwater Security Consulting founder and Trump backer Erik Prince. Also on the board is Cheng Peng, whose address is the same as Luk Fook Financial Services, the parent company of the firm that helped Frontier place new shares last year.\nEmerdata was set up in 2017 by Julian Wheatland, the chairman of SCL, and Alex Tayler, Cambridge Analytica’s chief data officer, who was appointed to replace Nix as CEO while the company conducts its investigation. Tayler and Wheatland resigned from Emerdata in January.\nTayler, who earned a Ph.D. in chemical engineering from University of Cambridge, worked side-by-side with Nix on Trump’s 2016 election campaign.\nIn an interview last year, Tayler told Bloomberg that Cambridge Analytica helped the campaign predict rural-voter turnout and target messages.\nTracker Poll“The methodology is about listening to your audience through large-scale polling and research married with data about those individuals that you acquired from different sources,” he said. He said the company ran a weekly “tracker poll” in every U.S. state that allowed the Trump campaign to gauge how its message was resonating and then shift resources accordingly.\nPreviously, SCL worked on hundreds of election campaigns around the world, from the Caribbean to Latvia and Nigeria, where it sometimes engaged in questionable tactics, such as discouraging opposition voters, according to the company’s sales documents. Nix denies that SCL has ever “undertaken any campaign to discourage voting or undermine the democratic process.”\nMark Turnbull, managing director of Cambridge Analytica’s political arm, remains at the company after being caught on camera talking about how the firm could push out damaging material on an opponent through social media without leaving a trace.\nInto The Bloodstream“We just put information into the bloodstream of the internet and then watch it grow, give it a little push every now and again,” he was filmed telling an undercover reporter posing as a potential client from Sri Lanka.\nTurnbull joined Cambridge Analytica and SCL in May 2016 to work on election campaigns. He’d spent 16 years at Bell Pottinger, the London public-relations firm, where he focused on “stabilisation, counter-radicalisation and democratic reform in zones of conflict” according to his LinkedIn profile.\nAmong Turnbull’s jobs at Bell Pottinger was overseeing the company’s activities in Iraq. Bell Pottinger worked on propaganda campaigns for the U.S. and British Coalition Provisional Authority in the wake of the U.S. invasion in 2003 and later had a contract with the U.S. military. The firm played a key role in helping the campaigns of Iraqi political candidates favored by the U.S. and British. Later, it worked to combat Al Qaeda in Iraq.\nFake NewsBell Pottinger’s tactics included producing phony television news reports as well as fake terrorist propaganda videos containing computer code that allowed Western intelligence agencies to track anyone who watched, according to a 2016 report from the London-based Bureau of Investigative Journalism, a not-for-profit reporting organization.\nThe man who awarded Turnbull’s Bell Pottinger unit its first Iraq contract was Ian Tunnicliffe, then a British colonel who was running strategic communications for the U.K. defense ministry. Tunnicliffe, now retired, has been a member of SCL’s advisory board. He didn’t respond to emails seeking comment.\nSCL also stoked ethnic tensions in Eastern Europe and sprayed fake graffiti in the Caribbean, according to the firm’s own sales documents. Its defense business claims in pitch documents to have worked for clients as wide-ranging as the Libyan National Transitional Council, NATO and the U.K. Foreign Office. It says it worked in Pakistan for the U.S. Department of Defense and the U.S. Pacific Command in India on countering radicalization.\nSCL recently signed a contract with the U.S. State Department for market research and public-opinion polling, according to a federal procurement database. The one-year contract, signed last week, is worth $496,232, according to the database.\nDeep TiesThe firm also has deep ties to the British defense establishment and Conservative Party. Its first chairman was Geoffrey Pattie, a defense minister under Margaret Thatcher. In addition to Tunnicliffe, the advisory board has included retired Rear Admiral John Tolhurst and Ivar Mountbatten, the great-nephew of Louis Mountbatten, the military hero and Queen Elizabeth’s cousin. Jonathan Marland, a former Conservative Party treasurer who served as a minister for business under former Prime Minister David Cameron, is a shareholder.\nMarland told the Guardian newspaper he hadn’t had a role in running SCL following his initial investment and had refused requests to introduce the firm to Conservative Party officials.\nRoger Gabb, a former British Army officer who later made his fortune as a wine distributor and wholesaler, is also a major SCL shareholder. A founding director who, with his family, still controls about 25 percent of the firm’s shares, Gabb has also been active in the Conservative Party and the campaign for the U.K. to leave the European Union. He donated 500,000 pounds ($705,300) to the party in 2006. In 2016, he was fined 1,000 pounds by the U.K.’s Electoral Commission for failing to disclose that he had helped purchase local newspaper advertisements supporting the leave side in the Brexit referendum.", "link": "https://www.bloomberg.com/news/articles/2018-03-23/cambridge-analytica-suspends-ceo-nix-but-he-and-his-work-live-on", "logo": null, "left_right_score": 0.0038577464447247, "bias": 3, "facebook_likes": 58, "title": "The Work of Cambridge Analytica’s Suspended CEO Will Carry On", "source": "Bloomberg"}, "Daily Beast": {"body": "Cambridge Analytica hoped to capitalize on Russian hacking of Hillary Clinton and her ally, an email written by one of its employees indicates. \nEmily Cornell, the employee, sent the email on July 29, 2016. It went out to people working with Make America Number One, the pro-Trump super PAC funded by Republican super-donors Robert and Rebekah Mercer. \nAfter noting some of the firm’s work for the super PAC, Cornell wrote: “With her campaign getting hacked, I can only imagine what a new swatch [sic] of emails will do to her already fractured base!” \nCornell did not respond to multiple requests for comment on the email. A spokesperson for Cambridge Analytica also did not respond to requests for comment. \nOn July 22, seven days before Cornell’s email, Wikileaks had published almost 20,000 emails it had stolen from the Democratic National Committee. The hack—which included emails showing some DNC officials pushing for Hillary Clinton over Bernie Sanders in the primary—threw the Democratic Party into turmoil. Then-DNC Chair Debbie Wasserman Schultz resigned from her post because of the hack. On July 27, then-candidate Trump said in a press conference that he hoped Kremlin-backed individuals would find emails Clinton deleted as secretary of state. \n“Russia, if you’re listening, I hope you’re able to find the 30,000 emails that are missing,” he said.\nHis allies later said he was joking. \nCambridge Analytica has drawn intense scrutiny since the election. This week, the UK’s Channel 4 released two documentaries on the company’s internal practices based on hidden-camera footage. In one, a Cambridge Analytica official says the company used Ukrainian sex workers to try to entrap its clients’ political foes. \n“Just saying we could bring some Ukrainians in,” the firm’s CEO Alexander Nix said to journalists posing as prospective clients. “They are very beautiful. I find that works very well.”\nCambridge Analytica announced on Tuesday it has suspended Nix pending an independent investigation. \n“Mr. Nix’s recent comments secretly recorded by Channel 4 and other allegations do not represent the values or operations of the firm and his suspension reflects the seriousness with which we view this violation,” the firm said in a statement.", "link": "https://www.thedailybeast.com/cambridge-analytica-looked-to-pounce-on-russian-hacks-email-shows?source=politics_sum&via=rss", "logo": "https://www.thedailybeast.com/static/images/square_logo_1x.16983b61.png", "left_right_score": 0.020461827710889148, "bias": 1, "facebook_likes": 314, "title": "Cambridge Analytica Looked to Pounce on Russian Hacks, Email Shows", "source": "Daily Beast"}}