{"The Guardian": {"body": "That was Donald Trump’s advice to the American people on Friday as he sought to fight back against a fresh avalanche of allegations about his ties to Russia.\n\nTrue to his philosophy that attack is always the best form of defence, Trump tweeted an old photo of Chuck Schumer, the Democratic minority leader in the Senate, smiling alongside the Russian president, Vladimir Putin.\n\nIn the picture, both men are smiling and holding paper cups outside a shop. Schumer has taken a bite from his doughnut, while Putin is looking down at his with a little less enthusiasm.\n\n“We should start an immediate investigation into @SenSchumer and his ties to Russia and Putin,” Trump wrote in the tweet. “A total hypocrite!”\n\nHalf an hour later, Schumer tweeted back and said the meeting happened 14 years ago. “Happily talk re: my contact w Mr. Putin & his associates, took place in ’03 in full view of press & public under oath. Would you &your team?”\n\nIt was the latest round of sparring between two New Yorkers with a long history. Trump, 70, a former Democrat, has reportedly donated around $9,000 to the senator over the years and claimed: “I was close to Schumer in many ways.” But Schumer, 66, has described the businessman as a casual acquaintance rather than a friend, insisting they have never had a meal or played golf together.\n\nThis week, Schumer demanded that the attorney general and Trump loyalist Jeff Sessions resign for misleading listeners at his Senate confirmation hearing about whether he had contacts with Russia during the election campaign.\n\nIt emerged that Sessions had had two meetings with the Russian ambassador to the US, one of which was at the Republican national convention in Cleveland. Sarah Huckabee Sanders, deputy White House press secretary, also drew attention to Schumer on Friday, asking reporters: “Please explain to me how volunteers meeting at a conference where nearly 80 ambassadors attended is a story.\n\n“I guess it’s kind of lost on me where that would be newsworthy in any capacity. I mean, Chuck Schumer sitting and having drinks with Putin and that’s not a news story, but apparently a volunteer for a campaign bumping into one at a conference where there’s again dozens of other ambassadors is newsworthy.”\n\nTrump has admitted, however, that Sessions could have stated his response “more accurately” at his confirmation hearing. Democrats continue to press for the attorney general’s resignation and for a special prosecutor to investigate the Russian connection.", "link": "https://www.theguardian.com/us-news/2017/mar/03/schumer-trump-doughnuts-putin-tweet", "logo": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "left_right_score": 0.04243835864523759, "bias": 2, "facebook_likes": 250, "title": "Krispy Kreme-lin: Trump and Schumer trade tweets over Putin doughnut photo", "source": "The Guardian"}, "Daily Beast": {"body": "President Donald Trump has come under intense scrutiny over the last few months—and Twitter is having a field day with it.\n\nOn Tuesday, the hashtag “#Trump2020ElectionSlogans” started trending, with critics pitching potential taglines for the president’s re-election campaign.\n\nThese sarcastic slogans come on the heels of the president’s disdain for the hurricane-ravaged island of Puerto Rico, his attempts to seemingly dismantle every single one of former President Obama’s policies, and his more recent alleged comments to the widow of a slain soldier that her husband “knew what he signed up for.”\n\nThis may be the cherry on top for critics of the president, although every action or tweet of his appears to be a new breaking point.\n\nHere’s a sampling of their suggestions, from “Putin America First This Time” to “Together We Klan.”", "link": "http://feedproxy.google.com/~r/thedailybeast/articles/~3/LoKD650iCFo/trump-2020-election-campaign-slogans-twitter", "logo": "https://www.thedailybeast.com/static/images/square_logo_1x.16983b61.png", "left_right_score": 0.530297073867937, "bias": 1, "facebook_likes": 0, "title": "The Best Trump 2020 Election Campaign Slogans, Brought to You By Twitter", "source": "Daily Beast"}, "CBS News": {"body": "President Trump was advised against congratulating Russian President Vladimir Putin on his reelection victory, CBS News' Jeff Pegues confirms. Mr. Trump did so anyway.\n\nA source tells CBS News Mr. Trump was briefed to prepare him for the call with Putin, and a recommendation was made against congratulating Putin. Mr. Trump ultimately congratulated the Russian president, after an election filled with accusations of ballot stuffing. The Washington Post first reported Mr. Trump went against the advice of his National Security Council in congratulating Putin.\n\nIn describing the process, a source emphasized to Pegues that people advise the president, but the president makes the decision and obviously doesn't have to adhere to recommendations. In this case, Mr. Trump ultimately decided to congratulate Putin.\n\nMr. Trump's decision to congratulate the foreign leader, given the election circumstances — and given that the U.S. and ally nations have accused Russia of being behind the suspected nerve poisoning attack in the United Kingdom — did not sit well even with some members of Mr. Trump's own party.\n\n\"An American president does not lead the Free World by congratulating dictators on winning sham elections,\" Sen. John McCain, R-Ariz., said in a statement. \"And by doing so with Vladimir Putin, President Trump insulted every Russian citizen who was denied the right to vote in a free and fair election to determine their country's future, including the countless Russian patriots who have risked so much to protest and resist Putin's regime.\"\n\nMr. Trump on Tuesday said he hopes to \"get together in the not-too-distant future\" with Putin so \"we can discuss the arms race.\"\n\nBut White House press secretary Sarah Sanders said there are no plans to do so soon. Sanders would not directly answer whether the White House believes Russia's election was free and fair in Tuesday's press briefing.\n\n\"In terms of the election, there we're focused on our elections. We don't get to dictate how other countries operate,\" she said.", "link": "http://www.cbsnews.com/news/trump-was-advised-against-congratulating-putin/", "logo": null, "left_right_score": 0.013312069965489597, "bias": 2, "facebook_likes": 3209, "title": "Trump was advised against congratulating Putin — he did so anyway", "source": "CBS News"}, "CNN": {"body": "Washington (CNN) President Donald Trump appeared to back away Sunday night from an earlier tweet about \"forming an impenetrable Cyber Security unit\" with Russian President Vladimir Putin.\n\nSunday morning, Trump, who met for over two hours Friday with Putin on the sidelines of the G20 summit in Hamburg, Germany, unexpectedly raised the possibility of such a unit.\n\n\"Putin & I discussed forming an impenetrable Cyber Security unit so that election hacking, & many other negative things, will be guarded ... and safe,\" Trump wrote.\n\nPutin & I discussed forming an impenetrable Cyber Security unit so that election hacking, & many other negative things, will be guarded..\n\nThe suggestion immediately raised eyebrows and suspicions from both American and allied intelligence officials and lawmakers. US intelligence agencies have concluded that Russia, at Putin's behest , was behind efforts to meddle in the 2016 presidential election, findings that Trump tepidly endorsed at a news conference in Warsaw, Poland, on Thursday.\n\nUS and Russian officials have disputed accounts of the discussion between Trump and Putin over the election meddling, which was discussed at their Friday meeting. Trump, hours after returning from his second foreign trip as president, declined to refute the Russian account of his meeting with Putin, leaving their assertion that he accepted the Russian president's denial of 2016 election meddling unchallenged.\n\nMinutes after Trump's meeting with Putin, Russian Foreign Minister Sergey Lavrov went on camera and told reporters that Trump accepted Putin's assurances there was no Russian involvement in the 2016 American election.\n\n\"President Trump said he's heard Putin's very clear statements that this is not true and that the Russian government didn't interfere in the elections and that he accepts these statements. That's all,\" Lavrov said, according to a CNN translation.\n\nA senior Trump administration official immediately denied that Trump accepted Putin's claim of non-interference. But no top Trump aides have said -- on the record -- that Trump didn't accept Putin's explanation. Asked three times about how Trump responded to Putin on Saturday, chief economist Gary Cohn, national security adviser H.R. McMaster, and Treasury Secretary Steven Mnuchin all declined to knock down those remarks when pressed by reporters, deferring instead to Trump himself.\n\n\"President Trump will be happy to make statements himself about that,\" Mnuchin said. \"But President Trump handled himself brilliantly. It was very clear that he made his position felt, and after a very substantive dialogue on this, they agreed to move on to other discussions.\"\n\nTrump, according to Secretary of State Rex Tillerson, pressed Putin on election meddling and then moved on.\n\nUS Ambassador to the United Nations Nikki Haley said Putin denied Moscow interfered in last year's US election in order to \"save face.\"\n\n\"This is Russia trying to save face, and they can't, they can't,\" Haley told CNN's Dana Bash on \"State of the Union\" Sunday. \"Everybody knows that Russia meddled in our elections. Everybody knows that they're not just meddling in the United States' election. They're doing this across multiple continents, and they're doing this in a way that they're trying to cause chaos within the countries.\"\n\nOn Twitter Sunday morning, Trump wrote, \"I strongly pressed President Putin twice about Russian meddling in our election. He vehemently denied it. I've already given my opinion.\"\n\nHe was apparently referring to his comments in Warsaw, when he said, \"I think it was Russia but I think it was probably other people and or countries. I see nothing wrong with that statement.\"\n\nHe added: \"Nobody really knows. Nobody really knows for sure.\"", "link": "http://rss.cnn.com/~r/rss/cnn_latest/~3/7ZLoCpVOjOs/index.html", "logo": "http://i2.cdn.turner.com/cnn/2015/images/09/24/cnn.digital.png", "left_right_score": 0.044007822044782506, "bias": 3, "facebook_likes": 5364, "title": "Trump appears to back away from cybersecurity effort with Putin", "source": "CNN"}, "Breitbart": {"body": "Sen. Claire McCaskill (D-MO) claimed during a recent town hall that she “respects” President Trump’s voters, despite repeated attempts to stymie his agenda.\nAt a town hall in July, McCaskill told Missourians that she “respects” Missouri voters. She explained, “I’m here because I respect the people who voted for Donald Trump.”\n\nMcCaskill’s recent remarks might confuse observers because during the 2016 presidential campaign, she called Trump a “buffoon.”\n“What’s important is not whether or not he gets out, but how he campaigns,” explained Sen. McCaskill. “If the contrast is now about what separates us from Donald Trump, then I think it’s fine. I just hope that we can begin to focus on unifying because, obviously, a lot of us are perplexed that we could be facing a country led by someone who seems to be a buffoon.”\nThe Missouri Democrat senator also said that Vladimir Putin was President Trump’s “best buddy.”\n“So you can say Trump and his friend Putin are the founders of ISIS,” McCaskill added, blaming Putin and Trump for the rise of ISIS.\n\n\n\n\nSen. McCaskill serves as one of the four Democratic senators whom Republicans have targeted for re-election. Trump won Missouri, and McCaskill has endured tight races in the past. Breitbart News recently reported that Sen. McCaskill remains open to the idea of a $32 trillion “Medicare for All” single-payer healthcare scheme. Other Democratic senators the GOP has targeted for the 2018 Senate midterm elections include Bill Nelson (D-FL), Bob Casey (D-PA), and Joe Manchin (D-WV).\nMissouri went red during the 2016 presidential election, and National Republican Senatorial Committee spokesman Michael McAdams argues that McCaskill continues to block crucial legislation that Missouri voters want, such as repealing and replacing Obamacare and tax reform.\nThe Missouri Democrat also voted against at least 18 of President Trump’s executive agency nominees and even took the unprecedented step of voting to filibuster then-Supreme Court Justice nominee Neil Gorsuch.\n“Instead of working to implement the agenda Missouri voters want, McCaskill has taken matters into her own hands to block President Trump’s agenda at every turn,” said Michael McAdams. “Missourians won’t tolerate career politicians like Claire McCaskill standing in the way of the change they voted for.”\nVIDEO\n\n\n\n\nVIDEO", "link": "http://feedproxy.google.com/~r/breitbart/~3/e5bSLhhEmCA/", "logo": "http://www.breitbart.com/t/assets/i/breitbart-logo.png", "left_right_score": 0.6206124280137452, "bias": 5, "facebook_likes": 4826, "title": "Sen. Claire McCaskill Claims She ‘Respects’ Trump Voters, Despite Mocking President", "source": "Breitbart"}, "USA Today": {"body": "President-elect Donald Trump (Photo: Pablo Martinez Monsivais, AP)Another day, another Trump Twitter tirade. Thursday morning's edition hit on Vanity Fair and journalists in general before the president-elect spouted a particularly bold falsehood. \"If Russia, or some other entity, was hacking, why did the White House wait so long to act?\" Trump tweeted. \"Why did they only complain after Hillary lost?\"Of course, they didn't. The same Internet that gives Trump a platform also leaves his statements vulnerable to fact checks: Both the Department of Homeland Security and the Director of National Intelligence formally accused Russia of using hacking to influence the election on Oct. 7, a month before Election Day.And Trump himself discussed the notion of Russian hacking as early as July. Perhaps he simply forgot.It's For the Record, the politics newsletter from USA TODAY.Trump spokesman: Don't undermine this election by asking whether Russia undermined this electionGraffiti depicting Russian President Vladimir Putin and President-elect Donald Trump. (Photo: Mindaugas Kulbis, AP)So all this coverage is starting to bug Trump  Co., who allege it to be a story peddled by Democrats (except that Republicans in Congress say it has merit, too). Trump spokesman Jason Miller dismissed findings of more than a dozen intelligence agencies that concluded Russia was behind the hacking, describing \"continued efforts to try to de-legitimize the election.\"NBC News went so far as to report Thursday that Russian president and Trump mural mate Vladimir Putin was personally involved in hacking efforts to upend the election. It cited two unnamed \"senior U.S. intelligence officials,\" though, so take it with a grain of salt.All this complicates things for Trump's secretary of state pick Rex Tillerson, a Texas oil baron with the name of a Texas oil baron who just so happens, strangely enough, to be acquaintances with Putin. Expect that to put a kink in his confirmation hearings.And Trump? Well, he just likes Russians in general. The rich ones who buy his condos, at least.Business dealings show Trump 3 wealthy RussiansDonald Trump poses next to Miss Universe 2013 Gabriela Isler after the 2013 Miss Universe competition in Moscow Nov 9, 2013. (Photo: Alexander Nemeno, AFP/Getty Images)Our own Oren Dorell took a dive into Trump's business dealings, which show how he spent decades courting rich Russians to buy his luxury high rises. After bankruptcies made it tough for Trump to raise funds in the U.S., he turned to Moscow. Real estate brokers in Dubai, Florida and New York told USA TODAY that Trump's properties still lure high-end buyers from Russia and other countries as well.Donald Trump Jr. talked about his father's growing Russia ties in a 2008 address to investors, the Russian daily Kommersant reported.“We see a lot of money pouring in from Russia,\" Trump Jr. said a the time. \"There's indeed a lot of money coming for new-builds and resale reflecting a trend in the Russian economy and, of course, the weak dollar versus the ruble.\"The Trump Organization did not respond to a request for comment for the article.Montana congressman tapped to oversee federal land\n    Zinke, who just won re-election for a second term, is an avid outdoorsman.\nVideo provided by Newsy\n    NewslookTrump on Thursday nominated Montana Rep. Ryan Zinke to oversee the nation's federal land and natural resources as Interior secretary. Zinke, a former Navy SEAL and early Trump supporter, will aid the administration's goals to preserve the nation's natural beauty, repeal \"bad regulations\" and \"use our natural resources to create jobs and wealth for the American people,\" Trump said.As a congressman, Zinke's voting record puts him at the bottom of the League of Conservation Voters' rankings of congressional members. But Barry Russell, CEO of the Independent Petroleum Association of America, thinks Zinke's a swell pick. \"Nobody values the importance of public land use better than a Westerner,\" he said.Here's everyone picked for Trumps Cabinet so far.Around the transitionTrump’s vow to undo Obama rules? lol not so fast (USA TODAY)Electors’ lawyer: Founding Fathers ‘anticipated’ Trump (USA TODAY)What the intelligence briefing says about Obama's presidency — and Trump's (USA TODAY)Trump aides promote Rex Tillerson's global experience (USA TODAY)Here comes Putin Clause here comes Putin Claus right down Putin Clause LaneWhite House reporters gathered this week for their yearly holiday party and the annual reading of the White House Christmas poem (a real thing). Greg Clugston of Salem Radio News strung together all of 2016's happenings in the style of Twas the Night Before Christmas. If you never noticed that Bernie Sanders \"looked something like Scrooge,\" you will now.Read or Share this story: http://usat.ly/2hNW2vI", "link": "http://rssfeeds.usatoday.com/~/244695544/0/usatoday-newstopstories~For-the-Record-Trump-falsely-claims-no-one-mentioned-Russia-before-his-win/", "logo": "http://www.gannett-cdn.com/sites/usatnetwork/images/RSS_Syndication_Logo-USATN.png", "left_right_score": 0.015262735306717538, "bias": 3, "facebook_likes": 13018, "title": "For the Record: Trump falsely claims no one mentioned Russia before his win", "source": "USA Today"}, "BBC.com": {"body": "Russia is not only Putin; there are many other people there\n\nThe format of BBC Debates is based on the concept of a university debating society. The University of Oxford and the Ashmolean Museum, the University's Arts Gallery which was chosen as the first programme venue, is home to one of the oldest debating societies in the world: the Oxford Union.\n\nThe topic of the inaugural edition of the programme, ahead of the 18 March presidential election in Russia, is the future of Russia-West relations. Presented by BBC Russian’s Oleg Boldyrev, BBC Debates provides a platform for four speakers, all with strong opinions on the future of Russia.\n\nThe panel is invited to support or reject a motion on the likelihood of the relations between Russia and the West improving after the election. The programme also features a lively studio audience comprised of Russians living or working in Oxford, as well as Britons interested in Russian politics and culture. Audience members send in their questions ahead of the recording, or pose spontaneous questions and offer their comments during filming.\n\nThe programme panel is made up of:\n\nHoward Amos says: “When the dialogue is not conducted on a political level, it is especially important to maintain it on the cultural level. Russia is not only Putin, there are many other people there.”\n\nCatriona Kelly says: “It's not about a contradiction, but a strange similarity. Neo-liberalism and nationalism are two opposing tendencies, characteristic for many countries today. They are particularly strong in Britain and Russia as both countries are former empires, and they are going through a difficult departure from power.”\n\nIlya Yablokov says: “The history of today’s conflict and the so-called collective, the West, is a long history of love and hatred. Today we observe one of its chapters, and the relations can change very quickly after the 18 March elections.”\n\nKonstantin Zatulin: “It’s not about Putin and not about 18 March when we talk about conflict. There is Russia which, following the collapse of the USSR, was considered practically unimportant. If our interests are respected, there will be a cause for optimism.”\n\nBBC Debates will be broadcast on TV Rain at 23.00 Moscow time on Monday 5 March and will be published on the website bbc.com/russian\n\nIn addition to website, bbc.com/russian, the BBC connects with its Russian-speaking audiences via social media such as Facebook, VKontakte, Instagram, Twitter, YouTube, Telegram, Google+, LiveJournal and OK.ru.", "link": "http://www.bbc.com/mediacentre/latestnews/2018/bbc-russian-debates", "logo": "http://static.bbci.co.uk/onesport/2.11.536/images/rss-logo_144x144.png", "left_right_score": 0.360547037178745, "bias": 3, "facebook_likes": 0, "title": "BBC - BBC Russian debates the future of Russia’s relations with the West - Media Centre", "source": "BBC.com"}, "The Blaze": {"body": "Putin: US created doping allegations to sway next year’s Russian presidential election            \n            \n        2 mins\n          \n\n\n        \n\n        \n                \n\n        Russian President Vladimir Putin accuses U.S. of doping plot to sway Russian presidential election. (Alexander Zemlianichenko/Getty Images) \n                  \n        \n\n        \n        0\n        \n            Follow\n                \n                \n            \n        \n                \n            \n        \n\n        \n        \n            Russian President Vladimir Putin alleged Thursday that the U.S. invented the doping allegations against Russian athletes in an attempt to sway votes from the leader who’s up for re-election next March.\n“In response to our alleged interference in their election, they want to create problems for the election of the president of Russia,” Putin said, according to Channel News Asia.\nSpecial counsel Robert Mueller is investigating the allegations of Russian’s meddling in the 2016 presidential election, which Putin calls “imaginary interference,” BBC News reported.\nWhat’s the story?\nThe International Olympic Committee announced Thursday that four Russian cross-country skiers are guilty of doping and the athletes are sanctioned from the sport. The investigation into the athletes was launched after a 2016 report commissioned by the World Anti-Doping Agency alleging state-sponsored doping in Russia from 2011 to 2015.\nPutin, who denies all accusations of state-sponsored doping, hasn’t confirmed whether he will run for re-election but if he does, he is expected to win. A win would extend his Kremlin term through 2024.\n“Russia never had and, I hope, will never have a system of state doping of which we are being accused,” Putin said Thursday following the IOC announcement.\nThe IOC decision came one day before the Russian president’s scheduled meeting with President Donald Trump in Vietnam.", "link": "http://www.theblaze.com/news/2017/11/09/putin-us-created-doping-allegations-to-sway-next-years-russian-presidential-election/", "logo": null, "left_right_score": 0.07660103960046526, "bias": 5, "facebook_likes": 3, "title": "Putin: US created doping allegations to sway next year’s Russian presidential election", "source": "The Blaze"}, "Associated Press": {"body": "WASHINGTON (AP) -- The Latest on President Donald Trump and Russian President Vladimir Putin (all times local):\n\nThe U.S. State Department says it's \"no surprise\" that Russian President Vladimir Putin was re-elected.\n\nState Department spokeswoman Heather Nauert says some people in Russia were paid to turn out to vote. She says opposition leaders were intimidated or jailed.\n\nNauert is citing a preliminary report by the Organization for Security and Cooperation in Europe that says Russia's election took place in an overly controlled environment that lacked an even playing field for all contenders. She says the U.S. has every reason to believe that report is correct.\n\nNauert's comments are notably tougher on Russia than those of the White House. President Donald Trump is being criticized by Sen. John McCain and others for calling Putin on Tuesday to congratulate him for his re-election.\n\nWhite House spokeswoman Sarah Huckabee Sanders says the poisoning of an ex-spy in Britain didn't come up in President Donald Trump's Tuesday call with Russia's Vladimir Putin.\n\nThe British government has blamed Moscow for the attack with a military-grade nerve agent.\n\nOutgoing Secretary of State Rex Tillerson has said it's \"almost beyond comprehension\" why a state actor would deploy such a dangerous substance in a public place in a foreign country where others could be exposed.\n\nSanders told reporters that Trump also didn't raise the issues of election meddling or Russia's allegedly tainted voting process. She says: \"That's not simply what today's call was about.\"\n\nSanders adds that the call was meant to discuss areas of cooperation between the U.S. and Russia.\n\nSen. John McCain is criticizing President Donald Trump for commending Vladimir Putin for his re-election to a fourth six-year term as Russia's leader.\n\nThe Arizona Republican says, \"An American president does not lead the Free World by congratulating dictators on winning sham elections.\"\n\nMcCain, the Armed Services Committee chairman, also says that by doing so Trump has \"insulted every Russian citizen who was denied the right to vote in a free and fair election to determine their country's future.\"\n\nMcCain has previously called Putin a murderer and a thug. He's also pressed the Trump administration to respond aggressively to Russia's interference in the 2016 U.S. presidential election.\n\nPresident Donald Trump says he wants to meet with Russia's Vladimir Putin in the \"not too distant future\" to discuss the \"arms race\" between Russia and the U.S.\n\nTrump says he also wants to discuss Ukraine, North Korea, and Syria with the Russian president.\n\nTrump said in the Oval Office: \"� suspect we'll probably be meeting in the not too distant future to discuss the arms race, which is getting out of control, but we will never allow anybody to have anything even close to what we have.\"\n\nTrumps comments came after what he says was a \"very good call\" with Putin on Tuesday morning to congratulate the Russian leader on his re-election Sunday to a fourth six-year term.\n\nThe election was tainted by reports of voting irregularities.\n\nThe Kremlin says U.S. President Donald Trump has called Russian President Vladimir Putin to congratulate him on re-election.\n\nThe Kremlin said in a statement that the two presidents also spoke Tuesday about the need to coordinate efforts to limit the arms race and closer cooperation on strategic stability and counter-terrorism.\n\nThe statement says they also expressed satisfaction with the apparent easing of tensions over North Korea's weapons program.\n\nThe Kremlin said the two leaders also discussed the Ukrainian crisis and the 7-year Syrian war and talked about a possible bilateral meeting.\n\nRussia has repeatedly said it hoped for better ties with the U.S. under Trump. Relations between the two countries instead have remained tense amid the allegations of Russian meddling in the 2016 U.S. presidential election and the investigations of whether there was collusion between Trump's campaign and Russia.", "link": "http://hosted.ap.org/dynamic/stories/U/US_TRUMP_RUSSIA_THE_LATEST?SITE=WICHP&SECTION=HOME&TEMPLATE=DEFAULT", "logo": null, "left_right_score": 0.15662147313423458, "bias": 3, "facebook_likes": 0, "title": "The Latest: McCain says Trump shouldn't congratulate Putin", "source": "Associated Press"}, "The Washington Times": {"body": "ANALYSIS/OPINION:\nPerhaps Vladimir Putin was using his experience meddling in U.S. elections to meddle in his own.\nMr. Putin “won” re-election last Sunday with about 76 percent of the vote, not as much as the 99 percent Iraqi dictator Saddam Hussein “won” and maybe not as impressive as the nearly unanimous vote by the National People’s Congress to allow China’s Xi Jinping to effectively be president for as long as he wishes, but impressive nonetheless.\nWell, not really all that impressive since Mr. Putin effectively wiped out (or rubbed out) any serious opposition. And speaking of wiping out, how about his alleged (and here I use the word only in a legal sense) use of deadly World War II nerve gas in an attempt to extinguish two former spies who served as double agents? They remain in critical condition in a London hospital.\nIn a style familiar to those who remember the Cold War, Russian toadies blame everyone but themselves — the U.K., the U.S. and other foreigners. But they “credit” the West’s criticism of Russia for the high voter turnout.\nThe U.K. Daily Mail, which often reports U.S. stories before the American media get to them, tells of “wrestlers, nuns and ‘independent’ monitors” caught on video stuffing ballot boxes and otherwise fixing votes for Mr. Putin.\nA Putin spokesman told the Interfax news agency that Mr. Putin won an “incredible victory” and that the large percentage of votes that went to him “speaks for itself.” Given the corruption, it certainly does.\nThe larger question for the West is what happens next? Will Mr. Putin feel emboldened to be even more aggressive than he has been against neighboring countries, perhaps invading another one with some sort of phony excuse to paper over his aggression?\nWill even more Putin enemies, including journalists who dare to print the truth about him and his tactics, wind up dead under suspicious circumstances? Will that nerve agent that nearly killed — and may still kill — the two former Russian spies, and which has been banned for decades by international law governing chemical weapons, start showing up in other places and become a weapon of choice for Russia?\nAnd then there is the ultimate question. What will and what can President Trump do about all this? During the 2016 presidential campaign, Mr. Trump was solicitous of Mr. Putin, refusing to condemn him for his aggressive tactics in Ukraine and later as president reluctant to conclude that Russia interfered in the U.S. election.\nPresident Obama was similarly solicitous, almost obsequious, with Mr. Putin’s puppet, President Dmitry Medvedev. Mr. Obama told Mr. Medvedev in 2012 during one of those “caught on open mic moments” that he would have “more flexibility” to address Russia’s concerns about European missile defense after he won re-election, to which Mr. Medvedev replied, “I understand. I will transmit this information to Vladimir.”\nMust America and the West return to a Cold War mentality and prepare for a type of Soviet Union 2.0? Are we headed back to the doctrine of “mutually assured destruction” with growing numbers of ICBMs pointed at each other?\nIn January, Mr. Trump slapped sanctions on a list of Russian oligarchs, but refused to apply broader sanctions against the country. The pressure is on for him to go further. If he does, will it make a difference, or will Mr. Putin continue his “make Russia great again” policies?\nRonald Reagan believed in “peace through strength” and contributed to the downfall of the Soviet Union by successfully employing that policy. Does Mr. Trump have a similar policy when it comes to modern Russia? Does he have any policy? He had better because Mr. Putin has one and a corrupt election is only part of it.\nCal Thomas is a nationally syndicated columnist. His latest book is “What Works: Common Sense Solutions for a Stronger America” (Zondervan, 2014).\nThe Washington Times Comment PolicyThe Washington Times is switching its third-party commenting system from Disqus to Spot.IM. You will need to either create an account with Spot.im or if you wish to use your Disqus account look under the Conversation for the link \"Have a Disqus Account?\".  Please read our \nComment Policy before commenting.", "link": "http://www.washingtontimes.com/news/2018/mar/21/the-russian-selection/?utm_source=RSS_Feed&utm_medium=RSS", "logo": null, "left_right_score": 0.9286760499008692, "bias": 5, "facebook_likes": 27, "title": "The Russian selection", "source": "The Washington Times"}, "NPR": {"body": "Trump, Putin Hold First Face-To-Face Meeting At G-20 Summit In Germany\n\nPresident Donald Trump and Russian President Vladimir Putin met for more than two hours in their first presidential face-to-face meeting. Trump raised the issue of Russian meddling in the U.S. election, Secretary of State Rex Tillerson said.", "link": "http://www.npr.org/2017/07/07/536025742/trump-putin-hold-first-face-to-face-meeting-at-g-20-summit-in-germany?utm_medium=RSS&utm_campaign=allthingsconsidered", "logo": "https://media.npr.org/images/podcasts/primary/npr_generic_image_300.jpg?s=200", "left_right_score": 0.125561234901712, "bias": 3, "facebook_likes": 0, "title": "Trump, Putin Hold First Face-To-Face Meeting At G-20 Summit In Germany", "source": "NPR"}, "CBN News": {"body": "WASHINGTON (AP) — Republican Rep. Ed Royce of California said Monday he will not seek re-election after serving out his 13th term in the House, the latest in a string of committee chairmen who have announced their retirement.\n\nWhether or not he sought re-election, Royce was stepping down as chairman of the House Foreign Affairs Committee this year. He said he would spend his final year as chairman fully focused on the “urgent threats facing our nation.”\n\nBut it’s also clear the congressman was facing one of the most challenging elections of his career.\n\nIn last year’s presidential election, Democrat Hillary Clinton defeated Republican Donald Trump in California’s 39th Congressional District. That prompted the campaign arm for congressional Democrats to target Royce’s district in Southern California as one they hoped to flip in their midterm effort to take control of the House.\n\nRoyce won in 2016 with more than 57 percent of the vote, and Republicans hold a narrow edge in voter registration.\n\nRoyce had appeared to be gearing up for another campaign: He had $3.4 million stockpiled in his campaign account as of September, the most recent numbers available.\n\n“It wasn’t a re-election problem, that’s for sure,” said Republican National Committeeman Shawn Steel, who called Royce’s announcement “a shocker.”\n\nBut the district, like much of California, has been growing increasingly favorable for Democratic candidates. The party holds every statewide office and controls both chambers of the Legislature by hefty margins.\n\nTrump lost the state in 2016 by more than 4 million votes and Clinton carried Orange County, once a Republican fortress, by nearly 9 percentage points.\n\nThe suburban district southeast of Los Angeles has significant chunks of Hispanic, Asian and highly educated voters, a combination “that makes Democrats salivate,” said political scientist Jack Pitney, who teaches at Claremont McKenna College.\n\n“In the suburbs, Trump is toxic,” Pitney said.\n\nRoyce became the 29th House Republican to announce a decision not to seek re-election this year, compared to 14 Democrats. With Trump’s popularity in the dumps and a string of election victories in recent weeks, Democrats have hopes of gaining the 24 seats they would need to win control of the chamber.\n\nIn a press release announcing his retirement, Royce cited the tax cut bill passed in December and the crackdown on the global ivory trade as among recent accomplishments.\n\nRepublican Rep. Steve Stivers, the chairman of the National Republican Congressional Committee, said the GOP was “fired up and ready to hold this seat.”\n\n“We have just one message for Democrats who think they can compete for this seat: Bring it on,” Stivers said.\n\nDemocrats said that Royce’s retirement was another sign of the party’s growing momentum going into the midterm elections.\n\n“In a district that Hillary Clinton won by 8 points, Democrats are poised to win this Orange County seat and send someone to Washington who truly represents the values of Southern California,” said Drew Godinich, a spokesman for the Democratic Congressional Campaign Committee.\n\nRoyce’s announcement came just a few days after Rep. Gregg Harper of Mississippi, the Republican chairman of the House Administration Committee, announced his retirement.\n\nAnd Harper’s announcement followed retirement plans announced by Senate Finance Committee Chairman Orrin Hatch, R-Utah, and House Transportation and Infrastructure Chairman Bill Shuster, R-Pa. Hatch is 83 and Shuster was barred by GOP rules from seeking another term atop his committee.\n\nCopyright 2017 The Associated Press. All rights reserved.", "link": "http://www.cbn.com/api/urlredirect.aspx?u=http://www1.cbn.com/cbnnews/politics/2018/january/california-republican-ed-royce-not-seeking-re-election", "logo": null, "left_right_score": 0.28475849794254254, "bias": 5, "facebook_likes": 0, "title": "California Republican Ed Royce Not Seeking Re-Election", "source": "CBN News"}, "The Hill": {"body": "President Trump pressed Russian President Vladimir Putin on his state's alleged interference in last year's presidential election for about 40 minutes during their more than two-hour meeting, The New York Times reported Saturday.\n\nThe talks became heated between the two world leaders at times, a senior White House official who was briefed on the closed door meeting by Secretary of State Rex Tillerson told the newspaper.\n\nPutin at one point reportedly called on Trump to provide evidence to support the meddling allegation.\n\nThe U.S. intelligence community released a declassified report in January on its assessment that Russia launched an influence campaign to sway the 2016 election in Trump's favor.\n\nDespite pressing the Russian leader on the matter, Trump has expressed doubt publicly that Russia tried to meddle in the election.\n\nOn Thursday, a day before his meeting with Putin, Trump said at a news conference that \"other people in other countries\" could have meddling in the U.S. election, adding, \"nobody really knows for sure.\"\n\nTillerson told reporters that after a back and forth on the issue, Trump pushed the discussion towards other topics like the Syrian civil war.\n\nSome critics, however, have questioned how strongly the president pushed on the issue.\n\nPutin and Russian Foreign Minister Sergey Lavrov have suggested in public comments that Trump believed the Kremlin leader's denial.\n\nPutin said during a press conference Saturday that he believes Trump was satisfied with his denial. Lavrov, who sat in on the leaders' first meeting, separately said Trump accepted the denial.\n\nTop Trump administration officials also declined to refute Putin and Lavrov's claims leaving the public account of the meeting one-sided since Trump has not made his own public remarks about their meeting yet, besides calling it “tremendous.”\n\nTrump met with Putin and other world leaders amid the G-20 summit, which drew leading figures from 20 countries together to discuss prevalent global issues like climate change and trade.", "link": "http://thehill.com/homenews/administration/341147-trump-pressed-putin-on-russias-election-interference-for-40-minutes", "logo": null, "left_right_score": 0.052541340585827385, "bias": 3, "facebook_likes": 85, "title": "Trump pressed Putin over election interference for 40 minutes: report", "source": "The Hill"}, "Reuters": {"body": "WASHINGTON (Reuters) - White House Press Secretary Sarah Sanders said on Tuesday that there are no specific plans at the moment for U.S. President Donald Trump to meet with Russian President Vladimir Putin, fresh from a re-election victory that some U.S. lawmakers have called a sham. \nWhite House Press Secretary Sarah Huckabee Sanders holds the daily briefing at the White House in Washington, U.S. March 15, 2018.  REUTERS/Jonathan Ernst/File Photo\n\n“We don’t get to dictate how other countries operate. What we do know is that Putin has been elected in their country,” she said when asked if Trump believed Russia’s recent vote was fair and free. “It didn’t come up on today’s call.” \nIn a phone call earlier in the day, Trump congratulated Putin on his recent win and the two gave special attention “to working through the question of a possible high-level meeting,” according to the Kremlin. \nReporting by James Oliphant; Writing by Lisa Lambert; Editing by Phil Berlowitz", "link": "http://feeds.reuters.com/~r/reuters/INworldNews/~3/ALxj2DiaxWo/white-house-says-no-specific-plans-right-now-for-trump-to-meet-putin-idINKBN1GW2PP", "logo": "http://www.reuters.com/resources_v2/images/reuters125.png", "left_right_score": 0.11835942843952367, "bias": 3, "facebook_likes": 0, "title": "White House says no specific plans right now for Trump to meet Putin", "source": "Reuters"}, "The New York Times": {"body": "After his meeting with President Vladimir V. Putin of Russia at the Group of 20 summit on Friday, President Trump sent mixed messages about Russia's meddling in the 2016 presidential election.", "link": "https://www.nytimes.com/video/us/politics/100000005236805/trump-sows-confusion-over-russian-hacking.html?partner=rss&emc=rss", "logo": "https://static01.nyt.com/images/misc/NYT_logo_rss_250x40.png", "left_right_score": 0.4600624230830683, "bias": 2, "facebook_likes": 96, "title": "Trump Sows Confusion Over Russian Hacking", "source": "The New York Times"}, "Fox News": {"body": "Russian President Vladimir Putin speaks at a meeting with workers of the GAZ factory in Nizhny Novgorod, Russia, Wednesday, Dec. 6, 2017. Putin says he will seek re-election in next March's election\n                                    \n                                         (Mikhail Klimentyev, Sputnik, Kremlin Pool Photo via AP)\n                                    \n                                \n                            \n                        \n                \t\n            \n        \n    \n\n    \n\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\n\n\n \n\n\n\n       \n       \n      \n          \n              Russian President Vladimir Putin announced Wednesday that he will officially run for office again in 2018, debunking questions and theories surrounding his delayed official announcement.\n              \n                  \n                  \n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Putin, whose approval ratings hover around 80 percent, is expected to sail through the election in March. Should he win again, he would become the country’s longest serving ruler since Josef Stalin.\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              The announcement was made at the GAZ automobile factory in the city, Nizhny Novgorod. The factory is a symbol of the country’s industrial might, and Putin was greeted by an enthusiastic audience by the blue-collar workers who make up the core of his base.\n              \n             \n                           \t\t\n\t\t\t\t\t\n              \n              \n              \n              \n\n\n              \n          \n              “I couldn’t find a better place and movement,” Putin, 65, said to the crowd. “Thank you for your support. I will run for president.”\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              HOW PAUL MANAFORT IS CONNECTED TO THE TRUMP, RUSSIA INVESTIGATION\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              For months, Putin fended off questions about his plans for 2018, fueling speculation about why he would not say if he would seek re-election. Some theorized he might step down and name a preferred successor.\n              \n             \n               \n              \n              \n              \n\n\n              \n                  \n              \n          \n              Putin is pitted against a number of candidates, including TV host Ksenia Sobchak, the daughter of late St. Petersburg Mayor Anatoly Sobchak, who was Putin’s boss in the 1990s.\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              “I don’t trust a system where Putin makes all decisions,” Sobchak said Wednesday when she also met with voters in Nizhny Novgorod. “Let’s believe in our ability to change the situation.”\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Another contender is Alexei Navalny, who previously intended to seek office before getting arrested in June. His conviction, which he calls politically motivated, bars him from running.\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              TRUMP AND THE RUSSIA INVESTIGATION: WHAT TO KNOW\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              The upper house of the Russian parliament is expected to authorize the start of formal election campaigning later this month.\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Putin has been in power in Russia since 2000. He served two presidential terms during 2000-2008, then shifted into the prime minister's seat because of term limits. As prime minister, he still called the shots while his ally, Dmitry Medvedev, served as the placeholder president.\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Medvedev had the president's term extended to six years and then stepped down to let Putin reclaim the office in 2012. If Putin serves another six-year term, which would run through 2024, he would reach the milestone of having the longest tenure since Stalin, who ruled for nearly 30 years.\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              The Associated Press contributed to this report.", "link": "http://feeds.foxnews.com/~r/foxnews/world/~3/LujNvQ0x5T0/vladimir-putin-announces-plan-to-run-for-re-election-in-2018.html", "logo": null, "left_right_score": 0.09529003595824351, "bias": 4, "facebook_likes": 4111, "title": "Vladimir Putin announces plan to run for re-election in 2018", "source": "Fox News"}, "Bloomberg": {"body": "Aides Urge Trump to Expel Russian Envoys Over U.K. Attack\n            \n            By  and \n            \n            \n                \n        \n            \n        \n        March 23, 2018, 7:47 PM EDT\n    \n        \n    \n                \n            \n\n            \n        \n\n    \n\n    \n                                \n    \n            President Donald Trump’s advisers are poised to recommend that he expel some Russian diplomats from the U.S. in response to the nerve-agent poisoning of a former Russian spy living in the U.K., a person familiar with the matter said.\nThe advisers reached the preliminary recommendations at a National Security Council meeting on Wednesday and honed them on Friday in a gathering that included Deputy Secretary of State John Sullivan, according to two people familiar with the meeting.\nTrump has not made a decision and is unlikely to do so before next week, one of the people said.\n\n        \n        A battle within the White House over how to best address the provocations of Russian President Vladimir Putin has been intensifying. The internal divisions flared this week after Trump congratulated Putin on his recent re-election without first reviewing written guidance that he not do so, a person familiar with the matter said.\nTrump has been reshaping his national security staff. On Thursday, he announced the departure of National Security Adviser H.R. McMaster, who favored a tougher public posture toward Putin, and announced that he would replace him with John Bolton, a former ambassador to the United Nations known for his hawkish views. That move came just a week after the president fired Secretary of State Rex Tillerson, who also took a more combative stance toward Russia, and nominated Mike Pompeo, the CIA director, to replace him.\nTrump faces pressure to take a stronger stance against Putin from Congress, which passed legislation in August giving lawmakers the power to block the president from lifting punitive measures imposed after Russia’s intervention in Ukraine. Substantively, Washington’s policy toward Russia has become tougher in recent months, though Trump’s critics say he has dragged his feet in responding to Putin’s provocations.\nTrump, who’s aware of the disagreement among his aides, didn’t mention such sensitive issues as the U.K. poisoning or continuing concerns over Russian interference in American elections during a 30-minute call with Putin.\nRelationship PriorityTrump has been willing to adopt increasingly tough policy stances on Russia. But the president places a priority on maintaining a personal relationship with the Russian president, won’t publicly attack him, and doesn’t see any benefit to the U.S. in confronting Putin in one-on-one encounters, one administration official said.\nTrump defended his call with Putin on Twitter Wednesday, dismissing those who “wanted me to excoriate him.” “They are wrong!” Trump wrote. “Getting along with Russia (and others) is a good thing, not a bad thing.”\n\n        \n        Regardless of the president’s own rhetoric, his administration sees the Kremlin as a threat.\nA national defense strategy assembled by the Pentagon under Defense Secretary James Mattis and publicly summarized in January described China and Russia as the top global adversaries of the U.S. Last week, the administration slapped financial sanctions against a St. Petersburg-based internet “troll farm” and its alleged owner -- a close Putin ally -- whom Special Counsel Robert Mueller indicted over a covert social media campaign to influence the 2016 U.S. election.", "link": "https://www.bloomberg.com/news/articles/2018-03-23/aides-urge-trump-to-expel-russian-envoys-over-u-k-attack", "logo": null, "left_right_score": 0.003569388737362291, "bias": 3, "facebook_likes": 28, "title": "Aides Urge Trump to Expel Russian Envoys Over U.K. Attack", "source": "Bloomberg"}, "ABC News": {"body": "President Donald Trump and his Russian counterpart, Vladimir Putin, spoke over the phone for \"more than one hour\" today, discussing efforts to combat terrorism and the situations in North Korea, Ukraine and Syria, according to details provided by the White House.\n\n\nInterested in Donald Trump?\nAdd Donald Trump as an interest to stay up to date on the latest Donald Trump news, video, and analysis from ABC News.\n\n\n\nThe conversation came a day after Putin met with Syrian leader Bashar al Assad Monday evening in Sochi, Russia.\n\n\n\n\n\n\n\n\n\nTrump and Putin had met for an informal meeting on the sidelines of the Asia-Pacific Economic Cooperation Summit (APEC) in Vietnam on Nov. 11, as Trump was on a five-country tour of Asia.\n\nThe president's interactions with Putin continue to be scrutinized by administration critics as special counsel Robert Mueller and committees in the House and Senate continue to investigate Russiaâ\u0080\u0099s interference in the 2016 U.S. presidential election.\n\nDuring the Asia trip, Trump said Putin told him Russia did not meddle in the election, and that he \"believes that [Putin] believes that.\" But Trump added that he trusted the U.S. intelligence community, which determined in January that Russia, guided by Putin, took efforts to interfere in the election.", "link": "http://abcnews.go.com/Politics/trump-vladimir-putin-speak-hour-terrorism-north-korea/story?id=51298328", "logo": "https://s.abcnews.com/images/site/abcnews_google_rss_logo.png", "left_right_score": 0.01707134927218025, "bias": 2, "facebook_likes": 36, "title": "Trump-Putin speak for 'more than 1 hour' on terrorism, North Korea, Syria", "source": "ABC News"}}