{"The Washington Post": {"body": "John Bolton, Trump's new national security adviser, speaks during the 2016 Conservative Political Action Conference. (Andrew Harrer/Bloomberg)\n \n President Trump has said he likes to have conflict in the White House — even jokingly embracing the idea of West Wing “chaos.” And few appointments will provide him competing perspectives as much as that of John Bolton.\n Trump's newly named national security adviser is one of the most hawkish voices in American foreign policy and has been for years, which could provide a contrast and perhaps a shift in Trump's stated preference for non-interventionism. On nearly every foreign policy issue of substance these days, in fact — North Korea, Russia, Iraq — Bolton seems to be on a completely different page than Trump.\n Here's a quick rundown of where they differ.\n Talking to North Korea\n Bolton says sanctions and talk don't work: “Now that North Korea possesses [nuclear weapons], the U.S. has few realistic options. More talks and sanctions will fail as they have for 25 years.” “The unanswerable reality is that economic sanctions have never stopped a relentless regime from getting the bomb.”\n Trump says the sanctions are working and has agreed to meet with North Korean leader Kim Jong Un: “We put very, very strong sanctions and lots of other things we have been doing right from the first day I was in office.”\n   Kim Jong Un talked about denuclearization with the South Korean Representatives, not just a freeze. Also, no missile testing by North Korea during this period of time. Great progress being made but sanctions will remain until an agreement is reached. Meeting being planned!\n— Donald J. Trump (@realDonaldTrump) March 9, 2018  \n \n The Iraq War\n Bolton remains one of its staunchest defenders: “I still think the decision to overthrow [Iraqi President] Saddam [Hussain] was correct. I think decisions made after that decision were wrong.”\n Trump has regularly said Iraq was a colossal mistake: “We've made a terrible mistake getting involved there in the first place.” “George Bush made a mistake. We can make mistakes. But that one was a beauty. We should have never been in Iraq. We have destabilized the Middle East.”\n Russian interference\n Bolton has called Russia's 2016 election interference an “act of war” and said Putin is lying to Trump when he denies it: \"... Attempting to undermine America's constitution is far more than just a quotidian covert operation. It is in fact a casus belli, a true act of war, and one Washington will never tolerate.”\n Trump has repeatedly downplayed Russian interference as inconsequential and the Russia investigation as a “witch hunt”: “The results of the 2016 election were not impacted or changed by the Russians.”\n Putin's denials\n Bolton says Trump should be insulted that Putin lied to his face: “For Trump, it should be a highly salutary lesson about the character of Russia's leadership to watch Putin lie to him.”\n Trump has suggested he believes Putin's denials: “Every time he sees me, he says, 'I didn't do that.' And I believe — I really believe that when he tells me that, he means it. But he says, 'I didn't do that.' I think he's very insulted by it, if you want to know the truth.” “What do you do? End up in a fistfight?”\n Russian sanctions\n Bolton has called for tougher sanctions: “If you make them feel pain, and others feel pain, then the possibility of deterring future conduct like this increases.”\n Trump resisted signing Congress's package of sanctions, which he called “seriously flawed”: “By limiting the Executive’s flexibility, this bill makes it harder for the United States to strike good deals for the American people, and will drive China, Russia, and North Korea much closer together.”\n  Russia's alleged poisoning of an ex-spy\n Bolton has called for “a very strong response” to Russia's alleged use of a nerve agent on a former Russian spy Sergei Skripal and his daughter on British soil: “This is unacceptable conduct.”\n Trump signed on to a tough joint statement with the leaders of France and Germany, but has otherwise not pressed the issue. Even this week, less than three weeks after Skripal's poisoning, he emphasized harmony with Putin:\n   I called President Putin of Russia to congratulate him on his election victory (in past, Obama called him also). The Fake News Media is crazed because they wanted me to excoriate him. They are wrong! Getting along with Russia (and others) is a good thing, not a bad thing.......\n— Donald J. Trump (@realDonaldTrump) March 21, 2018  \n \n Iran\n Bolton has called for regime change: “I had said for over 10 years since coming to these events, that the declared policy of the United States of America should be the overthrow of the mullahs' regime in Tehran. The behavior and the objectives of the regime are not going to change, and therefore the only solution is to change the regime itself. And that's why, before 2019, we here will celebrate in Tehran!”\n Trump's White House has declined to call for regime change, though it has come close.\n Fred Barbash contributed to this report.", "link": "https://www.washingtonpost.com/news/the-fix/wp/2018/03/23/boltons-views-on-russia-iraq-and-north-korea-contradict-almost-everything-trump-says/", "logo": null, "left_right_score": 0.041151556590751766, "bias": 2, "title": "Analysis | Bolton’s views on Russia, Iraq and North Korea contradict almost everything Trump says", "facebook_likes": 712, "source": "The Washington Post"}, "ABC News": {"body": "John Bolton is the likely pick for deputy secretary of state in the Trump administration, the number two position at the State Department, sources told ABC News.\n\nA former diplomat and State Department veteran, Bolton will likely serve as an influential deputy to a possible secretary of state with far less foreign policy experience: Exxon Mobile CEO Rex Tillerson.\n\n\n\n\n\n\n\n\n\nHere’s what you need to know about Bolton:\n\nName: John Robert Bolton\n\nAge: 68\n\nBirthplace: Baltimore, Maryland\n\nWhat he used to do: In August 2005, President George W. Bush appointed Bolton to temporarily serve as the U.S. permanent representative to the United Nations during a congressional recess. Unable to win Senate confirmation by the newly elected Democratic Party majority, Bolton resigned in December 2006, the same time his recess appointment would have ended.\n\nThen-White House spokesperson Dana Perino criticized the Senate’s failure to confirm Bolton, saying at the time, “Despite the support of a strong bipartisan majority of senators, Ambassador Bolton’s confirmation was blocked by a Democratic filibuster, and this is a clear example of the breakdown in the Senate confirmation process.”\n\nBolton was seen as a controversial choice to serve at the United Nations in part because he was so vocally critical of the institution. In 1994, he famously said, “The Secretariat Building in New York has 38 stories. If you lost ten stories today, it wouldn't make a bit of difference.”\n\nBut President Bush praised Bolton’s efforts during his 16 months at the U.N.\n\n\"Ambassador Bolton led the successful negotiations that resulted in unanimous Security Council resolutions regarding North Korea's military and nuclear activities. He built consensus among our allies on the need for Iran to suspend the enrichment and reprocessing of uranium,\" Bush said in a statement. \"His efforts to promote the cause of peace in Darfur [in Sudan] resulted in a peacekeeping commitment by the United Nations. He made the case for United Nations reform because he cares about the institution, and wants it to become more credible and effective.\"\n\nSince leaving public service, Bolton has served as a foreign policy adviser to presidential candidate Mitt Romney in 2012 and an informal adviser to Ted Cruz in 2016. He is currently of counsel in the Washington office of Kirkland  Ellis and a senior fellow at the American Enterprise Institute (AEI), a conservative think tank.\n\nCareer track: Bolton received his undergraduate and law degrees from Yale University. During the Reagan and George H.W. Bush administrations, he worked in various positions at the U.S. Agency for International Development, the Justice Department, and the State Department.\n\nHis last position before his appointment to the United Nations was as the Undersecretary of State for Arms Control and International Security.\n\nDuring the Clinton administration, Bolton worked as an attorney at Lerner, Reed, Bolton  McManus and as senior vice president of AEI.\n\nThings you might not know about him: In a December 2012 interview with Fox News’ Greta Van Susteren, Bolton claimed that then-Secretary of State Hillary Clinton faked a concussion to avoid testifying before Congress about the attack on the U.S. consulate in Benghazi, Libya, that killed four Americans.\n\n“When you don’t want to go to a meeting or conference or an event, you have a ‘diplomatic illness.’ And this is a diplomatic illness to beat the band,” he said.\n\nWhere he stands on the issues: In a November article for the Pittsburgh Tribune Review, Bolton outlined what he believed were the next president’s foreign policy priorities -- the highest among them being the “related threats of radical Islamic terrorism and the Middle East’s spreading chaos.”\n\nThe second priority he named was curbing nuclear proliferation by Iran and North Korea. Bolton is highly critical of the Iran nuclear deal and wrote that Iran’s leaders “have been cheating since before the ink was dry on the deal.” In an op-ed for The New York Post, Bolton advised Trump to repeal it on his first day in office.\n\nBolton’s third priority is checking the power of Russian President Vladimir Putin, whom Bolton described as being “on the prowl in Eastern Europe and the Middle East.”\n\n“Rebuilding protective structures of deterrence in Europe; reducing Moscow’s Middle East influence to pre-Obama days; and utilizing Russia effectively against Islamic terrorism and in the epic struggle with China may seem contradictory, but all are possible with renewed U.S. strength of purpose and the attendant resources, political and economic as well as military,” he wrote.\n\nBolton also questioned reports of Russian interference in U.S. elections, telling Fox News on Sunday that he couldn't rule out the possibility that the hacking was a \"false flag.\"\n\nBolton’s fourth and fifth priorities were addressing China’s territorial claims in the South and East China Seas and protecting U.S. sovereignty, respectively.\n\nRepublican opposition: For weeks, Sen. Rand Paul, R-Kentucky, has publicly urged Trump not to appoint Bolton to any position in his administration. On Sunday, during an interview on ABC News' “This Week,” Paul said he would threaten to block any nomination of Bolton.\n\n\n\n\n\nLast month, Paul wrote in an opinion piece for Rare, “Bolton is a longtime member of the failed Washington elite that Trump vowed to oppose, hell-bent on repeating virtually every foreign policy mistake the U.S. has made in the last 15 years -- particularly those Trump promised to avoid as president.”\n\nABC News’ Cindy Smith contributed to this report.", "link": "http://abcnews.go.com/Politics/john-bolton-trumps-expected-pick-deputy-secretary-state/story?id=44146193", "logo": "https://s.abcnews.com/images/site/abcnews_google_rss_logo.png", "left_right_score": 0.11910980284273169, "bias": 2, "title": "Everything You Need to Know About John Bolton", "facebook_likes": 512, "source": "ABC News"}, "The Guardian": {"body": "John Bolton, Donald Trump’s latest choice as national security adviser, belongs to a band of Washington armchair warriors who are rarely happier than when sending other people’s children to die in foreign wars. Like his former Iraq comrades-in-arms, George W Bush and Dick Cheney, and his bellicose new White House boss, Bolton avoided military service in Vietnam as a young man. But he is no peacenik. Far from it. Bolton the conservative arch-hawk has become infamous over the years as a reckless advocate of pre-emptive, interventionist military action in pursuit of what he perceives to be America’s interests.\n\nDespite the calamitous post-9/11 consequences of his neoconservative ideology, arrogant unilateralism and America First nationalism, Bolton has never acknowledged error. He continues, for example, to argue for forcible regime change in Iran and North Korea. Stuck in a unipolar quagmire of his own intellectual making, the louder he shouts, the deeper he sinks. The world has changed since 2003, but he hasn’t. As the New York Times declared last week, Bolton is a truly dangerous man. A worse choice as the US president’s senior adviser on global security affairs is hard to imagine.\n\nBolton’s appointment to this pivotal post does not require confirmation by Congress – another instance of how, under Trump, America’s lauded constitutional checks and balances are proving less than effective. And it comes at a particularly sensitive moment. It is unlikely that the promised summit between Trump and Kim Jong-un, North Korea’s dictator, will produce anything more than a grandstanding opportunity for the president. But thanks to South Korea’s efforts, this willingness to talk nevertheless represents a welcome shift away from last year’s nuclear brinkmanship. Yet Bolton, whose job it will be to make the meeting a success, has already dismissed it as a waste of time. He argued only last month that an American first strike – the so-called bloody nose option – would be a “perfectly legitimate” response to Kim’s weapons build-up.\n\nA probable scenario now is that the US side will make demands it knows Kim cannot accept, such as halting his nuclear weapons programme and unilaterally disarming, and will then blame Pyongyang for the ensuing failure. “You see, we tried,” Bolton will say. “So now there is no alternative to bombing.”\n\nIt would be good to be wrong about this. We hope we are. But as Iraqis know to their cost, Bolton is nothing if not consistent in his aggressive instincts. The next big target may be Iran, not North Korea. Trump seems certain to repudiate the 2015 multinational treaty curbing Iran’s nuclear capabilities when it is next reviewed in May. The reimposition of US sanctions on Tehran, enthusiastically supported by Bolton, will unleash a chain reaction of perilous consequences across the Middle East that, in a worst case, could expand the Syrian conflict into an uncontainable regional war. Israel’s rightwing leadership, beloved of Trump, gives every appearance of itching for a fight with Hezbollah, Iran’s Lebanese ally, which it accuses of stockpiling advanced missiles. The Israeli air force recently clashed inside Syria with Iran’s Revolutionary Guards. More is to come; Tel Aviv believes Tehran is intent on hostile encirclement.\n\nIn Iran itself, hardline clerics who denounce Bolton as a “sponsor of terrorism” may privately be content to see the gloves come off with Israel and its US and Saudi allies. So, too, may Palestinians ghettoised in Gaza. Perhaps the Middle East was ever a powder keg. But by picking Bolton, and appointing Mike Pompeo, another pro-Israel hawk, as secretary of state, Trump has lit the blue touchpaper.\n\nBolton’s confrontational instincts extend to China and Russia policy. He has a history, meanwhile, of disrespecting America’s allies and undermining international cooperative institutions such as the United Nations. All this may suit Trump’s blinkered, bombastic nationalist-protectionist agenda. But it bodes ill for the world at large.", "link": "https://www.theguardian.com/commentisfree/2018/mar/25/john-bolton-us-national-security-adviser-arch-hawk-donald-trump", "logo": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "left_right_score": 0.11098111203301042, "bias": 2, "title": "The Observer view on the danger John Bolton poses to world peace | Observer editorial", "facebook_likes": 14, "source": "The Guardian"}, "Salon": {"body": "President-elect Donald Trump’s logic for staffing his administration seems to be skin deep — quite literally.“Presentation is very important because you’re representing America not only on the national stage but also the international stage, depending on the position,” Trump transition spokesman Jason Miller told The Washington Post Wednesday.This tendency has led the president-elect to make some rather unorthodox choices. While Trump chose friend of Russia Rex Tillerson to be his secretary of state — even though he will be the first individual to hold that post without any government experience in modern history — he bypassed former United Nations ambassador John Bolton in part because he was turned off by the neoconservative’s walrus mustache.“Donald was not going to like that mustache,” The Post reported an aide of saying. “I can’t think of anyone that’s really close to Donald that has a beard that he likes.”Tillerson, by contrast, is clean-shaven and well-coiffed, a visual similarity that he shares with another finalist for the secretary of state job, Mitt Romney.Similarly, when Trump picked Gen. James “Mad Dog” Mattis to be his secretary of defense, Trump commented that Mattis was “the closest thing to General George Patton that we have.” Although Mattis has an extensive military background, he also looks both like the original Patton and actor George C. Scott, who played the general in the acclaimed 1970 biopic “Patton.”Trump’s skin-deep tendencies even came out when he selected Gov. Mike Pence of Indiana to be his vice presidential running mate. Although Trump cited his economic record as his main reason for choosing Pence, he couldn’t help but add that “he looks very good.” Trump’s press secretary is also likely to look very good, according to Trump aides:People close to Trump said he has been eager to appoint a telegenic woman as press secretary or in some other public-facing role in his White House — both because he thinks it would attract viewers and would help inoculate him from the charges of sexism that trailed his presidential campaign.But, looking at Trump’s history on dealing with women, should anyone be shocked?And of course, who can forget Trump’s infamous put down of Hillary Clinton’s appearance when criticized for stalking her during the second presidential debate.“I’m standing at my podium and she walks in front of me, right,” Trump said at a rally in North Carolina. “She walks in front of me, you know?  And when she walked in front of me – believe me, I wasn’t impressed.” VIDEOThen there was his dismissal of Carly Fiorina’s presidential candidacy in a September 2015 issue of Rolling Stone magazine.“Look at that face!” Trump said. “Would anyone vote for that? Can you imagine that, the face of our next president?”The president-elect’s mindset was perhaps best summed up to The Washington Post by another anonymous source on the transition team:“That’s the language he speaks. He’s very aesthetic. You can come with somebody who is very much qualified for the job, but if they don’t look the part, they’re not going anywhere.”", "link": "http://www.salon.com/2016/12/22/donald-trumps-skin-deep-staffing-logic-cabinet-staffers-are-being-chosen-based-on-a-look/", "logo": null, "left_right_score": 0.11777294569587443, "bias": 1, "title": "Donald Trump’s skin-deep staffing logic: Cabinet staffers are being chosen based on a “look”", "facebook_likes": 621, "source": "Salon"}, "CBS News": {"body": "BEIJING -- Foreign policy hard-liner John Bolton's appointment as U.S. national security adviser comes at a particularly sensitive time for relations with Beijing following President Donald Trump's approval of new tariffs on China and a law encouraging closer relations with Taiwan. Bolton has taken a tough position on both issues, saying Beijing needed to be called out on what he characterized as systematic cheating on global trade while enjoying the benefits of an open U.S. market.\n\nHe has also urged a rethink of U.S. restrictions of contacts with Taiwan, the self-governing island democracy that China considers its own territory.\n\nOn those and other issues, Bolton, a former U.N. ambassador under President George W. Bush, is seen as heralding a rightward shift in Mr. Trump's foreign policy and an embrace of more hard-line policies.\n\nHis appointment also raised questions over policy toward North Korea following Mr. Trump's acceptance of an offer for direct talks, possibly before May.\n\nChinese foreign ministry spokeswoman Hua Chunying said the importance of China-U.S. relations outweighed personnel matters.\n\n\"No matter who takes the post of any kind, the significance of China-U.S. relations needs no further explanation, and it will never change,\" Hua said at a regularly scheduled news briefing.\n\n\"To strengthen cooperation and uphold the principles of mutual respect and benefit is in line with the two sides' interests and meets the expectation of the international community,\" Hua said.\n\nChina also hopes the U.S. will stick with the Iran nuclear agreement, a deal both Bolton and Mr. Trump have harshly criticized.\n\nIn Tokyo, Japanese Foreign Minister Taro Kono said he was \"a bit surprised\" by Bolton's appointment, but said he didn't anticipate any major changes in U.S. policy on North Korea.\n\n\"During my recent visit to the U.S., members of the Trump administration seem to fully share consensus on policies.  So I believe there is no major change to their stance,\" Kono said.\n\nBolton's approach to North Korea appears to be everything China has warned against, including supporting the possibility of a pre-emptive military strike and dismissing direct negotiations that Beijing says are vital to jump-starting the denuclearization process.\n\nLike Mr. Trump, Bolton has also been highly critical of the U.S trade deficit with China, which Washington says hit a record of $375.2 billion last year.\n\nIn an interview Thursday with Fox Business News, Bolton accused China of stealing U.S. intellectual property and pursuing \"mercantilist policies in what is supposed to be a free-trade environment.\"\n\n\"I don't buy it. I am a free trader, but I don't think that means just getting pounded into the ground when another country doesn't abide by the commitments it's made,\" Bolton said.\n\nBolton said China cheats by providing subsidies to exports and discriminating against foreign entities, including through the legal system, while enjoying the benefits of WTO membership. Chinese government subsidies allow Americans to buy goods cheaper to the detriment of the Chinese worker, he said.\n\n\"The reality is, China just doesn't have the same concern for its citizen's welfare that we do in this country,\" Bolton said. \"And even beyond that, there's simply no excuse for the stealing of intellectual property, forced technology transfers it's sometimes called.\"\n\nSpeaking to the Washington Free Beacon newspaper in February 2017, Bolton criticized America's \"One-China\" policy, under which it does not recognize Taiwan as an independent nation, and called for increased arms sales to the island.\n\n\"The One-China policy is inherently ambiguous,\" Bolton said. \"China thinks it means one thing, we think it means another.\"\n\nBolton's appointment was loudly cheered by one of the administration's chief China hawks, trade and manufacturing adviser Peter Navarro, author of the book \"Death by China: Confronting the Dragon - a Global Call to Action.\"\n\n\"I've gotten to know him over the years, and he'll be a great replacement. So what we are seeing here is a president who has great judge of talent,\" Navarro told CNN on Thursday.\n\nThough Mr. Trump ultimately follows his own instincts, Bolton \"will have a sort of influence on Trump's foreign diplomacy because they share a similar view on matters such as ideology, threats to U.S. national security and values,\" said Yu Wanli, professor at the Peking University's School of International Relations in Beijing.\n\n\"Trump now has a faithful implementer of his policies,\" Yu said. \"Bolton will surely contribute to the tension in China-U.S. relations.\"", "link": "http://feeds.cbsnews.com/~r/CBSNewsMain/~3/2FMXgOxABSk/", "logo": null, "left_right_score": 0.07076414755886262, "bias": 2, "title": "Asia reacts to Trump's pick of hard-liner John Bolton", "facebook_likes": 0, "source": "CBS News"}, "Wall Street Journal": {"body": "President Trump called Venezuela's government a \"corrupt regime\" that has inflicted \"pain and suffering\" on its people. Mr. Trump also said took aim at socialism, saying it leads to failed states. Photo: AP", "link": "http://www.wsj.com/video/trump-blasts-venezuela-regime-socialism/129910D3-D961-4351-9CDB-250828BDFF41.html", "logo": "http://online.wsj.com/img/myYahooWSJlogo.gif", "left_right_score": 0.2640618140914465, "bias": 3, "title": "Trump Blasts Venezuela Regime, Socialism", "facebook_likes": 137, "source": "Wall Street Journal"}, "Politico": {"body": "By replacing the cautious H.R. McMaster with the fiery John Bolton as national security adviser, President Donald Trump is freeing himself of the last encumbrances on his increasingly strident unilateralism in world affairs. And the effects of this dramatic change are likely to go well beyond the renewed possibility of U.S. military attacks on both Iran and North Korea over their nuclear programs, which Bolton has forcefully advocated. The blunt-spoken Bolton is a Yale-trained expert in international law who has spent a career seeking, ironically, to delegitimize the very idea of international law, and of multilateral action and organizations. Bolton can thus be expected to provide the president with just the intellectual gasoline he needs to ignite new hostilities on any number of global fronts, including an escalated trade war.\n\nDuring his decades in Washington, Bolton has earned a reputation as an uncompromising nationalist hawk. What is less understood is that Bolton arrived at these positions carefully, thoughtfully and consistently, as a militant libertarian thinker who has believed passionately that the United States has surrendered its sovereignty for far too long to multilateral treaties and organizations of all kinds, including the United Nations. In articles and speeches, he has gone so far to as to question whether “globalism” or international law have any legitimacy under the U.S. Constitution. In a 2000 essay in the Chicago Journal of International Law titled “Should We Take Global Governance Seriously?” Bolton cast the U.S. political debate as a clash between two “parties”—what he called the “Americanists” versus the “Globalists”—and that he, as a “convinced Americanist,” was engaged in a losing battle for America’s very soul. “Americanists find themselves surrounded by small armies of Globalists, each tightly clutching a favorite new treaty or multilateralist proposal,” Bolton wrote.\n\nBolton then proceeded to attack nearly every major multilateral convention, including the 1997 Kyoto Protocol on Global Warming, the Land Mines Convention in Ottawa and the International Criminal Court. Over the years, he also has taken on the Biological Weapons Convention and the World Trade Organization, among other multilateral treaties, and continues to do so. Trump’s new unilateral trade tariffs against China will likely meet with his incoming national security adviser’s approval.\n\nIn what has since become his mantra, Bolton wrote back then that globalism “represents a kind of worldwide cartelization of governments and interest groups,” and “the costs to the United States—reduced constitutional autonomy, impaired popular sovereignty, reduction of our international power, and limitations on our domestic and foreign policy options and solutions—are far too great.” This puts him at odds with the 70-odd year consensus that has guided U.S. foreign policy since World War II: that a world of rule-based cooperation rather than atavistic competition is ultimately in American interests, too.\n\nWhat lies behind Bolton’s current stance against any deal with North Korea and the nuclear treaty with Iran is a long and embattled history of infighting that harks back to his unwavering determination to put his theoretical unilateralism into action. Because North Korea is an “imminent threat,” he wrote last month in a Wall Street Journal piece titled “The Legal Case for Striking North Korea First,” “it is perfectly legitimate” for the U.S. to strike without having to worry about any multilateral say-so. Similarly on Iran, Bolton wrote that the nuclear agreement negotiated by the Obama administration and approved by the U.N. Security Council was a “diplomatic Waterloo.”\n\nDuring his tenure as George W. Bush’s under secretary of state for arms control, and later as a recess-appointed U.N. ambassador, Bolton often enraged U.S. allies with his recalcitrance to the point where both Secretary of State Colin Powell and his successor, Condoleezza Rice, sought to get rid of him. At a meeting in London in November 2003, Powell’s counterpart, British Foreign Secretary Jack Straw, complained to the secretary of state that Bolton’s belligerence was making it impossible to reach allied agreement on Iran’s nuclear program. Powell turned to an aide and said, “Get a different view,” according to a government source at the time. Unbeknownst to Bolton, the aide then interviewed experts in Bolton’s own Nonproliferation Bureau. The issue was resolved only after Powell adopted softer language recommended by these experts on how and when Iran might be referred to the U.N. Security Council.\n\nThat same year, British officials persuaded the White House to keep Bolton off the team negotiating with Libya to surrender its nuclear program. A crucial issue, according to sources involved in the affair, was the dictator Muammar al-Gaddafi’s demand that if Libya abandoned its WMD program, the U.S. in turn would drop its goal of regime change. Bolton was unwilling to support this compromise, and the White House finally agreed to keep him “out of the loop,” as one source put it to my then-Newsweek colleague John Barry at the time. A deal was finally struck without him.\n\nIf nothing else, Bolton has proved unerringly true to his philosophical views. During his tension-filled career at the U.N. and State Department (he once told me in a 2002 interview that he felt surrounded by “enemies” at State), he consistently brooked no interference from allies and fulminated at interference from anyone, especially U.N. “civil servants.” Before he became U.N. ambassador—in a recess appointment because even many Senate Republicans would not back him—Bolton infamously proposed that if the U.N. Secretariat in New York “lost 10 stories, it wouldn’t make a bit of difference.” When the No. 2 official at the U.N., Mark Malloch Brown, suggested that Americans were acting against their own interests when they bashed the world body, Bolton exploded. Malloch Brown, in a speech, warned Americans they could “lose” the organization if they continued “the prevailing practice of seeking to use the U.N. almost by stealth as a diplomatic tool while failing to stand up for it against its domestic critics.” In response, Bolton declared that Malloch Brown, as a mere “international civil servant” rather than a representative of an individual country, had no right to say such things. “It’s just illegitimate,” Bolton said.\n\nArriving at a time when Trump appears to be giving voice more to his own anti-globalist and unilateralist instincts, Bolton will no doubt encourage these tendencies with a kind of career-vindicating glee. He will lend eager validation to the “America First” views that Trump has embraced since his presidential campaign: that the United States can and should act alone as it pleases. “We will no longer surrender this country or its people to the false song of globalism,” Trump said in his defining foreign-policy speech as a candidate in the spring of 2016. “The nation-state remains the true foundation for happiness and harmony. I am skeptical of international unions that tie us up and bring America down.” The language of Trump’s in-your-face inaugural address echoed these views: “From this moment on, it’s going to be America First,” he said.\n\nBolton’s predecessor, H.R McMaster, an Army lieutenant general, was no soft-hearted globalist, but he was known to urge the president to be cautious in moving away from multilateral cooperation. Both McMaster and recently ousted Secretary of State Rex Tillerson reportedly were in favor of finding ways to maintain the Iran nuclear treaty, and both their policy views and their occasional differences in style were said to rankle the president. But in John Bolton—and in the incoming secretary of state, the hawkish Mike Pompeo—Donald Trump is likely getting a pair of full-throated cheerleaders.", "link": "https://www.politico.com/magazine/story/2018/03/22/john-bolton-iran-north-korea-217700", "logo": null, "left_right_score": 0.011051627960275744, "bias": 2, "title": "John Bolton, the Anti-McMaster", "facebook_likes": 1334, "source": "Politico"}, "Associated Press": {"body": "NEW YORK (AP) -- Iranian expatriates gathered at a plaza on Wednesday to protest an appearance at the United Nations by Iranian President Hassan Rouhani.\n\nHundreds of protesters waved Iranian flags, chanted and held signs that said \"free Iran.\"\n\nPart of the demonstration on Dag Hammerskjold Plaza, near the U.N., included an acting performance and singing over a soundtrack of recorded gunshots and explosions.\n\nSeveral current or former U.S. politicians who favor a tougher stance on Iran also spoke, including independent former U.S. Sen. Joseph Lieberman, Democratic U.S. Rep. Eliot Engel and Republican former U.S. Ambassador to the United Nations John Bolton.\n\nMohammad Golshan, who was born in Iran but has lived in Toronto for three decades, said his belief is that the American administration \"should not deal with the Iranian government.\"\n\n\"I've been suffering a lot, me and my family back home in Iran, and I am hoping for a democracy in Iran one day,\" said Golshan, who's 57.\n\nThe demonstration, an annual event during the U.N. General Assembly, came on a day when President Donald Trump announced that he had decided whether to continue participating in a seven-nation deal designed to limit Iran's nuclear program. Trump, a Republican, then declined to say whether he's abandoning the accord.\n\nRouhani, addressing the General Assembly, said it would be a pity if the deal were \"destroyed by rogue newcomers to the world of politics.\"\n\nHamid Gharajeh, another native of Iran who traveled to New York from Toronto for Wednesday's demonstration, said he liked Trump's tough talk on Iran.\n\n\"It seems like Donald Trump has got the grips of the problem,\" he said. \"The appeasement policy which was carried out during previous administration has never brought any changes in Iran, so there has to be a change in policy.\"", "link": "http://hosted.ap.org/dynamic/stories/U/US_IRAN_PROTEST_NEW_YORK?SITE=WICHP&SECTION=HOME&TEMPLATE=DEFAULT", "logo": null, "left_right_score": 0.3391670376786878, "bias": 3, "title": "Protesters rally against Iranian president at United Nations", "facebook_likes": 0, "source": "Associated Press"}, "CNN": {"body": "Washington (CNN) John Bolton promised President Donald Trump that \"he wouldn't start any wars\" if he were hired to be the third national security adviser at the White House in just 14 months -- a claim that generated skepticism across Washington.\n\nBolton, a hawkish neoconservative, has advocated war with Iran and a pre-emptive strike on North Korea, and remains an unapologetic supporter of the Iraq War despite the flawed intelligence used to justify the US invasion.\n\nSo the claim that Bolton would avoid conflict, described to CNN by a source familiar with negotiations between the President and the former ambassador to the UN, raised eyebrows when news broke Thursday that Trump was ousting H.R. McMaster and replacing him with the 69-year-old Baltimore native.\n\nFor many, the concern is that the appointment of Bolton -- exactly the kind of advocate for US overseas intervention that Trump pilloried on the campaign trail -- marks a belligerent turn for the Trump administration that could doom attempts to save the Iran nuclear deal, increase the possibility of a clash with North Korea and ratchet up tensions with Moscow.\n\nBolton drew praise from some Republican senators, including South Carolina's Lindsey Graham, who said the Yale law school graduate will do \"an outstanding job,\" but a veterans group called the appointment \"frightening\" and advocacy groups warned that Trump was assembling a \"war cabinet.\"\n\nThe anxiety is as much about Bolton's track record -- a disdain for diplomacy, a thirst for military adventures and accusations that he manipulated intelligence in the lead-up to the Iraq War -- as it is about the role that he will now play in shaping US foreign policy.\n\nThe national security adviser's job is to act as a synthesizer of security issues across the administration, coordinating and summarizing for the commander in chief the various policy suggestions that come from the Pentagon, the State Department and other agencies.\n\nA national security adviser offers his or her own analysis, and then conveys the president's policy decisions back down the chain and makes sure they're carried out.\n\nBut many express doubt that Bolton is wired to put aside his own views and offer the kind of impartial summary of diverse policy views that would help a president weigh all options, instead of emphasizing the more hawkish positions he prefers.\n\n\"I think my long-standing hope for a fix to the Iran deal just died,\" Mark Dubowitz, the CEO of Foundation for Defense of Democracies and a longtime critic of the international pact, tweeted Thursday. \"Time of death: Afternoon of March 22, 2018. Now what?\"\n\nSen. Chris Coons, a Democrat from Delaware, said, \"Ambassador Bolton's stated positions on today's major issues, most notably North Korea's and Iran's nuclear programs, are overly aggressive at best and downright dangerous at worst.\"\n\n\"Let there be no mistake -- there is no war for regime change, anywhere, that John Bolton wasn't for,\" said Jon Soltz, an Iraq War veteran who serves as chair of VoteVets. \"We are undoubtedly closer to a war in Korea now, and a war with Iran, with John Bolton as national security adviser and with Mike Pompeo as the nominee for secretary of state.\"\n\nSome foreign policy analysts reported that the concern extends to US allies.\n\n\"I've spent the past week in Seoul and Tokyo,\" Abraham Denmark, director of the Asia Program at the Kissinger Institute, said in a tweet. \"One question they raised repeatedly was if Bolton will be appointed\" as national security adviser. This question, Denmark said, was \"always asked with a mix of incredulity and dread. Asian allies will worry this indicates diplomacy is a farce and that military action is more likely.\"\n\nA rumpled dresser with a walrus mustache and a cantankerous manner, Bolton was in the running to be Trump's secretary of state and since then has made visits to the West Wing every few months to discuss foreign policy and national security.\n\nHe'll start his new job on April 9 with deep experience, having served in the Republican administrations of Ronald Reagan, George H.W. Bush and George W. Bush.\n\nAlong the way, though, he drew accusations that he had manipulated intelligence on weapons of mass destruction before the Iraq War, kept information from Secretary of State Colin Powell and was abusive to subordinates with differing views at the State Department, where he served as the undersecretary for arms control.\n\nAmong neoconservatives, Bolton is admired for his dismissal of the UN and his promotion of the US as the world's sole significant power.\n\nTo that end, many see a welcome rigor ahead in the way the Trump administration will approach potential talks with North Korea and ongoing skirmishes with Russia, which intelligence officials say continues to try to interfere in US elections.\n\nHarry J. Kazianis, director of Defense Studies at The Center for the National Interest, said Bolton's hire \"is bad news for those who were hoping the Iran deal would somehow survive. That deal is RIP as of right now.\"\n\nKazianis also sees an unyielding approach to North Korea and the planned summit meeting between Trump and Kim Jong Un in May. \"Bolton will not tolerate any sort of games from Pyongyang,\" Kazianis said, referring to Pyongyang's pattern of demanding economic concessions in exchange for talks. \"If the North Koreans ask for bribes or incentives to talk, look for the administration to snap to an even harder line -- think maximum pressure on steroids,\" he said.\n\nAnd on Russia, despite Trump's repeated conciliatory tone toward President Vladmir Putin, Kazianis predicts that, \"the appointment of John Bolton might be Moscow's worst nightmare.\"\n\nBolton himself spent Thursday insisting through intermediaries and in an interview with Fox News, where he has worked as a commentator, that while he has strong views, he would channel only the President's wishes and \"absolutely go along with Trump.\"\n\nIn the interview with Fox, Bolton said his past comments are now \"behind me\" and what matters is \"what the President says.\"", "link": "http://rss.cnn.com/~r/rss/cnn_latest/~3/MosqK9YnX5I/index.html", "logo": "http://i2.cdn.turner.com/cnn/2015/images/09/24/cnn.digital.png", "left_right_score": 0.008702995373241935, "bias": 3, "title": "Bolton's move to White House signals a more hawkish turn", "facebook_likes": 0, "source": "CNN"}, "The New York Times": {"body": "The spectacle did not end with his secretary of state being cashiered just hours after landing from a diplomatic mission to Africa. Even as attention focused on Mr. Tillerson, the president’s once-trusted personal assistant, John McEntee, was forced out and escorted from the White House by security guards so hurriedly that he could not even grab his jacket — but in a typical Trumpian twist then turned around and joined the re-election campaign. Then an aide to Mr. Tillerson was fired for discussing the firing of his boss.\n\nThe turnover has been so head-snapping — 43 percent of Mr. Trump’s most senior aides had left by last week — that it will soon become easier to talk about who is still around than who has left. Gary D. Cohn, the economics adviser, announced last week that he would step down, following Hope Hicks, the communications director, and Rob Porter, the staff secretary.\n\nIt is tempting to look for larger meaning in the shifting personnel, but the momentum seems to shift by the week or even the day. One faction has the upper hand and then it does not. Mr. Cohn was the “it boy” of the Trump White House early on until he mildly criticized the president’s response to the white supremacist rally in Charlottesville, Va. Then he was on the outs. Then he helped pass Mr. Trump’s tax cut plan and his stock was high again. Then he lost last week’s battle over tariffs and he quit.\n\nNot to worry — even when Mr. Cohn, a former Goldman Sachs banker, announced his departure, Mr. Trump publicly predicted that he would simply go off to make a few hundred million dollars more and then rejoin the administration in one capacity or another.\n\nMr. Tillerson had yet to turn in his State Department decoder ring before speculation turned to who else would be gone soon. What about John F. Kelly, the forever-on-the-bubble White House chief of staff? Or Lt. Gen. H. R. McMaster, the perpetually on-the-way-out national security adviser?\n\nMaybe it depends on whom the president can convince to replace them. He said the other day that he could find 10 people for any job opening, but many first-tier Republicans are staying away from this White House or are banned from its premises because of past opposition to Mr. Trump.\n\nStill, he is not wedded to traditional choices as he scans the horizon for fresh staff members. It helps to be good on television, as Mr. Kudlow is, but not to be too good on television, because it might irritate the boss to be shown up.\n\nAmong those Mr. Trump enjoys on Fox News is John R. Bolton, the conservative firebrand who served as ambassador to the United Nations under President George W. Bush. Tongues wagged when Mr. Trump met with Mr. Bolton in the White House recently, prompting speculation that he could replace General McMaster.\n\nBut would Mr. Trump bring in Mr. Bolton, among the nation’s leading hawks on North Korea, at the very moment he plans to sit down with Kim Jong-un, the country’s mercurial dictator, for talks aimed at eliminating its nuclear program peacefully? And then there is Mr. Bolton’s famous mustache. Some around Mr. Trump say it bothers him. Can he get over the facial hair?\n\nMr. Trump’s choice of Mike Pompeo, the C.I.A. director, to replace Mr. Tillerson offers something of a window into his approach. Mr. Pompeo found that the key to favor in the Oval Office was engaging Mr. Trump. The president enjoyed his near daily interactions with Mr. Pompeo at his intelligence briefings.\n\nBy contrast, he never really connected with Mr. Tillerson, who was used to being a chief executive rather than a glorified staff member. It probably did not help that Mr. Tillerson was overheard after a meeting last summer calling the president a “moron,” a comment he never denied, although he had a spokeswoman deny it for him. Mr. Trump has likewise been said not to click personally with General McMaster.\n\nMr. Trump’s aides said he acted now because he wanted to get a new team in place before the talks with Mr. Kim. But Mr. Pompeo, a skeptic of talks with North Korea, will become secretary of state, while Mr. Tillerson, an advocate of talks with North Korea, will head for the exits.\n\nIn speaking with reporters on the South Lawn before his trip on Tuesday, the president cited clashing views with Mr. Tillerson over the Iran nuclear agreement and other national security issues.\n\n“It was a different mind-set. It was a different thinking,” he explained. “We disagreed on things.”\n\nJust a minute or two later, a reporter asked if it was true that Mr. Kudlow was his top choice to replace Mr. Cohn as director of the National Economic Council. Such a selection would be striking given that Mr. Kudlow, a CNBC commentator, has criticized Mr. Trump’s decision to slap tariffs on imported steel and aluminum.\n\nBut Mr. Trump shrugged that off and praised Mr. Kudlow. “We don’t agree on everything, but in this case I think that’s good,” he said. “I want to have a divergent opinion.”\n\nAt least for now.", "link": "https://www.nytimes.com/2018/03/13/us/politics/white-house-turnover-tillerson.html?partner=rss&emc=rss", "logo": "https://static01.nyt.com/images/misc/NYT_logo_rss_250x40.png", "left_right_score": 0.00400899055542369, "bias": 2, "title": "As White House’s Revolving Door Whirls, Chaos Is the Only Constant", "facebook_likes": 426, "source": "The New York Times"}, "USA Today": {"body": "CLOSE\n\n\n\n\n\n    President Donald Trump selected John Bolton to replace H.R. McMaster as National Security Adviser. Here is a look at Bolton's background.\n    Wochit\n\n\n\nNational Security Adviser H.R. McMaster was added to the growing list of former White House officials Thursday when President Trump announced he was replacing McMaster with former ambassador to the United Nations John Bolton. \nBolton is a hawk's hawk who has repeatedly said he believes the United States has the right to take the first shot to handle potential threats.\nSeveral commentators have expressed concern that Bolton's bellicose approach will only encourage Trump's more aggressive foreign policy instincts and could help lead the United States into what might be otherwise avoidable military conflicts. \nHere are some facts from Bolton's past that help show why his appointment has made some people nervous. \nHe thinks pre-emptive war with Iran and North Korea is the right callIn a February op-ed for The Wall Street Journal, Bolton made the \"legal case for striking North Korea first\" to stop what he deems an \"imminent threat\" from the nation's nuclear program. \nBolton is strongly opposed to the Iran nuclear deal and said on Fox News that the United States \"has no other option\" than to bomb the country. According to The American Conservative, \"he has been obsessed for many years with going to war against the Islamic Republic.\"\nHe still thinks invading Iraq was the right callIn the run-up to the U.S. invasion of Iraq, Bolton joined other administration officials in expressing confidence that Saddam Hussein had weapons of mass destruction and that Iraqis would welcome the U.S. overthrow of the regime. \nBoth those predictions turned out to be incorrect, but unlike his new boss, Bolton still believes the invasion was the right decision. \n\"I still think the decision to overthrow Saddam was correct,\" Bolton told the Washington Examiner in 2015. \"I think decisions made after that decision were wrong, although I think the worst decision made after that was the 2011 decision to withdraw U.S. and coalition forces.\"\nHe resisted efforts to investigate the Iran-Contra scandalBolton was working as an assistant attorney general in the Reagan administration during the Iran-Contra affair. During that investigation, Bolton argued that the Ethics in Government Act establishing an independent counsel was unconstitutional. \nAccording to The Nation, Bolton \"tried to torpedo\" then-senator John Kerry's investigation into alleged drug smuggling and gun running by Reagan-backed contra rebels in the civil war against Nicaragua's Sandinista government. \nHe is not a big United Nations fan When former president George W. Bush appointed Bolton to be ambassador to the United Nations it was pointed out that his nominee was not a fan of the organization. \nIn particular, critics pointed to his 1994 statement that, \"The Secretariat building in New York has 38 stories. If it lost ten stories, it wouldn’t make a bit of difference. The United Nations is one of the most inefficient inter-governmental organizations going.\"\nBolton also said, \"The United States makes the UN work when it wants it to work, and that is exactly the way it should be, because the only question, the only question for the United States is what is in our national interest. And if you don’t like that, I’m sorry, but that is the fact.\"\nHe once joked that Obama is a Muslim During his 2016 keynote address to the American Freedom Alliance, Bolton managed to imply former president Barack Obama was both a Muslim and a monarch.\nBolton spoke of King Abdullah of Jordan, who he joked \"is not simply a Muslim king of a Muslim country, unlike our president.”\nMore: Trump removes H.R. McMaster as national security adviser, replacing him with John Bolton\nMore: White House departures: Who's been fired and who resigned\nLike this topic? You may also like these photo galleries:\n\n\n\nAutoplay\nShow Thumbnails\nShow Captions\n\nLast SlideNext Slide\n\n\n \n \nRead or Share this story: https://usat.ly/2FWmq2T", "link": "http://rssfeeds.usatoday.com/~/534355744/0/usatodaycomwashington-topstories~facts-about-John-Bolton-Trumpaposs-new-national-security-adviser/", "logo": "http://www.gannett-cdn.com/sites/usatnetwork/images/RSS_Syndication_Logo-USATN.png", "left_right_score": 0.08387959994840855, "bias": 3, "title": "5 facts about John Bolton, Trump's new national security adviser", "facebook_likes": 0, "source": "USA Today"}, "CBN News": {"body": "President Donald Trump announced Thursday that U.N. Ambassador John Bolton will replace H.R. McMaster as his National Security Adviser.\n\nCBN News has confirmed President Trump and McMaster mutually agreed that he will resign.\n\n\"After thirty-four years of service to our nation, I am requesting retirement from the U.S. Army effective this summer after which I will leave public service. Throughout my career it has been my greatest privilege to serve alongside extraordinary service members and dedicated civilians.\" McMaster said in a statement.\n\n\"I am especially proud to have served alongside the men and women of the National Security Council Staff who established a strong foundation for protecting the American people, promoting American prosperity, achieving peace through strength, and advancing American influence,\" he also said.\n\nThe president tweeted that he is \"very thankful\" for McMaster's service and will always consider him a friend.\n\nI am pleased to announce that, effective 4/9/18, @AmbJohnBolton will be my new National Security Advisor. I am very thankful for the service of General H.R. McMaster who has done an outstanding job & will always remain my friend. There will be an official contact handover on 4/9.\n\nPresident Trump also highlighted the specific accomplishments McMaster achieved during his role as National Security Advisor.\n\n\"General McMaster's leadership of the National Security Council staff has helped my administration accomplish great things to bolster America's national security. He helped develop our America First National Security Strategy, revitalize our alliances in the Middle East, smash ISIS, bring North Korea to the table, and strengthen our nation's prosperity,\" he said in a statement.\n\nMcMaster was brought in after Trump's first national security adviser, Michael Flynn, was dismissed.", "link": "http://www1.cbn.com/cbnnews/national-security/2018/march/president-trump-announces-u-n-ambassador-john-bolton-to-replace-mcmaster", "logo": null, "left_right_score": 0.9755410465208921, "bias": 5, "title": "President Trump Announces U.N. Ambassador John Bolton to Replace H.R. McMaster", "facebook_likes": 446, "source": "CBN News"}, "Reuters": {"body": "LONDON (Reuters) - U.S. President Donald Trump’s choice of John Bolton as national security adviser provoked strong reactions worldwide on Friday - and few stronger than in the bitterly-divided Middle East. \nFILE PHOTO: Former U.S. Ambassador to the United Nations John Bolton speaks at the Conservative Political Action Conference (CPAC) in Oxon Hill, Maryland, U.S. February 24, 2017. REUTERS/Joshua Roberts/File Photo\n\nSome commentators saw it as another nail in the coffin of the Obama-era agreement between Iran and world powers to limit Tehran’s nuclear ambitions, already cast into grave doubt by  Trump himself. \nOthers expected Bolton to further undermine any remaining slender hopes of a “two-state solution” to the Israeli-Palestinian conflict emerging in the foreseeable future.  \nHe has in recent months applauded Trump’s plan to move the U.S. Embassy in Israel to Jerusalem. Naftali Bennett, a member of Prime Minister Benjamin Netanyahu’s security cabinet, called Bolton “an extraordinary security expert, experienced diplomat and a stalwart friend of Israel”.    \nLeft-leaning Israeli news website Haaretz was less enthusiastic, quoting 2016 comments by Bolton that the idea of two states, Israel and Palestine, existing side by side had “been dead for a long time”. \nHe instead argued for the Palestinian territories to be placed under Egyptian and Jordanian sovereignty. \nLebanese newspaper al-Akhbar, aligned with the Shi’ite militant group and political movement Hezbollah, reported Bolton’s appointment with the headline “Zionist Hawk in the White House”, drawing attention to Bolton’s historical calls for action against Iran. \n“Bolton’s appointment, combined with (Mike) Pompeo’s nomination (for secretary of state) last week, significantly lowers the odds that Trump will stick to the nuclear deal beyond May,” said Ellie Geranmayeh, senior policy fellow at the European Council of Foreign Relations. \n“Both men have vocally opposed the nuclear deal, advocated for regime change in Iran and Bolton has repeatedly called for bombing rather than diplomacy as a fix to the nuclear issue.” \n“DANGEROUS RIDE” Trump was surrounding himself with “like-minded advisers”, Geranmayeh told Reuters, and “purging those who disagree”. \nBut she said Bolton’s position on the Iran agreement would meet strong resistance from U.S. Defense Secretary Jim Mattis and the European powers who are also signatories. \nSome observers of Iran and the region saw storm clouds gathering. “President Trump has now chosen a war cabinet,” said Ali Alfoneh, senior fellow at the Atlantic Council. \nBolton was a leading advocate of the 2003 invasion of Iraq and has called for a change of government in North Korea. \nAny new conflict between the United States and Iran would undermine moderates in Iran and strengthen radical forces, Alfoneh said. \n“Bolton was a champion of ‘us-versus-them’ foreign policy,” tweeted Mohamed ElBaradei, former head of the International Atomic Energy Agency and a Nobel Peace Prize winner. \n“We should brace ourselves for a rough  dangerous ride.” \nTurkey’s response to the appointments of Pompeo and Bolton was cautious. “We hope these changes of duty will be a means to further strengthen the continuing efforts to solve the problems that have existed between our countries for a long time,” a foreign ministry spokesman said. \nAmong the international reactions, Moscow too struck a note of reserve. \n“That is not a question for us, it is for the U.S. administration,” a Kremlin spokesman said when asked about Bolton’s nomination. \nWriting by Andrew Roche; Editing by Angus MacSwan", "link": "http://feeds.reuters.com/~r/Reuters/PoliticsNews/~3/KW1rTptLXGc/zionist-hawk-stalwart-friend-strong-words-greet-bolton-nomination-idUSKBN1GZ1OW", "logo": "http://uk.reuters.com/resources_v2/images/reuters125.png", "left_right_score": 0.1568263295692942, "bias": 3, "title": "'Zionist hawk', 'stalwart friend': strong words greet Bolton...", "facebook_likes": 0, "source": "Reuters"}, "Daily Beast": {"body": "Experienced diplomats are warning that Donald Trump’s anticipated vote of no confidence in the Iran nuclear deal is a “crisis” whose impacts will reverberate to America’s detriment far beyond Iran.\n\nAlready, within the hallways of the State Department, anticipation over the imminent end of Secretary Rex Tillerson’s tenure is mixing with fear that a Tillerson replacement will help push the U.S. on a more bellicose path with Iran, whether the deal survives the year or not.\n\n“Given what we’ve seen thus far, who the hell knows? It could certainly get worse,” a State Department official told The Daily Beast on condition of anonymity. “State could go from being underutilized and dormant, as it is now with Tillerson, to actively furthering really scary policies.”\n\nTrump is expected to decline to certify Iran’s compliance with the nuclear agreement ahead of an Oct. 15 deadline, even though Iran has not violated the deal. He’s likely to give a speech on Friday denouncing Iranian support for terrorism and its development of ballistic missiles, both of which are outside the terms of the accord.\n\nFor the U.S. to sabotage the Iran deal in this way, particularly if Congress takes Trump up on reimposing sanctions, will lead allies, partners, adversaries and neutral powers to consider the U.S. “unable to take yes for an answer,” according to a former senior diplomat, diminishing American leverage on everything from North Korea’s nuclear crisis to the seemingly endless picayune complications of routine diplomacy like trade deals.\n\n“It’s just another signal to the world that we don’t stand by our agreements, even those that are painfully, meticulously negotiated,” a second State Department official told The Daily Beast on condition of anonymity.\n\nWalking away from the Iran deal would give “another bit of proof for the doubters” internationally that the U.S. can follow through on its commitments, the official continued. “Said questioning has been going on for a while.”\n\nGiving just one example, “Russia and China are incredibly cooperative and flexible partners in negotiating and implementing the JCPOA,” said Jarrett Blanc, who until January was responsible for overseeing the implementation of the deal, known in diplomatic circles as the “Joint Comprehensive Plan of Action,” or JCPOA.\n\n“If the U.S. demonstrates it is unable to take yes for an answer on the JCPOA, why should they play a constructive role with North Korea?” Blanc asked.\n\nThat question is already reverberating in foreign capitals—particularly in Europe, where the major power centers in London, Brussels, Paris, and Berlin are all parties to the Iran deal. European alarm at Trump was already acute when he pulled out of the Paris climate accords, a painstaking if insufficient effort at global cooperation to mitigate climate change.\n\nTo jeopardize the Iran deal will reinforce the view that “you can expect nothing positive from this administration, that the Americans have left the multilateral liberal order,” a European diplomat said.\n\nCharles Kupchan, a former State Department and National Security Council official, expected the consequences for U.S. diplomacy will be “particularly high” in Europe, where foreign ministries pushed hard for the nuclear deal for years and have fanned out on Capitol Hill to urge Congress to protect it.\n\n“Trump is already not a very popular person on the other side of the Atlantic. If he pulls out of the Iran deal, he will see his popularity in Europe decline even further and that will make it hard for European politicians to align with him across the board,” Kupchan said.\n\nSo Much for the Grown-Ups\n\nThe senior national security officials whom much of the world hopes will rein Trump in aren’t having much luck. Gen. Joseph Dunford, the chairman of the Joint Chiefs of Staff, recently stated that “Iran is adhering to its JCPOA obligations”; Defense Secretary James Mattis said that retaining the deal itself is in the broader U.S. national interest. Tillerson, for his part, is reportedly working with congressional Republicans to change legislation meant to cripple the deal politically, ostensibly to give the Trump administration a face-saving way to remain within it.\n\nMattis and Dunford’s places within the administration are secure. Tillerson, however, held a disastrous press conference on Thursday that highlighted his estrangement from the president, thanks to his non-denial that he has called Trump a “fucking moron.” A wave of news coverage has moved away from the long-standing portraiture of Tillerson as an unqualified steward of American diplomacy and is now portending his martyrdom.\n\nLately, the diplomats who will have to clean up the international mess that will come from Washington distancing itself from an Iran deal it spearheaded are viewing Tillerson’s likely successors nervously. Without revising their opinion of Tillerson as out of his depth, some consider United Nations Ambassador Nikki Haley and CIA Director Mike Pompeo as enthusiastic opponents of a deal designed to forestall an Iranian nuclear weapon for at least a decade.\n\nHaley shepherded a 15-0 Security Council vote authorizing new energy sanctions on North Korea that stands as the administration’s only tangible diplomatic achievement thus far. (Supporters note that securing it required Haley to compromise, proving she can.) She subsequently gave a hardline speech attacking the deal that many considered an audition for Tillerson’s job.\n\nAs a Kansas congressman, Pompeo—whose closeness with Trump has prompted what one ex-intelligence official called “real concern for interference and politicization” of the CIA—told Fox News couldn’t “think of a thing that has put America in a better position as the result of this deal.” (For good measure, John Bolton is also against the deal, though few think Bolton is as likely to take over State as Haley or Pompeo.)\n\nBut undermining the Iran deal depends on a complicated minuet with Congress before it plays out internationally.\n\n'Ceding the Initiative to the Void'\n\nIn accordance with a law passed after the 2015 deal – not a provision of the deal itself – the administration has to certify every three months that Congress Iran is complying with its terms. The Trump administration is widely expected to decline certification while not formally abrogating the JCPOA and punting to Congress, where GOP hostility to the deal has become right-wing catechism. In the absence of certification, thanks to the so-called Corker-Cardin law, a 60-day window to “snap back” sanctions on Iran will open.\n\nTheories by Iran-watchers abound over whether Congress will reimpose sanctions or stop short of that to allow Trump to save face without blowing up the deal. Should Congress reimpose the nuclear-related sanctions that the JCPOA put in abeyance—something that requires only a 51-vote threshold in the Senate—the accord will begin a death spiral, as Tehran will be able to credibly argue that Washington destroyed the deal. Much depends on how specific Trump gets about what he wants Congress to do and how much pressure he is willing to place on senators to do it. (Yet right before this pivotal decision, Trump set fire to his relationship with Bob Corker, the chairman of the foreign-relations committee.)\n\nIran’s own hardliners are outwardly sanguine. State media quoted Mohammad Ali Jafari, commander of the Iranian Revolutionary Guards Corps, saying Trump’s “stupid behavior” would give Iran an “opportunity to move ahead with its missile, regional and conventional defense program.” These are the things Trump and other deal critics deride the JCPOA for neglecting.\n\nBut the Europeans are bracing for catastrophe. If the Iranians decide to walk away from the deal in response to Trump and renew production of highly enriched uranium for a bomb, the European diplomat said, continental capitals will be hard-pressed to reimpose their own sanctions, since the Americans and not the Iranians sparked the crisis. The diplomat compared it to a trap that allied governments did not know how to escape.\n\nBlanc, the ex-implementation official at the State Department, said the punt to Congress would represent “ceding the initiative to the void,” itself a portend of American diplomacy after distancing itself from the deal.\n\n“Non-certification is a terrible, terrible policy and even a crisis,” Blanc said, “but it will be nothing compared to the crisis if the U.S. actually fails to implement its JCPOA commitments to lift nuclear-related sanctions.”", "link": "http://feedproxy.google.com/~r/thedailybeast/articles/~3/CpJW7X_CKIg/we-dont-stand-by-our-agreements-diplos-brace-for-donald-trumps-assault-on-the-iran-deal", "logo": "https://www.thedailybeast.com/static/images/square_logo_1x.16983b61.png", "left_right_score": 0.053359754696666435, "bias": 1, "title": "‘We Don’t Stand by Our Agreements’: Diplos Brace for Donald Trump’s Assault on the Iran Deal", "facebook_likes": 292, "source": "Daily Beast"}, "Fox News": {"body": "Former U.N. ambassador named as new National Security Adviser. In a separate development, NSA Cyber Security Division chief speaks with Catherine Herridge.\n\n\t                        \t\n\n\t\t\t\t\t \n\n\t\t\t\t  \n\n              \n\n            \n\t\t \n\n    \n\n\n\n\n\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\n\n\n \n\n\n\n       \n       \n      \n          \n              President Trump’s decision Thursday to appoint former U.N. Ambassador John Bolton as national security adviser brings a hawkish presence, combined with a bulldog spirit, to the White House.\n \n\n              \n                  \n                  \n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Trump announced late Thursday that Bolton would replace H.R. McMaster in the post, and while the Bush-era hawk's staunch defense of the war in Iraq may conflict with Trump’s more skeptical approach, his stand on other issues -- along with his penchant for getting in the face of his opponents -- makes him a natural fit for the Trump White House.\n \n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              \"I think what you said is offensive and inappropriate -- you are a munchkin in the media,” Bolton said to a Sky News host in January who asked if Trump was a “slippery fish.”\n \n\n              \n             \n                           \t\t\n\t\t\t\t\t\n              \n              \n              \n              \n\n\n              \n          \n              While he served at the U.N., he was no fan of the place, once saying that if the headquarters in New York City lost 10 stories, “it wouldn’t make a bit of difference.”\n \n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              So controversial was Bolton, who served under the Reagan and both Bush administrations, that he was unable to gain enough votes to be confirmed by the Senate as U.N. ambassador and was instead appointed by recess. He has also mulled presidential runs in 2012 and 2016.\n \n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              But while Trump has been hesitant on the value of military action in far-away theaters, Bolton’s hawkishness and bullishness do align somewhat with Trump.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n                  \n              \n          \n              Particularly they both share a strong skepticism of the 2015 Iran nuclear deal, which Trump has repeatedly promised to tear up if it cannot be satisfactorily re-negotiated. Bolton has gone even further. In 2015, Bolton wrote an article for The New York Times, titled: “To Stop Iran’s Bomb, Bomb Iran.”\n \n\n              \n             \n               \n              \n              \n              \n\n\n    \n    \n    \t\n\t\t\n    \n\n\n\n\n\n\n\n              \n          \n              He also supports Trump’s aggressive stance on North Korea. He recently wrote an op-ed for The Wall Street Journal, called “The Legal Case for Striking North Korea First.” \n \n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              “In 1837 Britain unleashed pre-emptive ‘fire and fury’ against a wooden steamboat,” he wrote. “It is perfectly legitimate for the United States to respond to the current “necessity” posed by North Korea’s nuclear weapons by striking first.”\n \n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              It is not clear if he will support Trump’s move to meet with North Korean leader Kim Jong-un. He has also expressed significantly more skepticism about Russia and has called for a “strong response” from NATO to the poisoning of a former spy in the U.K.\n \n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              But Axios reported that Bolton has a reputation not only for having hawkish tendencies, but also for getting things done.\n \n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              “My problem with you, over the years, has been, you’re too competent,” then-Sen. Joe Biden told Bolton during his 2001 confirmation hearing for undersecretary of State for arms control and international security affairs.\n \n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Bolton said as much himself in an interview with Fox News’ Martha MacCallum Thursday night.\n \n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              “I’ve been in a lots of bureaucracies, and I’ve seen the way that bureaucracies that don’t like decisions, sit on them,” he said. “So I know my way around the corridors in Washington and I think that role will also be important.”\n \n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Sen. Chuck Schumer, D-NY, said in a statement Thursday night that he hoped Bolton would “temper” his military-first instincts.\n \n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              “Mr. Bolton’s tendency to try to solve every geopolitical problem with the American military first is a troubling one,” Schumer said. “I hope he will temper his instinct to commit the men and women of our armed forces to conflicts around the globe, when we need to be focused on building the middle class here at home.”\n\n              \n             \n               \n              \n              \n              \n\n\n    \n    \n    \t\n\t\t\n    \n\n\n\n\n\n\n\n              \n          \n              Sen. Chris Coons, D-Del., a member of the Senate Foreign Relations Committee, said he was “deeply concerned” by Bolton's positions and he hoped Bolton would “moderate his positions and work closely with our military, diplomatic, intelligence, and development professionals before rushing into armed conflict.”\n \n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              But Republican hawks welcomed the appointment.\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              “He believes in a strong military, going after terrorists, taking the gloves off,” Sen. Lindsey Graham, R-S.C. said on \"Fox and Friends.\"\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n               “He is a diplomat. But he understands that if you're going to deal with thugs like in Iran, you have to be taken seriously.  \n \n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              Bolton is likely to encourage Trump’s more bullish tendencies when it comes to foreign policy, and some lawmakers are expecting a significant pivot in terms of foreign policy remarks from the White House.\n \n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n              “The era of leading-from-behind is over,” Graham said. “John Bolton is a leading-from-the-front kinda guy.”\n\n              \n             \n               \n              \n              \n              \n\n\n              \n          \n  \n          \n              \n              \n\n\n \n\n\t\n\t\t\n\t\t\tAdam Shaw is a Politics Reporter and occasional Opinion writer for FoxNews.com. He can be reached here or on Twitter: @AdamShawNY.", "link": "http://feeds.foxnews.com/~r/foxnews/most-popular/~3/geXbh8sNsZE/trumps-pick-bolton-for-nsa-chief-brings-bulldog-to-white-house.html", "logo": "http://tools.foxnews.com/sites/tools.foxnews.com/files/images/fox-news-logo.png", "left_right_score": 0.17011701146500244, "bias": 4, "title": "Trump's pick of Bolton for NSA chief brings a bulldog to the White House", "facebook_likes": 0, "source": "Fox News"}, "Bloomberg": {"body": "The most striking thing about how President Donald Trump chose his new national security adviser, John Bolton, and new director of the National Economic Council, Larry Kudlow, isn't about either of them personally, although neither is well suited to the honest-broker role that their position calls for. Nor is it that Trump seems to have hired both of them because he liked watching them on television. That's a deeply flawed reason to hire anyone, to be sure, but we're accustomed to how Trump hires people based on superficial criteria. \nWhat is striking is that both are essentially within the mainstream of the Republican Party on policy approaches that ended in disaster during the last Republican presidency. Bolton was part of the George W. Bush administration as it prepared for and fought the Iraq War; Kudlow hasn't been in government for years, but he was a cheerleader for Bush's policies as the economy plunged into a terrible recession. Neither of them was discredited as a result, because Republicans have collectively decided that their policies in 2001-2008 were correct, regardless of outcome.\nThis is ... unusual. Democrats after the Jimmy Carter years pretty much exiled everyone in that White House from further influence within the party; Bill Clinton wouldn't even hire Carter people who had survived with excellent reputations. Democrats after 1968 went through a bitter fight over foreign policy, with most of those who supported the Vietnam War inside the Kennedy and Johnson administrations losing their place in the party and the entire foreign-policy establishment overturned. And Eisenhower Republicans rejected Hoover economic approaches. In other words, parties usually deal with major policy failures by ridding themselves of those held responsible. \n\n        \n        Electorates have very short memories, and they pay way more attention to their task of throwing out the current rascals than checking on who the new rascals will be. Parties don't want to repeat their mistakes, presumably for straightforward good-governance reasons and in accord with the electoral incentive to try to make voters happy.\nThe truth is many Republicans, including governing professionals such as Bolton, just don't see the Iraq War as a policy disaster. I don't think that's quite true on economic policy, but in that area, they've managed to convince themselves that the party out of office was responsible. \nIn some ways, the traditional party reaction to policy failure can be a mistake, with parties freezing out talented people who just happened to be there when things went wrong. The best approach is almost certainly a middle ground, in which the party takes a good, hard look at how things went awry and who should be discredited. But there's not much evidence that's happened for Republicans. It's just one of the many things suggesting normal party incentives aren't working properly for the party. And that leaves them much less prepared to govern than they should be ... Trump or no Trump. \n1. Kathryn Dunn Tenpas on the White House turnover rate. \n2. Dan Drezner on Trump's foreign-policy team (pre-Bolton).\n\n        \n        \n        \n        3. Paul Starr on the current threat to U.S. democracy. My general sense is that the threat is real, but that we're better off thinking of democracy as a continuum rather than democracy and authoritarianism as alternatives. Either way, strong support for democracy is warranted.\n4. Geoffrey Skelley has a recent history of House retirements.\n5. Jack Goldsmith and Maddie McMahon at Lawfare on how the Robert Mueller investigation is supposed to end. Specifically, they argue against a Starr Report model. \n\n        \n        6. Greg Sargent on the damage Trump could sustain from Stormy Daniels and the other women speaking out about him. \n7. And my Bloomberg View colleague Ramesh Ponnuru on flattering Trump. \nGet Early Returns every morning in your inbox. Click here to subscribe.\nThis column does not necessarily reflect the opinion of the editorial board or Bloomberg LP and its owners.\nTo contact the author of this story:\n                Jonathan Bernstein     at jbernstein62@bloomberg.net\nTo contact the editor responsible for this story:\n                Brooke Sample     at bsample1@bloomberg.net", "link": "https://www.bloomberg.com/view/articles/2018-03-23/republicans-are-turning-a-blind-eye-to-bad-policy", "logo": null, "left_right_score": 0.052177497662695665, "bias": 3, "title": "Republicans Are Turning a Blind Eye to Bad Policy", "facebook_likes": 52, "source": "Bloomberg"}, "The Washington Times": {"body": "A federal judge officially accepted President Trump’s pardon of former Sheriff Joe Arpiao Wednesday, rejected the demand of Democrats and anti-Trump lawyers to reject the pardon and enforce the contempt-of-court conviction.The Justice Department had sided with Mr. Arpaio, saying the president’s pardon should end the matter.Judge Susan Bolton had convicted Mr. Arpaio in July and the former lawman was fighting her decision, asking her for a retrial and promising an appeal. Mr. Trump, though, short-circuited the issue with his pardon.\n                 LOAD COMMENTS ()\n              HIDE COMMENTS", "link": "http://www.washingtontimes.com/news/2017/oct/4/federal-judge-accepts-arpaio-pardon/?utm_source=RSS_Feed&utm_medium=RSS", "logo": null, "left_right_score": 0.9400633793450565, "bias": 5, "title": "Federal judge accepts Sheriff Arpaio pardon", "facebook_likes": 839, "source": "The Washington Times"}, "NPR": {"body": "Federal Judge Will Not Void Guilty Ruling On Arpaio, Despite Trump's Pardon\n\nU.S. District Court Judge Susan Ritchie Bolton says that President Trump's pardon of former Maricopa County Sheriff Joe Arpaio does not \"revise the historical facts\" of his case — and that she will not vacate her ruling that found Arpaio guilty of criminal contempt.\n\nOn Thursday, Bolton quoted Black's Law Dictionary to say that a pardon \"releases the wrongdoer from punishment and restores the offender's civil rights without qualification.\" But she then added a further interpretation in her own words: \"It does not erase a judgment of conviction, or its underlying legal and factual findings.\"\n\nCiting legal precedents, Bolton said that while a pardon removes the threat of punishment, it does not \"blot out guilt.\" Instead, she wrote in her decision, accepting a pardon implies a confession of guilt. Bolton also suggested that the timing of President Trump's pardon — coming when Arpaio had not appealed her verdict — played a role in her decision to preserve it.\n\nFamous for his hard-line stance on immigration, Arpaio was found to be in contempt after he consistently disobeyed a court order by continuing to make immigration arrests after he was told to stop. In July, Bolton presided over a five-day trial; she found Arpaio guilty on July 31 and ordered him to be sentenced on Oct. 5 — but President Trump intervened with a pardon in late August.\n\nIn her decision, Bolton notes that unlike in legal precedents where a new trial or appeal was ongoing, Arpaio's didn't have an appeal pending. The judge writes, \"the only matter mooted by the pardon was Defendant's sentencing and entry of judgment, the hearing for which was duly vacated.\" She added, \"With nothing left to vacate, dismissal with prejudice was all that remained to be ordered. Having already done so, the Court declines to order any further relief.\"\n\nThe situation could place Arpaio in a type of catch-22, in which he's been saved from punishment by President Trump's pardon but is unable to clear his name fully in the legal record.\n\nWith that side of the story, here's member station KJZZ in Phoenix:\n\n\"Arpaio attorney Jack Wilenchik said because of the pardon, the former sheriff will never have the chance to appeal the ruling, leaving him open to future lawsuits. \" 'What if an illegal alien who claims they were wrongfully detained were to sue civilly, then the fact that he was convicted of willfully defying the court order could be used against him,' said Wilenchik. \"Wilenchik said he was not surprised that the judge had refused to undo her own order. He said he has appealed the judge's order to the 9th Circuit Court of Appeals.\"\n\nBolton handed down her decision roughly one year after she approved a federal contempt charge against Arpaio. The charge had originated with a civil contempt finding by Judge G. Murray Snow in Melendres v. Arpaio, a class action lawsuit backed by the ACLU that accused the sheriff and his officers of racial profiling.", "link": "http://www.npr.org/sections/thetwo-way/2017/10/20/558978896/federal-judge-will-not-void-guilty-ruling-on-arpaio-despite-trumps-pardon?utm_medium=RSS&utm_campaign=storiesfromnpr", "logo": "https://media.npr.org/images/podcasts/primary/npr_generic_image_300.jpg?s=200", "left_right_score": 0.27301741986478095, "bias": 3, "title": "Federal Judge Will Not Void Guilty Ruling On Arpaio, Despite Trump's Pardon", "facebook_likes": 0, "source": "NPR"}}